/*
 * Generated by gloam 0.4.8. DO NOT EDIT.
 *
 *   gloam --api vk --fetch --out-path vulkan --quiet c --alias --loader --external-headers
 *
 * Extensions: all (458 included)
 *
 * Copyright (c) 2026 Steven Noonan
 * SPDX-License-Identifier: MIT
 *
 * Portions derived from Khronos Group XML API Registry specifications.
 * Copyright (c) 2013-2026 The Khronos Group Inc.
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef GLOAM_VULKAN_H
#define GLOAM_VULKAN_H


/* ---- Platform detection ------------------------------------------------ */
#ifndef GLOAM_PLATFORM_DETECTED_
#define GLOAM_PLATFORM_DETECTED_
#if defined(__CYGWIN__) || defined(_WIN32)
#  define GLOAM_PLATFORM_WINDOWS 1
#endif
#if defined(__linux)
#  define GLOAM_PLATFORM_LINUX 1
#endif
#endif /* GLOAM_PLATFORM_DETECTED_ */

#ifndef GLOAM_HAS_ENUM_BASE_TYPE
#if defined(__cplusplus) || (defined(__STDC_VERSION__) && __STDC_VERSION__ >= 202311L)
#  define GLOAM_HAS_ENUM_BASE_TYPE 1
#else
#  define GLOAM_HAS_ENUM_BASE_TYPE 0
#endif
#endif

#ifndef GLOAM_FORCE_INLINE
#if defined(_MSC_VER)
#  define GLOAM_FORCE_INLINE static __forceinline
#elif defined(__GNUC__) || defined(__clang__)
#  define GLOAM_FORCE_INLINE static inline __attribute__((always_inline))
#else
#  define GLOAM_FORCE_INLINE static inline
#endif
#endif

#ifndef VK_NO_PROTOTYPES
#define VK_NO_PROTOTYPES
#endif

#ifndef VULKAN_H_
#include <vulkan/vk_platform.h>
#include <vulkan/vulkan_core.h>
#endif

#if !defined(VULKAN_H_)

#ifdef VK_USE_PLATFORM_ANDROID_KHR
#include <vulkan/vulkan_android.h>
#endif

#ifdef VK_USE_PLATFORM_FUCHSIA
#include <zircon/types.h>
#include <vulkan/vulkan_fuchsia.h>
#endif

#ifdef VK_USE_PLATFORM_IOS_MVK
#include <vulkan/vulkan_ios.h>
#endif

#ifdef VK_USE_PLATFORM_MACOS_MVK
#include <vulkan/vulkan_macos.h>
#endif

#ifdef VK_USE_PLATFORM_METAL_EXT
#include <vulkan/vulkan_metal.h>
#endif

#ifdef VK_USE_PLATFORM_VI_NN
#include <vulkan/vulkan_vi.h>
#endif

#ifdef VK_USE_PLATFORM_WAYLAND_KHR
#include <vulkan/vulkan_wayland.h>
#endif

#ifdef VK_USE_PLATFORM_WIN32_KHR
typedef unsigned long DWORD;
typedef const wchar_t* LPCWSTR;
typedef void* HANDLE;
typedef struct HINSTANCE__* HINSTANCE;
typedef struct HWND__* HWND;
typedef struct HMONITOR__* HMONITOR;
typedef struct _SECURITY_ATTRIBUTES SECURITY_ATTRIBUTES;
#include <vulkan/vulkan_win32.h>
#endif

#ifdef VK_USE_PLATFORM_XCB_KHR
#include <xcb/xcb.h>
#include <vulkan/vulkan_xcb.h>
#endif

#ifdef VK_USE_PLATFORM_XLIB_KHR
typedef struct _XDisplay Display;
typedef unsigned long Window;
typedef unsigned long VisualID;
#include <vulkan/vulkan_xlib.h>
#endif

#ifdef VK_USE_PLATFORM_DIRECTFB_EXT
#include <directfb.h>
#include <vulkan/vulkan_directfb.h>
#endif

#ifdef VK_USE_PLATFORM_XLIB_XRANDR_EXT
typedef struct _XDisplay Display;
typedef unsigned long RROutput;
#include <vulkan/vulkan_xlib_xrandr.h>
#endif

#ifdef VK_USE_PLATFORM_GGP
#include <ggp_c/vulkan_types.h>
#include <vulkan/vulkan_ggp.h>
#endif

#ifdef VK_USE_PLATFORM_SCREEN_QNX
#include <screen/screen.h>
#include <vulkan/vulkan_screen.h>
#endif

#ifdef VK_USE_PLATFORM_SCI
#include <nvscisync.h>
#include <nvscibuf.h>
#include <vulkan/vulkan_sci.h>
#endif

#ifdef VK_ENABLE_BETA_EXTENSIONS
#include <vulkan/vulkan_beta.h>
#endif

#ifdef VK_USE_PLATFORM_OHOS
#include <vulkan/vulkan_ohos.h>
#endif

#endif /* !defined(VULKAN_H_) */
#ifdef __cplusplus
extern "C" {
#endif

/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamVulkanContext {
    union {
        unsigned char featArray[5];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        };
    };

    union {
        unsigned char extArray[458];
        struct {
        /*    0 */ unsigned char AMDX_dense_geometry_format;
        /*    1 */ unsigned char AMDX_shader_enqueue;
        /*    2 */ unsigned char AMD_anti_lag;
        /*    3 */ unsigned char AMD_buffer_marker;
        /*    4 */ unsigned char AMD_device_coherent_memory;
        /*    5 */ unsigned char AMD_display_native_hdr;
        /*    6 */ unsigned char AMD_draw_indirect_count;
        /*    7 */ unsigned char AMD_gcn_shader;
        /*    8 */ unsigned char AMD_gpu_shader_half_float;
        /*    9 */ unsigned char AMD_gpu_shader_int16;
        /*   10 */ unsigned char AMD_memory_overallocation_behavior;
        /*   11 */ unsigned char AMD_mixed_attachment_samples;
        /*   12 */ unsigned char AMD_negative_viewport_height;
        /*   13 */ unsigned char AMD_pipeline_compiler_control;
        /*   14 */ unsigned char AMD_rasterization_order;
        /*   15 */ unsigned char AMD_shader_ballot;
        /*   16 */ unsigned char AMD_shader_core_properties;
        /*   17 */ unsigned char AMD_shader_core_properties2;
        /*   18 */ unsigned char AMD_shader_early_and_late_fragment_tests;
        /*   19 */ unsigned char AMD_shader_explicit_vertex_parameter;
        /*   20 */ unsigned char AMD_shader_fragment_mask;
        /*   21 */ unsigned char AMD_shader_image_load_store_lod;
        /*   22 */ unsigned char AMD_shader_info;
        /*   23 */ unsigned char AMD_shader_trinary_minmax;
        /*   24 */ unsigned char AMD_texture_gather_bias_lod;
        /*   25 */ unsigned char ANDROID_external_format_resolve;
        /*   26 */ unsigned char ANDROID_external_memory_android_hardware_buffer;
        /*   27 */ unsigned char ARM_data_graph;
        /*   28 */ unsigned char ARM_data_graph_instruction_set_tosa;
        /*   29 */ unsigned char ARM_data_graph_neural_accelerator_statistics;
        /*   30 */ unsigned char ARM_data_graph_optical_flow;
        /*   31 */ unsigned char ARM_format_pack;
        /*   32 */ unsigned char ARM_performance_counters_by_region;
        /*   33 */ unsigned char ARM_pipeline_opacity_micromap;
        /*   34 */ unsigned char ARM_rasterization_order_attachment_access;
        /*   35 */ unsigned char ARM_render_pass_striped;
        /*   36 */ unsigned char ARM_scheduling_controls;
        /*   37 */ unsigned char ARM_shader_core_builtins;
        /*   38 */ unsigned char ARM_shader_core_properties;
        /*   39 */ unsigned char ARM_shader_instrumentation;
        /*   40 */ unsigned char ARM_tensors;
        /*   41 */ unsigned char EXT_4444_formats;
        /*   42 */ unsigned char EXT_acquire_drm_display;
        /*   43 */ unsigned char EXT_acquire_xlib_display;
        /*   44 */ unsigned char EXT_astc_decode_mode;
        /*   45 */ unsigned char EXT_attachment_feedback_loop_dynamic_state;
        /*   46 */ unsigned char EXT_attachment_feedback_loop_layout;
        /*   47 */ unsigned char EXT_blend_operation_advanced;
        /*   48 */ unsigned char EXT_border_color_swizzle;
        /*   49 */ unsigned char EXT_buffer_device_address;
        /*   50 */ unsigned char EXT_calibrated_timestamps;
        /*   51 */ unsigned char EXT_color_write_enable;
        /*   52 */ unsigned char EXT_conditional_rendering;
        /*   53 */ unsigned char EXT_conservative_rasterization;
        /*   54 */ unsigned char EXT_custom_border_color;
        /*   55 */ unsigned char EXT_custom_resolve;
        /*   56 */ unsigned char EXT_debug_marker;
        /*   57 */ unsigned char EXT_debug_report;
        /*   58 */ unsigned char EXT_debug_utils;
        /*   59 */ unsigned char EXT_depth_bias_control;
        /*   60 */ unsigned char EXT_depth_clamp_control;
        /*   61 */ unsigned char EXT_depth_clamp_zero_one;
        /*   62 */ unsigned char EXT_depth_clip_control;
        /*   63 */ unsigned char EXT_depth_clip_enable;
        /*   64 */ unsigned char EXT_depth_range_unrestricted;
        /*   65 */ unsigned char EXT_descriptor_buffer;
        /*   66 */ unsigned char EXT_descriptor_heap;
        /*   67 */ unsigned char EXT_descriptor_indexing;
        /*   68 */ unsigned char EXT_device_address_binding_report;
        /*   69 */ unsigned char EXT_device_fault;
        /*   70 */ unsigned char EXT_device_generated_commands;
        /*   71 */ unsigned char EXT_device_memory_report;
        /*   72 */ unsigned char EXT_direct_mode_display;
        /*   73 */ unsigned char EXT_directfb_surface;
        /*   74 */ unsigned char EXT_discard_rectangles;
        /*   75 */ unsigned char EXT_display_control;
        /*   76 */ unsigned char EXT_display_surface_counter;
        /*   77 */ unsigned char EXT_dynamic_rendering_unused_attachments;
        /*   78 */ unsigned char EXT_extended_dynamic_state;
        /*   79 */ unsigned char EXT_extended_dynamic_state2;
        /*   80 */ unsigned char EXT_extended_dynamic_state3;
        /*   81 */ unsigned char EXT_external_memory_acquire_unmodified;
        /*   82 */ unsigned char EXT_external_memory_dma_buf;
        /*   83 */ unsigned char EXT_external_memory_host;
        /*   84 */ unsigned char EXT_external_memory_metal;
        /*   85 */ unsigned char EXT_filter_cubic;
        /*   86 */ unsigned char EXT_fragment_density_map;
        /*   87 */ unsigned char EXT_fragment_density_map2;
        /*   88 */ unsigned char EXT_fragment_density_map_offset;
        /*   89 */ unsigned char EXT_fragment_shader_interlock;
        /*   90 */ unsigned char EXT_frame_boundary;
        /*   91 */ unsigned char EXT_full_screen_exclusive;
        /*   92 */ unsigned char EXT_global_priority;
        /*   93 */ unsigned char EXT_global_priority_query;
        /*   94 */ unsigned char EXT_graphics_pipeline_library;
        /*   95 */ unsigned char EXT_hdr_metadata;
        /*   96 */ unsigned char EXT_headless_surface;
        /*   97 */ unsigned char EXT_host_image_copy;
        /*   98 */ unsigned char EXT_host_query_reset;
        /*   99 */ unsigned char EXT_image_2d_view_of_3d;
        /*  100 */ unsigned char EXT_image_compression_control;
        /*  101 */ unsigned char EXT_image_compression_control_swapchain;
        /*  102 */ unsigned char EXT_image_drm_format_modifier;
        /*  103 */ unsigned char EXT_image_robustness;
        /*  104 */ unsigned char EXT_image_sliced_view_of_3d;
        /*  105 */ unsigned char EXT_image_view_min_lod;
        /*  106 */ unsigned char EXT_index_type_uint8;
        /*  107 */ unsigned char EXT_inline_uniform_block;
        /*  108 */ unsigned char EXT_layer_settings;
        /*  109 */ unsigned char EXT_legacy_dithering;
        /*  110 */ unsigned char EXT_legacy_vertex_attributes;
        /*  111 */ unsigned char EXT_line_rasterization;
        /*  112 */ unsigned char EXT_load_store_op_none;
        /*  113 */ unsigned char EXT_map_memory_placed;
        /*  114 */ unsigned char EXT_memory_budget;
        /*  115 */ unsigned char EXT_memory_decompression;
        /*  116 */ unsigned char EXT_memory_priority;
        /*  117 */ unsigned char EXT_mesh_shader;
        /*  118 */ unsigned char EXT_metal_objects;
        /*  119 */ unsigned char EXT_metal_surface;
        /*  120 */ unsigned char EXT_multi_draw;
        /*  121 */ unsigned char EXT_multisampled_render_to_single_sampled;
        /*  122 */ unsigned char EXT_mutable_descriptor_type;
        /*  123 */ unsigned char EXT_nested_command_buffer;
        /*  124 */ unsigned char EXT_non_seamless_cube_map;
        /*  125 */ unsigned char EXT_opacity_micromap;
        /*  126 */ unsigned char EXT_pageable_device_local_memory;
        /*  127 */ unsigned char EXT_pci_bus_info;
        /*  128 */ unsigned char EXT_physical_device_drm;
        /*  129 */ unsigned char EXT_pipeline_creation_cache_control;
        /*  130 */ unsigned char EXT_pipeline_creation_feedback;
        /*  131 */ unsigned char EXT_pipeline_library_group_handles;
        /*  132 */ unsigned char EXT_pipeline_properties;
        /*  133 */ unsigned char EXT_pipeline_protected_access;
        /*  134 */ unsigned char EXT_pipeline_robustness;
        /*  135 */ unsigned char EXT_post_depth_coverage;
        /*  136 */ unsigned char EXT_present_mode_fifo_latest_ready;
        /*  137 */ unsigned char EXT_present_timing;
        /*  138 */ unsigned char EXT_primitive_restart_index;
        /*  139 */ unsigned char EXT_primitive_topology_list_restart;
        /*  140 */ unsigned char EXT_primitives_generated_query;
        /*  141 */ unsigned char EXT_private_data;
        /*  142 */ unsigned char EXT_provoking_vertex;
        /*  143 */ unsigned char EXT_queue_family_foreign;
        /*  144 */ unsigned char EXT_rasterization_order_attachment_access;
        /*  145 */ unsigned char EXT_ray_tracing_invocation_reorder;
        /*  146 */ unsigned char EXT_rgba10x6_formats;
        /*  147 */ unsigned char EXT_robustness2;
        /*  148 */ unsigned char EXT_sample_locations;
        /*  149 */ unsigned char EXT_sampler_filter_minmax;
        /*  150 */ unsigned char EXT_scalar_block_layout;
        /*  151 */ unsigned char EXT_separate_stencil_usage;
        /*  152 */ unsigned char EXT_shader_64bit_indexing;
        /*  153 */ unsigned char EXT_shader_atomic_float;
        /*  154 */ unsigned char EXT_shader_atomic_float2;
        /*  155 */ unsigned char EXT_shader_demote_to_helper_invocation;
        /*  156 */ unsigned char EXT_shader_float8;
        /*  157 */ unsigned char EXT_shader_image_atomic_int64;
        /*  158 */ unsigned char EXT_shader_long_vector;
        /*  159 */ unsigned char EXT_shader_module_identifier;
        /*  160 */ unsigned char EXT_shader_object;
        /*  161 */ unsigned char EXT_shader_replicated_composites;
        /*  162 */ unsigned char EXT_shader_stencil_export;
        /*  163 */ unsigned char EXT_shader_subgroup_ballot;
        /*  164 */ unsigned char EXT_shader_subgroup_partitioned;
        /*  165 */ unsigned char EXT_shader_subgroup_vote;
        /*  166 */ unsigned char EXT_shader_tile_image;
        /*  167 */ unsigned char EXT_shader_uniform_buffer_unsized_array;
        /*  168 */ unsigned char EXT_shader_viewport_index_layer;
        /*  169 */ unsigned char EXT_subgroup_size_control;
        /*  170 */ unsigned char EXT_subpass_merge_feedback;
        /*  171 */ unsigned char EXT_surface_maintenance1;
        /*  172 */ unsigned char EXT_swapchain_colorspace;
        /*  173 */ unsigned char EXT_swapchain_maintenance1;
        /*  174 */ unsigned char EXT_texel_buffer_alignment;
        /*  175 */ unsigned char EXT_texture_compression_astc_3d;
        /*  176 */ unsigned char EXT_texture_compression_astc_hdr;
        /*  177 */ unsigned char EXT_tooling_info;
        /*  178 */ unsigned char EXT_transform_feedback;
        /*  179 */ unsigned char EXT_validation_cache;
        /*  180 */ unsigned char EXT_validation_features;
        /*  181 */ unsigned char EXT_validation_flags;
        /*  182 */ unsigned char EXT_vertex_attribute_divisor;
        /*  183 */ unsigned char EXT_vertex_attribute_robustness;
        /*  184 */ unsigned char EXT_vertex_input_dynamic_state;
        /*  185 */ unsigned char EXT_ycbcr_2plane_444_formats;
        /*  186 */ unsigned char EXT_ycbcr_image_arrays;
        /*  187 */ unsigned char EXT_zero_initialize_device_memory;
        /*  188 */ unsigned char FUCHSIA_buffer_collection;
        /*  189 */ unsigned char FUCHSIA_external_memory;
        /*  190 */ unsigned char FUCHSIA_external_semaphore;
        /*  191 */ unsigned char FUCHSIA_imagepipe_surface;
        /*  192 */ unsigned char GGP_frame_token;
        /*  193 */ unsigned char GGP_stream_descriptor_surface;
        /*  194 */ unsigned char GOOGLE_decorate_string;
        /*  195 */ unsigned char GOOGLE_display_timing;
        /*  196 */ unsigned char GOOGLE_hlsl_functionality1;
        /*  197 */ unsigned char GOOGLE_surfaceless_query;
        /*  198 */ unsigned char GOOGLE_user_type;
        /*  199 */ unsigned char HUAWEI_cluster_culling_shader;
        /*  200 */ unsigned char HUAWEI_hdr_vivid;
        /*  201 */ unsigned char HUAWEI_invocation_mask;
        /*  202 */ unsigned char HUAWEI_subpass_shading;
        /*  203 */ unsigned char IMG_filter_cubic;
        /*  204 */ unsigned char IMG_format_pvrtc;
        /*  205 */ unsigned char IMG_relaxed_line_rasterization;
        /*  206 */ unsigned char INTEL_performance_query;
        /*  207 */ unsigned char INTEL_shader_integer_functions2;
        /*  208 */ unsigned char KHR_16bit_storage;
        /*  209 */ unsigned char KHR_8bit_storage;
        /*  210 */ unsigned char KHR_acceleration_structure;
        /*  211 */ unsigned char KHR_android_surface;
        /*  212 */ unsigned char KHR_bind_memory2;
        /*  213 */ unsigned char KHR_buffer_device_address;
        /*  214 */ unsigned char KHR_calibrated_timestamps;
        /*  215 */ unsigned char KHR_compute_shader_derivatives;
        /*  216 */ unsigned char KHR_cooperative_matrix;
        /*  217 */ unsigned char KHR_copy_commands2;
        /*  218 */ unsigned char KHR_copy_memory_indirect;
        /*  219 */ unsigned char KHR_create_renderpass2;
        /*  220 */ unsigned char KHR_dedicated_allocation;
        /*  221 */ unsigned char KHR_deferred_host_operations;
        /*  222 */ unsigned char KHR_depth_clamp_zero_one;
        /*  223 */ unsigned char KHR_depth_stencil_resolve;
        /*  224 */ unsigned char KHR_descriptor_update_template;
        /*  225 */ unsigned char KHR_device_address_commands;
        /*  226 */ unsigned char KHR_device_fault;
        /*  227 */ unsigned char KHR_device_group;
        /*  228 */ unsigned char KHR_device_group_creation;
        /*  229 */ unsigned char KHR_display;
        /*  230 */ unsigned char KHR_display_swapchain;
        /*  231 */ unsigned char KHR_draw_indirect_count;
        /*  232 */ unsigned char KHR_driver_properties;
        /*  233 */ unsigned char KHR_dynamic_rendering;
        /*  234 */ unsigned char KHR_dynamic_rendering_local_read;
        /*  235 */ unsigned char KHR_external_fence;
        /*  236 */ unsigned char KHR_external_fence_capabilities;
        /*  237 */ unsigned char KHR_external_fence_fd;
        /*  238 */ unsigned char KHR_external_fence_win32;
        /*  239 */ unsigned char KHR_external_memory;
        /*  240 */ unsigned char KHR_external_memory_capabilities;
        /*  241 */ unsigned char KHR_external_memory_fd;
        /*  242 */ unsigned char KHR_external_memory_win32;
        /*  243 */ unsigned char KHR_external_semaphore;
        /*  244 */ unsigned char KHR_external_semaphore_capabilities;
        /*  245 */ unsigned char KHR_external_semaphore_fd;
        /*  246 */ unsigned char KHR_external_semaphore_win32;
        /*  247 */ unsigned char KHR_format_feature_flags2;
        /*  248 */ unsigned char KHR_fragment_shader_barycentric;
        /*  249 */ unsigned char KHR_fragment_shading_rate;
        /*  250 */ unsigned char KHR_get_display_properties2;
        /*  251 */ unsigned char KHR_get_memory_requirements2;
        /*  252 */ unsigned char KHR_get_physical_device_properties2;
        /*  253 */ unsigned char KHR_get_surface_capabilities2;
        /*  254 */ unsigned char KHR_global_priority;
        /*  255 */ unsigned char KHR_image_format_list;
        /*  256 */ unsigned char KHR_imageless_framebuffer;
        /*  257 */ unsigned char KHR_incremental_present;
        /*  258 */ unsigned char KHR_index_type_uint8;
        /*  259 */ unsigned char KHR_internally_synchronized_queues;
        /*  260 */ unsigned char KHR_line_rasterization;
        /*  261 */ unsigned char KHR_load_store_op_none;
        /*  262 */ unsigned char KHR_maintenance1;
        /*  263 */ unsigned char KHR_maintenance10;
        /*  264 */ unsigned char KHR_maintenance11;
        /*  265 */ unsigned char KHR_maintenance2;
        /*  266 */ unsigned char KHR_maintenance3;
        /*  267 */ unsigned char KHR_maintenance4;
        /*  268 */ unsigned char KHR_maintenance5;
        /*  269 */ unsigned char KHR_maintenance6;
        /*  270 */ unsigned char KHR_maintenance7;
        /*  271 */ unsigned char KHR_maintenance8;
        /*  272 */ unsigned char KHR_maintenance9;
        /*  273 */ unsigned char KHR_map_memory2;
        /*  274 */ unsigned char KHR_multiview;
        /*  275 */ unsigned char KHR_performance_query;
        /*  276 */ unsigned char KHR_pipeline_binary;
        /*  277 */ unsigned char KHR_pipeline_executable_properties;
        /*  278 */ unsigned char KHR_pipeline_library;
        /*  279 */ unsigned char KHR_portability_enumeration;
        /*  280 */ unsigned char KHR_portability_subset;
        /*  281 */ unsigned char KHR_present_id;
        /*  282 */ unsigned char KHR_present_id2;
        /*  283 */ unsigned char KHR_present_mode_fifo_latest_ready;
        /*  284 */ unsigned char KHR_present_wait;
        /*  285 */ unsigned char KHR_present_wait2;
        /*  286 */ unsigned char KHR_push_descriptor;
        /*  287 */ unsigned char KHR_ray_query;
        /*  288 */ unsigned char KHR_ray_tracing_maintenance1;
        /*  289 */ unsigned char KHR_ray_tracing_pipeline;
        /*  290 */ unsigned char KHR_ray_tracing_position_fetch;
        /*  291 */ unsigned char KHR_relaxed_block_layout;
        /*  292 */ unsigned char KHR_robustness2;
        /*  293 */ unsigned char KHR_sampler_mirror_clamp_to_edge;
        /*  294 */ unsigned char KHR_sampler_ycbcr_conversion;
        /*  295 */ unsigned char KHR_separate_depth_stencil_layouts;
        /*  296 */ unsigned char KHR_shader_abort;
        /*  297 */ unsigned char KHR_shader_atomic_int64;
        /*  298 */ unsigned char KHR_shader_bfloat16;
        /*  299 */ unsigned char KHR_shader_clock;
        /*  300 */ unsigned char KHR_shader_constant_data;
        /*  301 */ unsigned char KHR_shader_draw_parameters;
        /*  302 */ unsigned char KHR_shader_expect_assume;
        /*  303 */ unsigned char KHR_shader_float16_int8;
        /*  304 */ unsigned char KHR_shader_float_controls;
        /*  305 */ unsigned char KHR_shader_float_controls2;
        /*  306 */ unsigned char KHR_shader_fma;
        /*  307 */ unsigned char KHR_shader_integer_dot_product;
        /*  308 */ unsigned char KHR_shader_maximal_reconvergence;
        /*  309 */ unsigned char KHR_shader_non_semantic_info;
        /*  310 */ unsigned char KHR_shader_quad_control;
        /*  311 */ unsigned char KHR_shader_relaxed_extended_instruction;
        /*  312 */ unsigned char KHR_shader_subgroup_extended_types;
        /*  313 */ unsigned char KHR_shader_subgroup_rotate;
        /*  314 */ unsigned char KHR_shader_subgroup_uniform_control_flow;
        /*  315 */ unsigned char KHR_shader_terminate_invocation;
        /*  316 */ unsigned char KHR_shader_untyped_pointers;
        /*  317 */ unsigned char KHR_shared_presentable_image;
        /*  318 */ unsigned char KHR_spirv_1_4;
        /*  319 */ unsigned char KHR_storage_buffer_storage_class;
        /*  320 */ unsigned char KHR_surface;
        /*  321 */ unsigned char KHR_surface_maintenance1;
        /*  322 */ unsigned char KHR_surface_protected_capabilities;
        /*  323 */ unsigned char KHR_swapchain;
        /*  324 */ unsigned char KHR_swapchain_maintenance1;
        /*  325 */ unsigned char KHR_swapchain_mutable_format;
        /*  326 */ unsigned char KHR_synchronization2;
        /*  327 */ unsigned char KHR_timeline_semaphore;
        /*  328 */ unsigned char KHR_unified_image_layouts;
        /*  329 */ unsigned char KHR_uniform_buffer_standard_layout;
        /*  330 */ unsigned char KHR_variable_pointers;
        /*  331 */ unsigned char KHR_vertex_attribute_divisor;
        /*  332 */ unsigned char KHR_video_decode_av1;
        /*  333 */ unsigned char KHR_video_decode_h264;
        /*  334 */ unsigned char KHR_video_decode_h265;
        /*  335 */ unsigned char KHR_video_decode_queue;
        /*  336 */ unsigned char KHR_video_decode_vp9;
        /*  337 */ unsigned char KHR_video_encode_av1;
        /*  338 */ unsigned char KHR_video_encode_h264;
        /*  339 */ unsigned char KHR_video_encode_h265;
        /*  340 */ unsigned char KHR_video_encode_intra_refresh;
        /*  341 */ unsigned char KHR_video_encode_quantization_map;
        /*  342 */ unsigned char KHR_video_encode_queue;
        /*  343 */ unsigned char KHR_video_maintenance1;
        /*  344 */ unsigned char KHR_video_maintenance2;
        /*  345 */ unsigned char KHR_video_queue;
        /*  346 */ unsigned char KHR_vulkan_memory_model;
        /*  347 */ unsigned char KHR_wayland_surface;
        /*  348 */ unsigned char KHR_win32_keyed_mutex;
        /*  349 */ unsigned char KHR_win32_surface;
        /*  350 */ unsigned char KHR_workgroup_memory_explicit_layout;
        /*  351 */ unsigned char KHR_xcb_surface;
        /*  352 */ unsigned char KHR_xlib_surface;
        /*  353 */ unsigned char KHR_zero_initialize_workgroup_memory;
        /*  354 */ unsigned char LUNARG_direct_driver_loading;
        /*  355 */ unsigned char MESA_image_alignment_control;
        /*  356 */ unsigned char MSFT_layered_driver;
        /*  357 */ unsigned char MVK_ios_surface;
        /*  358 */ unsigned char MVK_macos_surface;
        /*  359 */ unsigned char NN_vi_surface;
        /*  360 */ unsigned char NVX_binary_import;
        /*  361 */ unsigned char NVX_image_view_handle;
        /*  362 */ unsigned char NVX_multiview_per_view_attributes;
        /*  363 */ unsigned char NV_acquire_winrt_display;
        /*  364 */ unsigned char NV_clip_space_w_scaling;
        /*  365 */ unsigned char NV_cluster_acceleration_structure;
        /*  366 */ unsigned char NV_command_buffer_inheritance;
        /*  367 */ unsigned char NV_compute_occupancy_priority;
        /*  368 */ unsigned char NV_compute_shader_derivatives;
        /*  369 */ unsigned char NV_cooperative_matrix;
        /*  370 */ unsigned char NV_cooperative_matrix2;
        /*  371 */ unsigned char NV_cooperative_vector;
        /*  372 */ unsigned char NV_copy_memory_indirect;
        /*  373 */ unsigned char NV_corner_sampled_image;
        /*  374 */ unsigned char NV_coverage_reduction_mode;
        /*  375 */ unsigned char NV_cuda_kernel_launch;
        /*  376 */ unsigned char NV_dedicated_allocation;
        /*  377 */ unsigned char NV_dedicated_allocation_image_aliasing;
        /*  378 */ unsigned char NV_descriptor_pool_overallocation;
        /*  379 */ unsigned char NV_device_diagnostic_checkpoints;
        /*  380 */ unsigned char NV_device_diagnostics_config;
        /*  381 */ unsigned char NV_device_generated_commands;
        /*  382 */ unsigned char NV_device_generated_commands_compute;
        /*  383 */ unsigned char NV_displacement_micromap;
        /*  384 */ unsigned char NV_display_stereo;
        /*  385 */ unsigned char NV_extended_sparse_address_space;
        /*  386 */ unsigned char NV_external_compute_queue;
        /*  387 */ unsigned char NV_external_memory;
        /*  388 */ unsigned char NV_external_memory_capabilities;
        /*  389 */ unsigned char NV_external_memory_rdma;
        /*  390 */ unsigned char NV_external_memory_win32;
        /*  391 */ unsigned char NV_fill_rectangle;
        /*  392 */ unsigned char NV_fragment_coverage_to_color;
        /*  393 */ unsigned char NV_fragment_shader_barycentric;
        /*  394 */ unsigned char NV_fragment_shading_rate_enums;
        /*  395 */ unsigned char NV_framebuffer_mixed_samples;
        /*  396 */ unsigned char NV_geometry_shader_passthrough;
        /*  397 */ unsigned char NV_glsl_shader;
        /*  398 */ unsigned char NV_inherited_viewport_scissor;
        /*  399 */ unsigned char NV_linear_color_attachment;
        /*  400 */ unsigned char NV_low_latency;
        /*  401 */ unsigned char NV_low_latency2;
        /*  402 */ unsigned char NV_memory_decompression;
        /*  403 */ unsigned char NV_mesh_shader;
        /*  404 */ unsigned char NV_optical_flow;
        /*  405 */ unsigned char NV_partitioned_acceleration_structure;
        /*  406 */ unsigned char NV_per_stage_descriptor_set;
        /*  407 */ unsigned char NV_present_barrier;
        /*  408 */ unsigned char NV_present_metering;
        /*  409 */ unsigned char NV_push_constant_bank;
        /*  410 */ unsigned char NV_raw_access_chains;
        /*  411 */ unsigned char NV_ray_tracing;
        /*  412 */ unsigned char NV_ray_tracing_invocation_reorder;
        /*  413 */ unsigned char NV_ray_tracing_linear_swept_spheres;
        /*  414 */ unsigned char NV_ray_tracing_motion_blur;
        /*  415 */ unsigned char NV_ray_tracing_validation;
        /*  416 */ unsigned char NV_representative_fragment_test;
        /*  417 */ unsigned char NV_sample_mask_override_coverage;
        /*  418 */ unsigned char NV_scissor_exclusive;
        /*  419 */ unsigned char NV_shader_atomic_float16_vector;
        /*  420 */ unsigned char NV_shader_image_footprint;
        /*  421 */ unsigned char NV_shader_sm_builtins;
        /*  422 */ unsigned char NV_shader_subgroup_partitioned;
        /*  423 */ unsigned char NV_shading_rate_image;
        /*  424 */ unsigned char NV_viewport_array2;
        /*  425 */ unsigned char NV_viewport_swizzle;
        /*  426 */ unsigned char NV_win32_keyed_mutex;
        /*  427 */ unsigned char OHOS_external_memory;
        /*  428 */ unsigned char OHOS_surface;
        /*  429 */ unsigned char QCOM_cooperative_matrix_conversion;
        /*  430 */ unsigned char QCOM_data_graph_model;
        /*  431 */ unsigned char QCOM_filter_cubic_clamp;
        /*  432 */ unsigned char QCOM_filter_cubic_weights;
        /*  433 */ unsigned char QCOM_fragment_density_map_offset;
        /*  434 */ unsigned char QCOM_image_processing;
        /*  435 */ unsigned char QCOM_image_processing2;
        /*  436 */ unsigned char QCOM_multiview_per_view_render_areas;
        /*  437 */ unsigned char QCOM_multiview_per_view_viewports;
        /*  438 */ unsigned char QCOM_queue_perf_hint;
        /*  439 */ unsigned char QCOM_render_pass_shader_resolve;
        /*  440 */ unsigned char QCOM_render_pass_store_ops;
        /*  441 */ unsigned char QCOM_render_pass_transform;
        /*  442 */ unsigned char QCOM_rotated_copy_commands;
        /*  443 */ unsigned char QCOM_tile_memory_heap;
        /*  444 */ unsigned char QCOM_tile_properties;
        /*  445 */ unsigned char QCOM_tile_shading;
        /*  446 */ unsigned char QCOM_ycbcr_degamma;
        /*  447 */ unsigned char QNX_external_memory_screen_buffer;
        /*  448 */ unsigned char QNX_screen_surface;
        /*  449 */ unsigned char SEC_amigo_profiling;
        /*  450 */ unsigned char SEC_pipeline_cache_incremental_mode;
        /*  451 */ unsigned char SEC_throttle_hint;
        /*  452 */ unsigned char SEC_ubm_surface;
        /*  453 */ unsigned char VALVE_descriptor_set_host_mapping;
        /*  454 */ unsigned char VALVE_fragment_density_map_layered;
        /*  455 */ unsigned char VALVE_mutable_descriptor_type;
        /*  456 */ unsigned char VALVE_shader_mixed_float_dot_product;
        /*  457 */ unsigned char VALVE_video_encode_rgb_conversion;
        };
    };

    union {
        void *pfnArray[822];
        struct {
        /*    0 */ PFN_vkAllocateCommandBuffers AllocateCommandBuffers;
        /*    1 */ PFN_vkAllocateDescriptorSets AllocateDescriptorSets;
        /*    2 */ PFN_vkAllocateMemory AllocateMemory;
        /*    3 */ PFN_vkBeginCommandBuffer BeginCommandBuffer;
        /*    4 */ PFN_vkBindBufferMemory BindBufferMemory;
        /*    5 */ PFN_vkBindImageMemory BindImageMemory;
        /*    6 */ PFN_vkCmdBeginQuery CmdBeginQuery;
        /*    7 */ PFN_vkCmdBeginRenderPass CmdBeginRenderPass;
        /*    8 */ PFN_vkCmdBindDescriptorSets CmdBindDescriptorSets;
        /*    9 */ PFN_vkCmdBindIndexBuffer CmdBindIndexBuffer;
        /*   10 */ PFN_vkCmdBindPipeline CmdBindPipeline;
        /*   11 */ PFN_vkCmdBindVertexBuffers CmdBindVertexBuffers;
        /*   12 */ PFN_vkCmdBlitImage CmdBlitImage;
        /*   13 */ PFN_vkCmdClearAttachments CmdClearAttachments;
        /*   14 */ PFN_vkCmdClearColorImage CmdClearColorImage;
        /*   15 */ PFN_vkCmdClearDepthStencilImage CmdClearDepthStencilImage;
        /*   16 */ PFN_vkCmdCopyBuffer CmdCopyBuffer;
        /*   17 */ PFN_vkCmdCopyBufferToImage CmdCopyBufferToImage;
        /*   18 */ PFN_vkCmdCopyImage CmdCopyImage;
        /*   19 */ PFN_vkCmdCopyImageToBuffer CmdCopyImageToBuffer;
        /*   20 */ PFN_vkCmdCopyQueryPoolResults CmdCopyQueryPoolResults;
        /*   21 */ PFN_vkCmdDispatch CmdDispatch;
        /*   22 */ PFN_vkCmdDispatchIndirect CmdDispatchIndirect;
        /*   23 */ PFN_vkCmdDraw CmdDraw;
        /*   24 */ PFN_vkCmdDrawIndexed CmdDrawIndexed;
        /*   25 */ PFN_vkCmdDrawIndexedIndirect CmdDrawIndexedIndirect;
        /*   26 */ PFN_vkCmdDrawIndirect CmdDrawIndirect;
        /*   27 */ PFN_vkCmdEndQuery CmdEndQuery;
        /*   28 */ PFN_vkCmdEndRenderPass CmdEndRenderPass;
        /*   29 */ PFN_vkCmdExecuteCommands CmdExecuteCommands;
        /*   30 */ PFN_vkCmdFillBuffer CmdFillBuffer;
        /*   31 */ PFN_vkCmdNextSubpass CmdNextSubpass;
        /*   32 */ PFN_vkCmdPipelineBarrier CmdPipelineBarrier;
        /*   33 */ PFN_vkCmdPushConstants CmdPushConstants;
        /*   34 */ PFN_vkCmdResetEvent CmdResetEvent;
        /*   35 */ PFN_vkCmdResetQueryPool CmdResetQueryPool;
        /*   36 */ PFN_vkCmdResolveImage CmdResolveImage;
        /*   37 */ PFN_vkCmdSetBlendConstants CmdSetBlendConstants;
        /*   38 */ PFN_vkCmdSetDepthBias CmdSetDepthBias;
        /*   39 */ PFN_vkCmdSetDepthBounds CmdSetDepthBounds;
        /*   40 */ PFN_vkCmdSetEvent CmdSetEvent;
        /*   41 */ PFN_vkCmdSetLineWidth CmdSetLineWidth;
        /*   42 */ PFN_vkCmdSetScissor CmdSetScissor;
        /*   43 */ PFN_vkCmdSetStencilCompareMask CmdSetStencilCompareMask;
        /*   44 */ PFN_vkCmdSetStencilReference CmdSetStencilReference;
        /*   45 */ PFN_vkCmdSetStencilWriteMask CmdSetStencilWriteMask;
        /*   46 */ PFN_vkCmdSetViewport CmdSetViewport;
        /*   47 */ PFN_vkCmdUpdateBuffer CmdUpdateBuffer;
        /*   48 */ PFN_vkCmdWaitEvents CmdWaitEvents;
        /*   49 */ PFN_vkCmdWriteTimestamp CmdWriteTimestamp;
        /*   50 */ PFN_vkCreateBuffer CreateBuffer;
        /*   51 */ PFN_vkCreateBufferView CreateBufferView;
        /*   52 */ PFN_vkCreateCommandPool CreateCommandPool;
        /*   53 */ PFN_vkCreateComputePipelines CreateComputePipelines;
        /*   54 */ PFN_vkCreateDescriptorPool CreateDescriptorPool;
        /*   55 */ PFN_vkCreateDescriptorSetLayout CreateDescriptorSetLayout;
        /*   56 */ PFN_vkCreateDevice CreateDevice;
        /*   57 */ PFN_vkCreateEvent CreateEvent;
        /*   58 */ PFN_vkCreateFence CreateFence;
        /*   59 */ PFN_vkCreateFramebuffer CreateFramebuffer;
        /*   60 */ PFN_vkCreateGraphicsPipelines CreateGraphicsPipelines;
        /*   61 */ PFN_vkCreateImage CreateImage;
        /*   62 */ PFN_vkCreateImageView CreateImageView;
        /*   63 */ PFN_vkCreateInstance CreateInstance;
        /*   64 */ PFN_vkCreatePipelineCache CreatePipelineCache;
        /*   65 */ PFN_vkCreatePipelineLayout CreatePipelineLayout;
        /*   66 */ PFN_vkCreateQueryPool CreateQueryPool;
        /*   67 */ PFN_vkCreateRenderPass CreateRenderPass;
        /*   68 */ PFN_vkCreateSampler CreateSampler;
        /*   69 */ PFN_vkCreateSemaphore CreateSemaphore;
        /*   70 */ PFN_vkCreateShaderModule CreateShaderModule;
        /*   71 */ PFN_vkDestroyBuffer DestroyBuffer;
        /*   72 */ PFN_vkDestroyBufferView DestroyBufferView;
        /*   73 */ PFN_vkDestroyCommandPool DestroyCommandPool;
        /*   74 */ PFN_vkDestroyDescriptorPool DestroyDescriptorPool;
        /*   75 */ PFN_vkDestroyDescriptorSetLayout DestroyDescriptorSetLayout;
        /*   76 */ PFN_vkDestroyDevice DestroyDevice;
        /*   77 */ PFN_vkDestroyEvent DestroyEvent;
        /*   78 */ PFN_vkDestroyFence DestroyFence;
        /*   79 */ PFN_vkDestroyFramebuffer DestroyFramebuffer;
        /*   80 */ PFN_vkDestroyImage DestroyImage;
        /*   81 */ PFN_vkDestroyImageView DestroyImageView;
        /*   82 */ PFN_vkDestroyInstance DestroyInstance;
        /*   83 */ PFN_vkDestroyPipeline DestroyPipeline;
        /*   84 */ PFN_vkDestroyPipelineCache DestroyPipelineCache;
        /*   85 */ PFN_vkDestroyPipelineLayout DestroyPipelineLayout;
        /*   86 */ PFN_vkDestroyQueryPool DestroyQueryPool;
        /*   87 */ PFN_vkDestroyRenderPass DestroyRenderPass;
        /*   88 */ PFN_vkDestroySampler DestroySampler;
        /*   89 */ PFN_vkDestroySemaphore DestroySemaphore;
        /*   90 */ PFN_vkDestroyShaderModule DestroyShaderModule;
        /*   91 */ PFN_vkDeviceWaitIdle DeviceWaitIdle;
        /*   92 */ PFN_vkEndCommandBuffer EndCommandBuffer;
        /*   93 */ PFN_vkEnumerateDeviceExtensionProperties EnumerateDeviceExtensionProperties;
        /*   94 */ PFN_vkEnumerateDeviceLayerProperties EnumerateDeviceLayerProperties;
        /*   95 */ PFN_vkEnumerateInstanceExtensionProperties EnumerateInstanceExtensionProperties;
        /*   96 */ PFN_vkEnumerateInstanceLayerProperties EnumerateInstanceLayerProperties;
        /*   97 */ PFN_vkEnumeratePhysicalDevices EnumeratePhysicalDevices;
        /*   98 */ PFN_vkFlushMappedMemoryRanges FlushMappedMemoryRanges;
        /*   99 */ PFN_vkFreeCommandBuffers FreeCommandBuffers;
        /*  100 */ PFN_vkFreeDescriptorSets FreeDescriptorSets;
        /*  101 */ PFN_vkFreeMemory FreeMemory;
        /*  102 */ PFN_vkGetBufferMemoryRequirements GetBufferMemoryRequirements;
        /*  103 */ PFN_vkGetDeviceMemoryCommitment GetDeviceMemoryCommitment;
        /*  104 */ PFN_vkGetDeviceProcAddr GetDeviceProcAddr;
        /*  105 */ PFN_vkGetDeviceQueue GetDeviceQueue;
        /*  106 */ PFN_vkGetEventStatus GetEventStatus;
        /*  107 */ PFN_vkGetFenceStatus GetFenceStatus;
        /*  108 */ PFN_vkGetImageMemoryRequirements GetImageMemoryRequirements;
        /*  109 */ PFN_vkGetImageSparseMemoryRequirements GetImageSparseMemoryRequirements;
        /*  110 */ PFN_vkGetImageSubresourceLayout GetImageSubresourceLayout;
        /*  111 */ PFN_vkGetInstanceProcAddr GetInstanceProcAddr;
        /*  112 */ PFN_vkGetPhysicalDeviceFeatures GetPhysicalDeviceFeatures;
        /*  113 */ PFN_vkGetPhysicalDeviceFormatProperties GetPhysicalDeviceFormatProperties;
        /*  114 */ PFN_vkGetPhysicalDeviceImageFormatProperties GetPhysicalDeviceImageFormatProperties;
        /*  115 */ PFN_vkGetPhysicalDeviceMemoryProperties GetPhysicalDeviceMemoryProperties;
        /*  116 */ PFN_vkGetPhysicalDeviceProperties GetPhysicalDeviceProperties;
        /*  117 */ PFN_vkGetPhysicalDeviceQueueFamilyProperties GetPhysicalDeviceQueueFamilyProperties;
        /*  118 */ PFN_vkGetPhysicalDeviceSparseImageFormatProperties GetPhysicalDeviceSparseImageFormatProperties;
        /*  119 */ PFN_vkGetPipelineCacheData GetPipelineCacheData;
        /*  120 */ PFN_vkGetQueryPoolResults GetQueryPoolResults;
        /*  121 */ PFN_vkGetRenderAreaGranularity GetRenderAreaGranularity;
        /*  122 */ PFN_vkInvalidateMappedMemoryRanges InvalidateMappedMemoryRanges;
        /*  123 */ PFN_vkMapMemory MapMemory;
        /*  124 */ PFN_vkMergePipelineCaches MergePipelineCaches;
        /*  125 */ PFN_vkQueueBindSparse QueueBindSparse;
        /*  126 */ PFN_vkQueueSubmit QueueSubmit;
        /*  127 */ PFN_vkQueueWaitIdle QueueWaitIdle;
        /*  128 */ PFN_vkResetCommandBuffer ResetCommandBuffer;
        /*  129 */ PFN_vkResetCommandPool ResetCommandPool;
        /*  130 */ PFN_vkResetDescriptorPool ResetDescriptorPool;
        /*  131 */ PFN_vkResetEvent ResetEvent;
        /*  132 */ PFN_vkResetFences ResetFences;
        /*  133 */ PFN_vkSetEvent SetEvent;
        /*  134 */ PFN_vkUnmapMemory UnmapMemory;
        /*  135 */ PFN_vkUpdateDescriptorSets UpdateDescriptorSets;
        /*  136 */ PFN_vkWaitForFences WaitForFences;
        /*  137 */ PFN_vkBindBufferMemory2 BindBufferMemory2;
        /*  138 */ PFN_vkBindImageMemory2 BindImageMemory2;
        /*  139 */ PFN_vkCmdDispatchBase CmdDispatchBase;
        /*  140 */ PFN_vkCmdSetDeviceMask CmdSetDeviceMask;
        /*  141 */ PFN_vkCreateDescriptorUpdateTemplate CreateDescriptorUpdateTemplate;
        /*  142 */ PFN_vkCreateSamplerYcbcrConversion CreateSamplerYcbcrConversion;
        /*  143 */ PFN_vkDestroyDescriptorUpdateTemplate DestroyDescriptorUpdateTemplate;
        /*  144 */ PFN_vkDestroySamplerYcbcrConversion DestroySamplerYcbcrConversion;
        /*  145 */ PFN_vkEnumerateInstanceVersion EnumerateInstanceVersion;
        /*  146 */ PFN_vkEnumeratePhysicalDeviceGroups EnumeratePhysicalDeviceGroups;
        /*  147 */ PFN_vkGetBufferMemoryRequirements2 GetBufferMemoryRequirements2;
        /*  148 */ PFN_vkGetDescriptorSetLayoutSupport GetDescriptorSetLayoutSupport;
        /*  149 */ PFN_vkGetDeviceGroupPeerMemoryFeatures GetDeviceGroupPeerMemoryFeatures;
        /*  150 */ PFN_vkGetDeviceQueue2 GetDeviceQueue2;
        /*  151 */ PFN_vkGetImageMemoryRequirements2 GetImageMemoryRequirements2;
        /*  152 */ PFN_vkGetImageSparseMemoryRequirements2 GetImageSparseMemoryRequirements2;
        /*  153 */ PFN_vkGetPhysicalDeviceExternalBufferProperties GetPhysicalDeviceExternalBufferProperties;
        /*  154 */ PFN_vkGetPhysicalDeviceExternalFenceProperties GetPhysicalDeviceExternalFenceProperties;
        /*  155 */ PFN_vkGetPhysicalDeviceExternalSemaphoreProperties GetPhysicalDeviceExternalSemaphoreProperties;
        /*  156 */ PFN_vkGetPhysicalDeviceFeatures2 GetPhysicalDeviceFeatures2;
        /*  157 */ PFN_vkGetPhysicalDeviceFormatProperties2 GetPhysicalDeviceFormatProperties2;
        /*  158 */ PFN_vkGetPhysicalDeviceImageFormatProperties2 GetPhysicalDeviceImageFormatProperties2;
        /*  159 */ PFN_vkGetPhysicalDeviceMemoryProperties2 GetPhysicalDeviceMemoryProperties2;
        /*  160 */ PFN_vkGetPhysicalDeviceProperties2 GetPhysicalDeviceProperties2;
        /*  161 */ PFN_vkGetPhysicalDeviceQueueFamilyProperties2 GetPhysicalDeviceQueueFamilyProperties2;
        /*  162 */ PFN_vkGetPhysicalDeviceSparseImageFormatProperties2 GetPhysicalDeviceSparseImageFormatProperties2;
        /*  163 */ PFN_vkTrimCommandPool TrimCommandPool;
        /*  164 */ PFN_vkUpdateDescriptorSetWithTemplate UpdateDescriptorSetWithTemplate;
        /*  165 */ PFN_vkCmdBeginRenderPass2 CmdBeginRenderPass2;
        /*  166 */ PFN_vkCmdDrawIndexedIndirectCount CmdDrawIndexedIndirectCount;
        /*  167 */ PFN_vkCmdDrawIndirectCount CmdDrawIndirectCount;
        /*  168 */ PFN_vkCmdEndRenderPass2 CmdEndRenderPass2;
        /*  169 */ PFN_vkCmdNextSubpass2 CmdNextSubpass2;
        /*  170 */ PFN_vkCreateRenderPass2 CreateRenderPass2;
        /*  171 */ PFN_vkGetBufferDeviceAddress GetBufferDeviceAddress;
        /*  172 */ PFN_vkGetBufferOpaqueCaptureAddress GetBufferOpaqueCaptureAddress;
        /*  173 */ PFN_vkGetDeviceMemoryOpaqueCaptureAddress GetDeviceMemoryOpaqueCaptureAddress;
        /*  174 */ PFN_vkGetSemaphoreCounterValue GetSemaphoreCounterValue;
        /*  175 */ PFN_vkResetQueryPool ResetQueryPool;
        /*  176 */ PFN_vkSignalSemaphore SignalSemaphore;
        /*  177 */ PFN_vkWaitSemaphores WaitSemaphores;
        /*  178 */ PFN_vkCmdBeginRendering CmdBeginRendering;
        /*  179 */ PFN_vkCmdBindVertexBuffers2 CmdBindVertexBuffers2;
        /*  180 */ PFN_vkCmdBlitImage2 CmdBlitImage2;
        /*  181 */ PFN_vkCmdCopyBuffer2 CmdCopyBuffer2;
        /*  182 */ PFN_vkCmdCopyBufferToImage2 CmdCopyBufferToImage2;
        /*  183 */ PFN_vkCmdCopyImage2 CmdCopyImage2;
        /*  184 */ PFN_vkCmdCopyImageToBuffer2 CmdCopyImageToBuffer2;
        /*  185 */ PFN_vkCmdEndRendering CmdEndRendering;
        /*  186 */ PFN_vkCmdPipelineBarrier2 CmdPipelineBarrier2;
        /*  187 */ PFN_vkCmdResetEvent2 CmdResetEvent2;
        /*  188 */ PFN_vkCmdResolveImage2 CmdResolveImage2;
        /*  189 */ PFN_vkCmdSetCullMode CmdSetCullMode;
        /*  190 */ PFN_vkCmdSetDepthBiasEnable CmdSetDepthBiasEnable;
        /*  191 */ PFN_vkCmdSetDepthBoundsTestEnable CmdSetDepthBoundsTestEnable;
        /*  192 */ PFN_vkCmdSetDepthCompareOp CmdSetDepthCompareOp;
        /*  193 */ PFN_vkCmdSetDepthTestEnable CmdSetDepthTestEnable;
        /*  194 */ PFN_vkCmdSetDepthWriteEnable CmdSetDepthWriteEnable;
        /*  195 */ PFN_vkCmdSetEvent2 CmdSetEvent2;
        /*  196 */ PFN_vkCmdSetFrontFace CmdSetFrontFace;
        /*  197 */ PFN_vkCmdSetPrimitiveRestartEnable CmdSetPrimitiveRestartEnable;
        /*  198 */ PFN_vkCmdSetPrimitiveTopology CmdSetPrimitiveTopology;
        /*  199 */ PFN_vkCmdSetRasterizerDiscardEnable CmdSetRasterizerDiscardEnable;
        /*  200 */ PFN_vkCmdSetScissorWithCount CmdSetScissorWithCount;
        /*  201 */ PFN_vkCmdSetStencilOp CmdSetStencilOp;
        /*  202 */ PFN_vkCmdSetStencilTestEnable CmdSetStencilTestEnable;
        /*  203 */ PFN_vkCmdSetViewportWithCount CmdSetViewportWithCount;
        /*  204 */ PFN_vkCmdWaitEvents2 CmdWaitEvents2;
        /*  205 */ PFN_vkCmdWriteTimestamp2 CmdWriteTimestamp2;
        /*  206 */ PFN_vkCreatePrivateDataSlot CreatePrivateDataSlot;
        /*  207 */ PFN_vkDestroyPrivateDataSlot DestroyPrivateDataSlot;
        /*  208 */ PFN_vkGetDeviceBufferMemoryRequirements GetDeviceBufferMemoryRequirements;
        /*  209 */ PFN_vkGetDeviceImageMemoryRequirements GetDeviceImageMemoryRequirements;
        /*  210 */ PFN_vkGetDeviceImageSparseMemoryRequirements GetDeviceImageSparseMemoryRequirements;
        /*  211 */ PFN_vkGetPhysicalDeviceToolProperties GetPhysicalDeviceToolProperties;
        /*  212 */ PFN_vkGetPrivateData GetPrivateData;
        /*  213 */ PFN_vkQueueSubmit2 QueueSubmit2;
        /*  214 */ PFN_vkSetPrivateData SetPrivateData;
        /*  215 */ PFN_vkCmdBindDescriptorSets2 CmdBindDescriptorSets2;
        /*  216 */ PFN_vkCmdBindIndexBuffer2 CmdBindIndexBuffer2;
        /*  217 */ PFN_vkCmdPushConstants2 CmdPushConstants2;
        /*  218 */ PFN_vkCmdPushDescriptorSet CmdPushDescriptorSet;
        /*  219 */ PFN_vkCmdPushDescriptorSet2 CmdPushDescriptorSet2;
        /*  220 */ PFN_vkCmdPushDescriptorSetWithTemplate CmdPushDescriptorSetWithTemplate;
        /*  221 */ PFN_vkCmdPushDescriptorSetWithTemplate2 CmdPushDescriptorSetWithTemplate2;
        /*  222 */ PFN_vkCmdSetLineStipple CmdSetLineStipple;
        /*  223 */ PFN_vkCmdSetRenderingAttachmentLocations CmdSetRenderingAttachmentLocations;
        /*  224 */ PFN_vkCmdSetRenderingInputAttachmentIndices CmdSetRenderingInputAttachmentIndices;
        /*  225 */ PFN_vkCopyImageToImage CopyImageToImage;
        /*  226 */ PFN_vkCopyImageToMemory CopyImageToMemory;
        /*  227 */ PFN_vkCopyMemoryToImage CopyMemoryToImage;
        /*  228 */ PFN_vkGetDeviceImageSubresourceLayout GetDeviceImageSubresourceLayout;
        /*  229 */ PFN_vkGetImageSubresourceLayout2 GetImageSubresourceLayout2;
        /*  230 */ PFN_vkGetRenderingAreaGranularity GetRenderingAreaGranularity;
        /*  231 */ PFN_vkMapMemory2 MapMemory2;
        /*  232 */ PFN_vkTransitionImageLayout TransitionImageLayout;
        /*  233 */ PFN_vkUnmapMemory2 UnmapMemory2;
        /*  234 */ PFN_vkDestroySurfaceKHR DestroySurfaceKHR;
        /*  235 */ PFN_vkGetPhysicalDeviceSurfaceCapabilitiesKHR GetPhysicalDeviceSurfaceCapabilitiesKHR;
        /*  236 */ PFN_vkGetPhysicalDeviceSurfaceFormatsKHR GetPhysicalDeviceSurfaceFormatsKHR;
        /*  237 */ PFN_vkGetPhysicalDeviceSurfacePresentModesKHR GetPhysicalDeviceSurfacePresentModesKHR;
        /*  238 */ PFN_vkGetPhysicalDeviceSurfaceSupportKHR GetPhysicalDeviceSurfaceSupportKHR;
        /*  239 */ PFN_vkAcquireNextImageKHR AcquireNextImageKHR;
        /*  240 */ PFN_vkCreateSwapchainKHR CreateSwapchainKHR;
        /*  241 */ PFN_vkDestroySwapchainKHR DestroySwapchainKHR;
        /*  242 */ PFN_vkGetSwapchainImagesKHR GetSwapchainImagesKHR;
        /*  243 */ PFN_vkQueuePresentKHR QueuePresentKHR;
        /*  244 */ PFN_vkAcquireNextImage2KHR AcquireNextImage2KHR;
        /*  245 */ PFN_vkGetDeviceGroupPresentCapabilitiesKHR GetDeviceGroupPresentCapabilitiesKHR;
        /*  246 */ PFN_vkGetDeviceGroupSurfacePresentModesKHR GetDeviceGroupSurfacePresentModesKHR;
        /*  247 */ PFN_vkGetPhysicalDevicePresentRectanglesKHR GetPhysicalDevicePresentRectanglesKHR;
        /*  248 */ PFN_vkCreateDisplayModeKHR CreateDisplayModeKHR;
        /*  249 */ PFN_vkCreateDisplayPlaneSurfaceKHR CreateDisplayPlaneSurfaceKHR;
        /*  250 */ PFN_vkGetDisplayModePropertiesKHR GetDisplayModePropertiesKHR;
        /*  251 */ PFN_vkGetDisplayPlaneCapabilitiesKHR GetDisplayPlaneCapabilitiesKHR;
        /*  252 */ PFN_vkGetDisplayPlaneSupportedDisplaysKHR GetDisplayPlaneSupportedDisplaysKHR;
        /*  253 */ PFN_vkGetPhysicalDeviceDisplayPlanePropertiesKHR GetPhysicalDeviceDisplayPlanePropertiesKHR;
        /*  254 */ PFN_vkGetPhysicalDeviceDisplayPropertiesKHR GetPhysicalDeviceDisplayPropertiesKHR;
        /*  255 */ PFN_vkCreateSharedSwapchainsKHR CreateSharedSwapchainsKHR;
#if defined(VK_USE_PLATFORM_XLIB_KHR)
        /*  256 */ PFN_vkCreateXlibSurfaceKHR CreateXlibSurfaceKHR;
        /*  257 */ PFN_vkGetPhysicalDeviceXlibPresentationSupportKHR GetPhysicalDeviceXlibPresentationSupportKHR;
#else
        /*  256 */ void *_pad256;
        /*  257 */ void *_pad257;
#endif
#if defined(VK_USE_PLATFORM_XCB_KHR)
        /*  258 */ PFN_vkCreateXcbSurfaceKHR CreateXcbSurfaceKHR;
        /*  259 */ PFN_vkGetPhysicalDeviceXcbPresentationSupportKHR GetPhysicalDeviceXcbPresentationSupportKHR;
#else
        /*  258 */ void *_pad258;
        /*  259 */ void *_pad259;
#endif
#if defined(VK_USE_PLATFORM_WAYLAND_KHR)
        /*  260 */ PFN_vkCreateWaylandSurfaceKHR CreateWaylandSurfaceKHR;
        /*  261 */ PFN_vkGetPhysicalDeviceWaylandPresentationSupportKHR GetPhysicalDeviceWaylandPresentationSupportKHR;
#else
        /*  260 */ void *_pad260;
        /*  261 */ void *_pad261;
#endif
#if defined(VK_USE_PLATFORM_ANDROID_KHR)
        /*  262 */ PFN_vkCreateAndroidSurfaceKHR CreateAndroidSurfaceKHR;
#else
        /*  262 */ void *_pad262;
#endif
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  263 */ PFN_vkCreateWin32SurfaceKHR CreateWin32SurfaceKHR;
        /*  264 */ PFN_vkGetPhysicalDeviceWin32PresentationSupportKHR GetPhysicalDeviceWin32PresentationSupportKHR;
#else
        /*  263 */ void *_pad263;
        /*  264 */ void *_pad264;
#endif
        /*  265 */ PFN_vkCreateDebugReportCallbackEXT CreateDebugReportCallbackEXT;
        /*  266 */ PFN_vkDebugReportMessageEXT DebugReportMessageEXT;
        /*  267 */ PFN_vkDestroyDebugReportCallbackEXT DestroyDebugReportCallbackEXT;
        /*  268 */ PFN_vkCmdDebugMarkerBeginEXT CmdDebugMarkerBeginEXT;
        /*  269 */ PFN_vkCmdDebugMarkerEndEXT CmdDebugMarkerEndEXT;
        /*  270 */ PFN_vkCmdDebugMarkerInsertEXT CmdDebugMarkerInsertEXT;
        /*  271 */ PFN_vkDebugMarkerSetObjectNameEXT DebugMarkerSetObjectNameEXT;
        /*  272 */ PFN_vkDebugMarkerSetObjectTagEXT DebugMarkerSetObjectTagEXT;
        /*  273 */ PFN_vkBindVideoSessionMemoryKHR BindVideoSessionMemoryKHR;
        /*  274 */ PFN_vkCmdBeginVideoCodingKHR CmdBeginVideoCodingKHR;
        /*  275 */ PFN_vkCmdControlVideoCodingKHR CmdControlVideoCodingKHR;
        /*  276 */ PFN_vkCmdEndVideoCodingKHR CmdEndVideoCodingKHR;
        /*  277 */ PFN_vkCreateVideoSessionKHR CreateVideoSessionKHR;
        /*  278 */ PFN_vkCreateVideoSessionParametersKHR CreateVideoSessionParametersKHR;
        /*  279 */ PFN_vkDestroyVideoSessionKHR DestroyVideoSessionKHR;
        /*  280 */ PFN_vkDestroyVideoSessionParametersKHR DestroyVideoSessionParametersKHR;
        /*  281 */ PFN_vkGetPhysicalDeviceVideoCapabilitiesKHR GetPhysicalDeviceVideoCapabilitiesKHR;
        /*  282 */ PFN_vkGetPhysicalDeviceVideoFormatPropertiesKHR GetPhysicalDeviceVideoFormatPropertiesKHR;
        /*  283 */ PFN_vkGetVideoSessionMemoryRequirementsKHR GetVideoSessionMemoryRequirementsKHR;
        /*  284 */ PFN_vkUpdateVideoSessionParametersKHR UpdateVideoSessionParametersKHR;
        /*  285 */ PFN_vkCmdDecodeVideoKHR CmdDecodeVideoKHR;
        /*  286 */ PFN_vkCmdBeginQueryIndexedEXT CmdBeginQueryIndexedEXT;
        /*  287 */ PFN_vkCmdBeginTransformFeedbackEXT CmdBeginTransformFeedbackEXT;
        /*  288 */ PFN_vkCmdBindTransformFeedbackBuffersEXT CmdBindTransformFeedbackBuffersEXT;
        /*  289 */ PFN_vkCmdDrawIndirectByteCountEXT CmdDrawIndirectByteCountEXT;
        /*  290 */ PFN_vkCmdEndQueryIndexedEXT CmdEndQueryIndexedEXT;
        /*  291 */ PFN_vkCmdEndTransformFeedbackEXT CmdEndTransformFeedbackEXT;
        /*  292 */ PFN_vkCmdCuLaunchKernelNVX CmdCuLaunchKernelNVX;
        /*  293 */ PFN_vkCreateCuFunctionNVX CreateCuFunctionNVX;
        /*  294 */ PFN_vkCreateCuModuleNVX CreateCuModuleNVX;
        /*  295 */ PFN_vkDestroyCuFunctionNVX DestroyCuFunctionNVX;
        /*  296 */ PFN_vkDestroyCuModuleNVX DestroyCuModuleNVX;
        /*  297 */ PFN_vkGetDeviceCombinedImageSamplerIndexNVX GetDeviceCombinedImageSamplerIndexNVX;
        /*  298 */ PFN_vkGetImageViewAddressNVX GetImageViewAddressNVX;
        /*  299 */ PFN_vkGetImageViewHandle64NVX GetImageViewHandle64NVX;
        /*  300 */ PFN_vkGetImageViewHandleNVX GetImageViewHandleNVX;
        /*  301 */ PFN_vkCmdDrawIndexedIndirectCountAMD CmdDrawIndexedIndirectCountAMD;
        /*  302 */ PFN_vkCmdDrawIndirectCountAMD CmdDrawIndirectCountAMD;
        /*  303 */ PFN_vkGetShaderInfoAMD GetShaderInfoAMD;
        /*  304 */ PFN_vkCmdBeginRenderingKHR CmdBeginRenderingKHR;
        /*  305 */ PFN_vkCmdEndRenderingKHR CmdEndRenderingKHR;
#if defined(VK_USE_PLATFORM_GGP)
        /*  306 */ PFN_vkCreateStreamDescriptorSurfaceGGP CreateStreamDescriptorSurfaceGGP;
#else
        /*  306 */ void *_pad306;
#endif
        /*  307 */ PFN_vkGetPhysicalDeviceExternalImageFormatPropertiesNV GetPhysicalDeviceExternalImageFormatPropertiesNV;
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  308 */ PFN_vkGetMemoryWin32HandleNV GetMemoryWin32HandleNV;
#else
        /*  308 */ void *_pad308;
#endif
        /*  309 */ PFN_vkGetPhysicalDeviceFeatures2KHR GetPhysicalDeviceFeatures2KHR;
        /*  310 */ PFN_vkGetPhysicalDeviceFormatProperties2KHR GetPhysicalDeviceFormatProperties2KHR;
        /*  311 */ PFN_vkGetPhysicalDeviceImageFormatProperties2KHR GetPhysicalDeviceImageFormatProperties2KHR;
        /*  312 */ PFN_vkGetPhysicalDeviceMemoryProperties2KHR GetPhysicalDeviceMemoryProperties2KHR;
        /*  313 */ PFN_vkGetPhysicalDeviceProperties2KHR GetPhysicalDeviceProperties2KHR;
        /*  314 */ PFN_vkGetPhysicalDeviceQueueFamilyProperties2KHR GetPhysicalDeviceQueueFamilyProperties2KHR;
        /*  315 */ PFN_vkGetPhysicalDeviceSparseImageFormatProperties2KHR GetPhysicalDeviceSparseImageFormatProperties2KHR;
        /*  316 */ PFN_vkCmdDispatchBaseKHR CmdDispatchBaseKHR;
        /*  317 */ PFN_vkCmdSetDeviceMaskKHR CmdSetDeviceMaskKHR;
        /*  318 */ PFN_vkGetDeviceGroupPeerMemoryFeaturesKHR GetDeviceGroupPeerMemoryFeaturesKHR;
#if defined(VK_USE_PLATFORM_VI_NN)
        /*  319 */ PFN_vkCreateViSurfaceNN CreateViSurfaceNN;
#else
        /*  319 */ void *_pad319;
#endif
        /*  320 */ PFN_vkTrimCommandPoolKHR TrimCommandPoolKHR;
        /*  321 */ PFN_vkEnumeratePhysicalDeviceGroupsKHR EnumeratePhysicalDeviceGroupsKHR;
        /*  322 */ PFN_vkGetPhysicalDeviceExternalBufferPropertiesKHR GetPhysicalDeviceExternalBufferPropertiesKHR;
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  323 */ PFN_vkGetMemoryWin32HandleKHR GetMemoryWin32HandleKHR;
        /*  324 */ PFN_vkGetMemoryWin32HandlePropertiesKHR GetMemoryWin32HandlePropertiesKHR;
#else
        /*  323 */ void *_pad323;
        /*  324 */ void *_pad324;
#endif
        /*  325 */ PFN_vkGetMemoryFdKHR GetMemoryFdKHR;
        /*  326 */ PFN_vkGetMemoryFdPropertiesKHR GetMemoryFdPropertiesKHR;
        /*  327 */ PFN_vkGetPhysicalDeviceExternalSemaphorePropertiesKHR GetPhysicalDeviceExternalSemaphorePropertiesKHR;
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  328 */ PFN_vkGetSemaphoreWin32HandleKHR GetSemaphoreWin32HandleKHR;
        /*  329 */ PFN_vkImportSemaphoreWin32HandleKHR ImportSemaphoreWin32HandleKHR;
#else
        /*  328 */ void *_pad328;
        /*  329 */ void *_pad329;
#endif
        /*  330 */ PFN_vkGetSemaphoreFdKHR GetSemaphoreFdKHR;
        /*  331 */ PFN_vkImportSemaphoreFdKHR ImportSemaphoreFdKHR;
        /*  332 */ PFN_vkCmdPushDescriptorSetKHR CmdPushDescriptorSetKHR;
        /*  333 */ PFN_vkCmdPushDescriptorSetWithTemplateKHR CmdPushDescriptorSetWithTemplateKHR;
        /*  334 */ PFN_vkCmdBeginConditionalRenderingEXT CmdBeginConditionalRenderingEXT;
        /*  335 */ PFN_vkCmdEndConditionalRenderingEXT CmdEndConditionalRenderingEXT;
        /*  336 */ PFN_vkCreateDescriptorUpdateTemplateKHR CreateDescriptorUpdateTemplateKHR;
        /*  337 */ PFN_vkDestroyDescriptorUpdateTemplateKHR DestroyDescriptorUpdateTemplateKHR;
        /*  338 */ PFN_vkUpdateDescriptorSetWithTemplateKHR UpdateDescriptorSetWithTemplateKHR;
        /*  339 */ PFN_vkCmdSetViewportWScalingNV CmdSetViewportWScalingNV;
        /*  340 */ PFN_vkReleaseDisplayEXT ReleaseDisplayEXT;
#if defined(VK_USE_PLATFORM_XLIB_XRANDR_EXT)
        /*  341 */ PFN_vkAcquireXlibDisplayEXT AcquireXlibDisplayEXT;
        /*  342 */ PFN_vkGetRandROutputDisplayEXT GetRandROutputDisplayEXT;
#else
        /*  341 */ void *_pad341;
        /*  342 */ void *_pad342;
#endif
        /*  343 */ PFN_vkGetPhysicalDeviceSurfaceCapabilities2EXT GetPhysicalDeviceSurfaceCapabilities2EXT;
        /*  344 */ PFN_vkDisplayPowerControlEXT DisplayPowerControlEXT;
        /*  345 */ PFN_vkGetSwapchainCounterEXT GetSwapchainCounterEXT;
        /*  346 */ PFN_vkRegisterDeviceEventEXT RegisterDeviceEventEXT;
        /*  347 */ PFN_vkRegisterDisplayEventEXT RegisterDisplayEventEXT;
        /*  348 */ PFN_vkGetPastPresentationTimingGOOGLE GetPastPresentationTimingGOOGLE;
        /*  349 */ PFN_vkGetRefreshCycleDurationGOOGLE GetRefreshCycleDurationGOOGLE;
        /*  350 */ PFN_vkCmdSetDiscardRectangleEXT CmdSetDiscardRectangleEXT;
        /*  351 */ PFN_vkCmdSetDiscardRectangleEnableEXT CmdSetDiscardRectangleEnableEXT;
        /*  352 */ PFN_vkCmdSetDiscardRectangleModeEXT CmdSetDiscardRectangleModeEXT;
        /*  353 */ PFN_vkSetHdrMetadataEXT SetHdrMetadataEXT;
        /*  354 */ PFN_vkCmdBeginRenderPass2KHR CmdBeginRenderPass2KHR;
        /*  355 */ PFN_vkCmdEndRenderPass2KHR CmdEndRenderPass2KHR;
        /*  356 */ PFN_vkCmdNextSubpass2KHR CmdNextSubpass2KHR;
        /*  357 */ PFN_vkCreateRenderPass2KHR CreateRenderPass2KHR;
        /*  358 */ PFN_vkGetSwapchainStatusKHR GetSwapchainStatusKHR;
        /*  359 */ PFN_vkGetPhysicalDeviceExternalFencePropertiesKHR GetPhysicalDeviceExternalFencePropertiesKHR;
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  360 */ PFN_vkGetFenceWin32HandleKHR GetFenceWin32HandleKHR;
        /*  361 */ PFN_vkImportFenceWin32HandleKHR ImportFenceWin32HandleKHR;
#else
        /*  360 */ void *_pad360;
        /*  361 */ void *_pad361;
#endif
        /*  362 */ PFN_vkGetFenceFdKHR GetFenceFdKHR;
        /*  363 */ PFN_vkImportFenceFdKHR ImportFenceFdKHR;
        /*  364 */ PFN_vkAcquireProfilingLockKHR AcquireProfilingLockKHR;
        /*  365 */ PFN_vkEnumeratePhysicalDeviceQueueFamilyPerformanceQueryCountersKHR EnumeratePhysicalDeviceQueueFamilyPerformanceQueryCountersKHR;
        /*  366 */ PFN_vkGetPhysicalDeviceQueueFamilyPerformanceQueryPassesKHR GetPhysicalDeviceQueueFamilyPerformanceQueryPassesKHR;
        /*  367 */ PFN_vkReleaseProfilingLockKHR ReleaseProfilingLockKHR;
        /*  368 */ PFN_vkGetPhysicalDeviceSurfaceCapabilities2KHR GetPhysicalDeviceSurfaceCapabilities2KHR;
        /*  369 */ PFN_vkGetPhysicalDeviceSurfaceFormats2KHR GetPhysicalDeviceSurfaceFormats2KHR;
        /*  370 */ PFN_vkGetDisplayModeProperties2KHR GetDisplayModeProperties2KHR;
        /*  371 */ PFN_vkGetDisplayPlaneCapabilities2KHR GetDisplayPlaneCapabilities2KHR;
        /*  372 */ PFN_vkGetPhysicalDeviceDisplayPlaneProperties2KHR GetPhysicalDeviceDisplayPlaneProperties2KHR;
        /*  373 */ PFN_vkGetPhysicalDeviceDisplayProperties2KHR GetPhysicalDeviceDisplayProperties2KHR;
#if defined(VK_USE_PLATFORM_IOS_MVK)
        /*  374 */ PFN_vkCreateIOSSurfaceMVK CreateIOSSurfaceMVK;
#else
        /*  374 */ void *_pad374;
#endif
#if defined(VK_USE_PLATFORM_MACOS_MVK)
        /*  375 */ PFN_vkCreateMacOSSurfaceMVK CreateMacOSSurfaceMVK;
#else
        /*  375 */ void *_pad375;
#endif
        /*  376 */ PFN_vkCmdBeginDebugUtilsLabelEXT CmdBeginDebugUtilsLabelEXT;
        /*  377 */ PFN_vkCmdEndDebugUtilsLabelEXT CmdEndDebugUtilsLabelEXT;
        /*  378 */ PFN_vkCmdInsertDebugUtilsLabelEXT CmdInsertDebugUtilsLabelEXT;
        /*  379 */ PFN_vkCreateDebugUtilsMessengerEXT CreateDebugUtilsMessengerEXT;
        /*  380 */ PFN_vkDestroyDebugUtilsMessengerEXT DestroyDebugUtilsMessengerEXT;
        /*  381 */ PFN_vkQueueBeginDebugUtilsLabelEXT QueueBeginDebugUtilsLabelEXT;
        /*  382 */ PFN_vkQueueEndDebugUtilsLabelEXT QueueEndDebugUtilsLabelEXT;
        /*  383 */ PFN_vkQueueInsertDebugUtilsLabelEXT QueueInsertDebugUtilsLabelEXT;
        /*  384 */ PFN_vkSetDebugUtilsObjectNameEXT SetDebugUtilsObjectNameEXT;
        /*  385 */ PFN_vkSetDebugUtilsObjectTagEXT SetDebugUtilsObjectTagEXT;
        /*  386 */ PFN_vkSubmitDebugUtilsMessageEXT SubmitDebugUtilsMessageEXT;
#if defined(VK_USE_PLATFORM_ANDROID_KHR)
        /*  387 */ PFN_vkGetAndroidHardwareBufferPropertiesANDROID GetAndroidHardwareBufferPropertiesANDROID;
        /*  388 */ PFN_vkGetMemoryAndroidHardwareBufferANDROID GetMemoryAndroidHardwareBufferANDROID;
#else
        /*  387 */ void *_pad387;
        /*  388 */ void *_pad388;
#endif
#if defined(VK_ENABLE_BETA_EXTENSIONS)
        /*  389 */ PFN_vkCmdDispatchGraphAMDX CmdDispatchGraphAMDX;
        /*  390 */ PFN_vkCmdDispatchGraphIndirectAMDX CmdDispatchGraphIndirectAMDX;
        /*  391 */ PFN_vkCmdDispatchGraphIndirectCountAMDX CmdDispatchGraphIndirectCountAMDX;
        /*  392 */ PFN_vkCmdInitializeGraphScratchMemoryAMDX CmdInitializeGraphScratchMemoryAMDX;
        /*  393 */ PFN_vkCreateExecutionGraphPipelinesAMDX CreateExecutionGraphPipelinesAMDX;
        /*  394 */ PFN_vkGetExecutionGraphPipelineNodeIndexAMDX GetExecutionGraphPipelineNodeIndexAMDX;
        /*  395 */ PFN_vkGetExecutionGraphPipelineScratchSizeAMDX GetExecutionGraphPipelineScratchSizeAMDX;
#else
        /*  389 */ void *_pad389;
        /*  390 */ void *_pad390;
        /*  391 */ void *_pad391;
        /*  392 */ void *_pad392;
        /*  393 */ void *_pad393;
        /*  394 */ void *_pad394;
        /*  395 */ void *_pad395;
#endif
        /*  396 */ PFN_vkCmdBindResourceHeapEXT CmdBindResourceHeapEXT;
        /*  397 */ PFN_vkCmdBindSamplerHeapEXT CmdBindSamplerHeapEXT;
        /*  398 */ PFN_vkCmdPushDataEXT CmdPushDataEXT;
        /*  399 */ PFN_vkGetImageOpaqueCaptureDataEXT GetImageOpaqueCaptureDataEXT;
        /*  400 */ PFN_vkGetPhysicalDeviceDescriptorSizeEXT GetPhysicalDeviceDescriptorSizeEXT;
        /*  401 */ PFN_vkGetTensorOpaqueCaptureDataARM GetTensorOpaqueCaptureDataARM;
        /*  402 */ PFN_vkRegisterCustomBorderColorEXT RegisterCustomBorderColorEXT;
        /*  403 */ PFN_vkUnregisterCustomBorderColorEXT UnregisterCustomBorderColorEXT;
        /*  404 */ PFN_vkWriteResourceDescriptorsEXT WriteResourceDescriptorsEXT;
        /*  405 */ PFN_vkWriteSamplerDescriptorsEXT WriteSamplerDescriptorsEXT;
        /*  406 */ PFN_vkCmdSetSampleLocationsEXT CmdSetSampleLocationsEXT;
        /*  407 */ PFN_vkGetPhysicalDeviceMultisamplePropertiesEXT GetPhysicalDeviceMultisamplePropertiesEXT;
        /*  408 */ PFN_vkGetBufferMemoryRequirements2KHR GetBufferMemoryRequirements2KHR;
        /*  409 */ PFN_vkGetImageMemoryRequirements2KHR GetImageMemoryRequirements2KHR;
        /*  410 */ PFN_vkGetImageSparseMemoryRequirements2KHR GetImageSparseMemoryRequirements2KHR;
        /*  411 */ PFN_vkBuildAccelerationStructuresKHR BuildAccelerationStructuresKHR;
        /*  412 */ PFN_vkCmdBuildAccelerationStructuresIndirectKHR CmdBuildAccelerationStructuresIndirectKHR;
        /*  413 */ PFN_vkCmdBuildAccelerationStructuresKHR CmdBuildAccelerationStructuresKHR;
        /*  414 */ PFN_vkCmdCopyAccelerationStructureKHR CmdCopyAccelerationStructureKHR;
        /*  415 */ PFN_vkCmdCopyAccelerationStructureToMemoryKHR CmdCopyAccelerationStructureToMemoryKHR;
        /*  416 */ PFN_vkCmdCopyMemoryToAccelerationStructureKHR CmdCopyMemoryToAccelerationStructureKHR;
        /*  417 */ PFN_vkCmdWriteAccelerationStructuresPropertiesKHR CmdWriteAccelerationStructuresPropertiesKHR;
        /*  418 */ PFN_vkCopyAccelerationStructureKHR CopyAccelerationStructureKHR;
        /*  419 */ PFN_vkCopyAccelerationStructureToMemoryKHR CopyAccelerationStructureToMemoryKHR;
        /*  420 */ PFN_vkCopyMemoryToAccelerationStructureKHR CopyMemoryToAccelerationStructureKHR;
        /*  421 */ PFN_vkCreateAccelerationStructureKHR CreateAccelerationStructureKHR;
        /*  422 */ PFN_vkDestroyAccelerationStructureKHR DestroyAccelerationStructureKHR;
        /*  423 */ PFN_vkGetAccelerationStructureBuildSizesKHR GetAccelerationStructureBuildSizesKHR;
        /*  424 */ PFN_vkGetAccelerationStructureDeviceAddressKHR GetAccelerationStructureDeviceAddressKHR;
        /*  425 */ PFN_vkGetDeviceAccelerationStructureCompatibilityKHR GetDeviceAccelerationStructureCompatibilityKHR;
        /*  426 */ PFN_vkWriteAccelerationStructuresPropertiesKHR WriteAccelerationStructuresPropertiesKHR;
        /*  427 */ PFN_vkCmdSetRayTracingPipelineStackSizeKHR CmdSetRayTracingPipelineStackSizeKHR;
        /*  428 */ PFN_vkCmdTraceRaysIndirectKHR CmdTraceRaysIndirectKHR;
        /*  429 */ PFN_vkCmdTraceRaysKHR CmdTraceRaysKHR;
        /*  430 */ PFN_vkCreateRayTracingPipelinesKHR CreateRayTracingPipelinesKHR;
        /*  431 */ PFN_vkGetRayTracingCaptureReplayShaderGroupHandlesKHR GetRayTracingCaptureReplayShaderGroupHandlesKHR;
        /*  432 */ PFN_vkGetRayTracingShaderGroupHandlesKHR GetRayTracingShaderGroupHandlesKHR;
        /*  433 */ PFN_vkGetRayTracingShaderGroupStackSizeKHR GetRayTracingShaderGroupStackSizeKHR;
        /*  434 */ PFN_vkCreateSamplerYcbcrConversionKHR CreateSamplerYcbcrConversionKHR;
        /*  435 */ PFN_vkDestroySamplerYcbcrConversionKHR DestroySamplerYcbcrConversionKHR;
        /*  436 */ PFN_vkBindBufferMemory2KHR BindBufferMemory2KHR;
        /*  437 */ PFN_vkBindImageMemory2KHR BindImageMemory2KHR;
        /*  438 */ PFN_vkGetImageDrmFormatModifierPropertiesEXT GetImageDrmFormatModifierPropertiesEXT;
        /*  439 */ PFN_vkCreateValidationCacheEXT CreateValidationCacheEXT;
        /*  440 */ PFN_vkDestroyValidationCacheEXT DestroyValidationCacheEXT;
        /*  441 */ PFN_vkGetValidationCacheDataEXT GetValidationCacheDataEXT;
        /*  442 */ PFN_vkMergeValidationCachesEXT MergeValidationCachesEXT;
        /*  443 */ PFN_vkCmdBindShadingRateImageNV CmdBindShadingRateImageNV;
        /*  444 */ PFN_vkCmdSetCoarseSampleOrderNV CmdSetCoarseSampleOrderNV;
        /*  445 */ PFN_vkCmdSetViewportShadingRatePaletteNV CmdSetViewportShadingRatePaletteNV;
        /*  446 */ PFN_vkBindAccelerationStructureMemoryNV BindAccelerationStructureMemoryNV;
        /*  447 */ PFN_vkCmdBuildAccelerationStructureNV CmdBuildAccelerationStructureNV;
        /*  448 */ PFN_vkCmdCopyAccelerationStructureNV CmdCopyAccelerationStructureNV;
        /*  449 */ PFN_vkCmdTraceRaysNV CmdTraceRaysNV;
        /*  450 */ PFN_vkCmdWriteAccelerationStructuresPropertiesNV CmdWriteAccelerationStructuresPropertiesNV;
        /*  451 */ PFN_vkCompileDeferredNV CompileDeferredNV;
        /*  452 */ PFN_vkCreateAccelerationStructureNV CreateAccelerationStructureNV;
        /*  453 */ PFN_vkCreateRayTracingPipelinesNV CreateRayTracingPipelinesNV;
        /*  454 */ PFN_vkDestroyAccelerationStructureNV DestroyAccelerationStructureNV;
        /*  455 */ PFN_vkGetAccelerationStructureHandleNV GetAccelerationStructureHandleNV;
        /*  456 */ PFN_vkGetAccelerationStructureMemoryRequirementsNV GetAccelerationStructureMemoryRequirementsNV;
        /*  457 */ PFN_vkGetRayTracingShaderGroupHandlesNV GetRayTracingShaderGroupHandlesNV;
        /*  458 */ PFN_vkGetDescriptorSetLayoutSupportKHR GetDescriptorSetLayoutSupportKHR;
        /*  459 */ PFN_vkCmdDrawIndexedIndirectCountKHR CmdDrawIndexedIndirectCountKHR;
        /*  460 */ PFN_vkCmdDrawIndirectCountKHR CmdDrawIndirectCountKHR;
        /*  461 */ PFN_vkGetMemoryHostPointerPropertiesEXT GetMemoryHostPointerPropertiesEXT;
        /*  462 */ PFN_vkCmdWriteBufferMarker2AMD CmdWriteBufferMarker2AMD;
        /*  463 */ PFN_vkCmdWriteBufferMarkerAMD CmdWriteBufferMarkerAMD;
        /*  464 */ PFN_vkGetCalibratedTimestampsEXT GetCalibratedTimestampsEXT;
        /*  465 */ PFN_vkGetPhysicalDeviceCalibrateableTimeDomainsEXT GetPhysicalDeviceCalibrateableTimeDomainsEXT;
        /*  466 */ PFN_vkCmdDrawMeshTasksIndirectCountNV CmdDrawMeshTasksIndirectCountNV;
        /*  467 */ PFN_vkCmdDrawMeshTasksIndirectNV CmdDrawMeshTasksIndirectNV;
        /*  468 */ PFN_vkCmdDrawMeshTasksNV CmdDrawMeshTasksNV;
        /*  469 */ PFN_vkCmdSetExclusiveScissorEnableNV CmdSetExclusiveScissorEnableNV;
        /*  470 */ PFN_vkCmdSetExclusiveScissorNV CmdSetExclusiveScissorNV;
        /*  471 */ PFN_vkCmdSetCheckpointNV CmdSetCheckpointNV;
        /*  472 */ PFN_vkGetQueueCheckpointData2NV GetQueueCheckpointData2NV;
        /*  473 */ PFN_vkGetQueueCheckpointDataNV GetQueueCheckpointDataNV;
        /*  474 */ PFN_vkGetSemaphoreCounterValueKHR GetSemaphoreCounterValueKHR;
        /*  475 */ PFN_vkSignalSemaphoreKHR SignalSemaphoreKHR;
        /*  476 */ PFN_vkWaitSemaphoresKHR WaitSemaphoresKHR;
        /*  477 */ PFN_vkGetPastPresentationTimingEXT GetPastPresentationTimingEXT;
        /*  478 */ PFN_vkGetSwapchainTimeDomainPropertiesEXT GetSwapchainTimeDomainPropertiesEXT;
        /*  479 */ PFN_vkGetSwapchainTimingPropertiesEXT GetSwapchainTimingPropertiesEXT;
        /*  480 */ PFN_vkSetSwapchainPresentTimingQueueSizeEXT SetSwapchainPresentTimingQueueSizeEXT;
        /*  481 */ PFN_vkAcquirePerformanceConfigurationINTEL AcquirePerformanceConfigurationINTEL;
        /*  482 */ PFN_vkCmdSetPerformanceMarkerINTEL CmdSetPerformanceMarkerINTEL;
        /*  483 */ PFN_vkCmdSetPerformanceOverrideINTEL CmdSetPerformanceOverrideINTEL;
        /*  484 */ PFN_vkCmdSetPerformanceStreamMarkerINTEL CmdSetPerformanceStreamMarkerINTEL;
        /*  485 */ PFN_vkGetPerformanceParameterINTEL GetPerformanceParameterINTEL;
        /*  486 */ PFN_vkInitializePerformanceApiINTEL InitializePerformanceApiINTEL;
        /*  487 */ PFN_vkQueueSetPerformanceConfigurationINTEL QueueSetPerformanceConfigurationINTEL;
        /*  488 */ PFN_vkReleasePerformanceConfigurationINTEL ReleasePerformanceConfigurationINTEL;
        /*  489 */ PFN_vkUninitializePerformanceApiINTEL UninitializePerformanceApiINTEL;
        /*  490 */ PFN_vkSetLocalDimmingAMD SetLocalDimmingAMD;
#if defined(VK_USE_PLATFORM_FUCHSIA)
        /*  491 */ PFN_vkCreateImagePipeSurfaceFUCHSIA CreateImagePipeSurfaceFUCHSIA;
#else
        /*  491 */ void *_pad491;
#endif
#if defined(VK_USE_PLATFORM_METAL_EXT)
        /*  492 */ PFN_vkCreateMetalSurfaceEXT CreateMetalSurfaceEXT;
#else
        /*  492 */ void *_pad492;
#endif
        /*  493 */ PFN_vkCmdSetFragmentShadingRateKHR CmdSetFragmentShadingRateKHR;
        /*  494 */ PFN_vkGetPhysicalDeviceFragmentShadingRatesKHR GetPhysicalDeviceFragmentShadingRatesKHR;
        /*  495 */ PFN_vkCmdSetRenderingAttachmentLocationsKHR CmdSetRenderingAttachmentLocationsKHR;
        /*  496 */ PFN_vkCmdSetRenderingInputAttachmentIndicesKHR CmdSetRenderingInputAttachmentIndicesKHR;
        /*  497 */ PFN_vkGetBufferDeviceAddressEXT GetBufferDeviceAddressEXT;
        /*  498 */ PFN_vkGetPhysicalDeviceToolPropertiesEXT GetPhysicalDeviceToolPropertiesEXT;
        /*  499 */ PFN_vkWaitForPresentKHR WaitForPresentKHR;
        /*  500 */ PFN_vkGetPhysicalDeviceCooperativeMatrixPropertiesNV GetPhysicalDeviceCooperativeMatrixPropertiesNV;
        /*  501 */ PFN_vkGetPhysicalDeviceSupportedFramebufferMixedSamplesCombinationsNV GetPhysicalDeviceSupportedFramebufferMixedSamplesCombinationsNV;
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  502 */ PFN_vkAcquireFullScreenExclusiveModeEXT AcquireFullScreenExclusiveModeEXT;
        /*  503 */ PFN_vkGetDeviceGroupSurfacePresentModes2EXT GetDeviceGroupSurfacePresentModes2EXT;
        /*  504 */ PFN_vkGetPhysicalDeviceSurfacePresentModes2EXT GetPhysicalDeviceSurfacePresentModes2EXT;
        /*  505 */ PFN_vkReleaseFullScreenExclusiveModeEXT ReleaseFullScreenExclusiveModeEXT;
#else
        /*  502 */ void *_pad502;
        /*  503 */ void *_pad503;
        /*  504 */ void *_pad504;
        /*  505 */ void *_pad505;
#endif
        /*  506 */ PFN_vkCreateHeadlessSurfaceEXT CreateHeadlessSurfaceEXT;
        /*  507 */ PFN_vkGetBufferDeviceAddressKHR GetBufferDeviceAddressKHR;
        /*  508 */ PFN_vkGetBufferOpaqueCaptureAddressKHR GetBufferOpaqueCaptureAddressKHR;
        /*  509 */ PFN_vkGetDeviceMemoryOpaqueCaptureAddressKHR GetDeviceMemoryOpaqueCaptureAddressKHR;
        /*  510 */ PFN_vkCmdSetLineStippleEXT CmdSetLineStippleEXT;
        /*  511 */ PFN_vkResetQueryPoolEXT ResetQueryPoolEXT;
        /*  512 */ PFN_vkCmdBindVertexBuffers2EXT CmdBindVertexBuffers2EXT;
        /*  513 */ PFN_vkCmdSetCullModeEXT CmdSetCullModeEXT;
        /*  514 */ PFN_vkCmdSetDepthBoundsTestEnableEXT CmdSetDepthBoundsTestEnableEXT;
        /*  515 */ PFN_vkCmdSetDepthCompareOpEXT CmdSetDepthCompareOpEXT;
        /*  516 */ PFN_vkCmdSetDepthTestEnableEXT CmdSetDepthTestEnableEXT;
        /*  517 */ PFN_vkCmdSetDepthWriteEnableEXT CmdSetDepthWriteEnableEXT;
        /*  518 */ PFN_vkCmdSetFrontFaceEXT CmdSetFrontFaceEXT;
        /*  519 */ PFN_vkCmdSetPrimitiveTopologyEXT CmdSetPrimitiveTopologyEXT;
        /*  520 */ PFN_vkCmdSetScissorWithCountEXT CmdSetScissorWithCountEXT;
        /*  521 */ PFN_vkCmdSetStencilOpEXT CmdSetStencilOpEXT;
        /*  522 */ PFN_vkCmdSetStencilTestEnableEXT CmdSetStencilTestEnableEXT;
        /*  523 */ PFN_vkCmdSetViewportWithCountEXT CmdSetViewportWithCountEXT;
        /*  524 */ PFN_vkCreateDeferredOperationKHR CreateDeferredOperationKHR;
        /*  525 */ PFN_vkDeferredOperationJoinKHR DeferredOperationJoinKHR;
        /*  526 */ PFN_vkDestroyDeferredOperationKHR DestroyDeferredOperationKHR;
        /*  527 */ PFN_vkGetDeferredOperationMaxConcurrencyKHR GetDeferredOperationMaxConcurrencyKHR;
        /*  528 */ PFN_vkGetDeferredOperationResultKHR GetDeferredOperationResultKHR;
        /*  529 */ PFN_vkGetPipelineExecutableInternalRepresentationsKHR GetPipelineExecutableInternalRepresentationsKHR;
        /*  530 */ PFN_vkGetPipelineExecutablePropertiesKHR GetPipelineExecutablePropertiesKHR;
        /*  531 */ PFN_vkGetPipelineExecutableStatisticsKHR GetPipelineExecutableStatisticsKHR;
        /*  532 */ PFN_vkCopyImageToImageEXT CopyImageToImageEXT;
        /*  533 */ PFN_vkCopyImageToMemoryEXT CopyImageToMemoryEXT;
        /*  534 */ PFN_vkCopyMemoryToImageEXT CopyMemoryToImageEXT;
        /*  535 */ PFN_vkTransitionImageLayoutEXT TransitionImageLayoutEXT;
        /*  536 */ PFN_vkGetImageSubresourceLayout2EXT GetImageSubresourceLayout2EXT;
        /*  537 */ PFN_vkMapMemory2KHR MapMemory2KHR;
        /*  538 */ PFN_vkUnmapMemory2KHR UnmapMemory2KHR;
        /*  539 */ PFN_vkReleaseSwapchainImagesEXT ReleaseSwapchainImagesEXT;
        /*  540 */ PFN_vkCmdBindPipelineShaderGroupNV CmdBindPipelineShaderGroupNV;
        /*  541 */ PFN_vkCmdExecuteGeneratedCommandsNV CmdExecuteGeneratedCommandsNV;
        /*  542 */ PFN_vkCmdPreprocessGeneratedCommandsNV CmdPreprocessGeneratedCommandsNV;
        /*  543 */ PFN_vkCreateIndirectCommandsLayoutNV CreateIndirectCommandsLayoutNV;
        /*  544 */ PFN_vkDestroyIndirectCommandsLayoutNV DestroyIndirectCommandsLayoutNV;
        /*  545 */ PFN_vkGetGeneratedCommandsMemoryRequirementsNV GetGeneratedCommandsMemoryRequirementsNV;
        /*  546 */ PFN_vkCmdSetDepthBias2EXT CmdSetDepthBias2EXT;
        /*  547 */ PFN_vkAcquireDrmDisplayEXT AcquireDrmDisplayEXT;
        /*  548 */ PFN_vkGetDrmDisplayEXT GetDrmDisplayEXT;
        /*  549 */ PFN_vkCreatePrivateDataSlotEXT CreatePrivateDataSlotEXT;
        /*  550 */ PFN_vkDestroyPrivateDataSlotEXT DestroyPrivateDataSlotEXT;
        /*  551 */ PFN_vkGetPrivateDataEXT GetPrivateDataEXT;
        /*  552 */ PFN_vkSetPrivateDataEXT SetPrivateDataEXT;
        /*  553 */ PFN_vkCmdEncodeVideoKHR CmdEncodeVideoKHR;
        /*  554 */ PFN_vkGetEncodedVideoSessionParametersKHR GetEncodedVideoSessionParametersKHR;
        /*  555 */ PFN_vkGetPhysicalDeviceVideoEncodeQualityLevelPropertiesKHR GetPhysicalDeviceVideoEncodeQualityLevelPropertiesKHR;
        /*  556 */ PFN_vkQueueSetPerfHintQCOM QueueSetPerfHintQCOM;
#if defined(VK_ENABLE_BETA_EXTENSIONS)
        /*  557 */ PFN_vkCmdCudaLaunchKernelNV CmdCudaLaunchKernelNV;
        /*  558 */ PFN_vkCreateCudaFunctionNV CreateCudaFunctionNV;
        /*  559 */ PFN_vkCreateCudaModuleNV CreateCudaModuleNV;
        /*  560 */ PFN_vkDestroyCudaFunctionNV DestroyCudaFunctionNV;
        /*  561 */ PFN_vkDestroyCudaModuleNV DestroyCudaModuleNV;
        /*  562 */ PFN_vkGetCudaModuleCacheNV GetCudaModuleCacheNV;
#else
        /*  557 */ void *_pad557;
        /*  558 */ void *_pad558;
        /*  559 */ void *_pad559;
        /*  560 */ void *_pad560;
        /*  561 */ void *_pad561;
        /*  562 */ void *_pad562;
#endif
        /*  563 */ PFN_vkCmdBeginPerTileExecutionQCOM CmdBeginPerTileExecutionQCOM;
        /*  564 */ PFN_vkCmdDispatchTileQCOM CmdDispatchTileQCOM;
        /*  565 */ PFN_vkCmdEndPerTileExecutionQCOM CmdEndPerTileExecutionQCOM;
#if defined(VK_USE_PLATFORM_METAL_EXT)
        /*  566 */ PFN_vkExportMetalObjectsEXT ExportMetalObjectsEXT;
#else
        /*  566 */ void *_pad566;
#endif
        /*  567 */ PFN_vkCmdPipelineBarrier2KHR CmdPipelineBarrier2KHR;
        /*  568 */ PFN_vkCmdResetEvent2KHR CmdResetEvent2KHR;
        /*  569 */ PFN_vkCmdSetEvent2KHR CmdSetEvent2KHR;
        /*  570 */ PFN_vkCmdWaitEvents2KHR CmdWaitEvents2KHR;
        /*  571 */ PFN_vkCmdWriteTimestamp2KHR CmdWriteTimestamp2KHR;
        /*  572 */ PFN_vkQueueSubmit2KHR QueueSubmit2KHR;
        /*  573 */ PFN_vkCmdBindDescriptorBufferEmbeddedSamplersEXT CmdBindDescriptorBufferEmbeddedSamplersEXT;
        /*  574 */ PFN_vkCmdBindDescriptorBuffersEXT CmdBindDescriptorBuffersEXT;
        /*  575 */ PFN_vkCmdSetDescriptorBufferOffsetsEXT CmdSetDescriptorBufferOffsetsEXT;
        /*  576 */ PFN_vkGetAccelerationStructureOpaqueCaptureDescriptorDataEXT GetAccelerationStructureOpaqueCaptureDescriptorDataEXT;
        /*  577 */ PFN_vkGetBufferOpaqueCaptureDescriptorDataEXT GetBufferOpaqueCaptureDescriptorDataEXT;
        /*  578 */ PFN_vkGetDescriptorEXT GetDescriptorEXT;
        /*  579 */ PFN_vkGetDescriptorSetLayoutBindingOffsetEXT GetDescriptorSetLayoutBindingOffsetEXT;
        /*  580 */ PFN_vkGetDescriptorSetLayoutSizeEXT GetDescriptorSetLayoutSizeEXT;
        /*  581 */ PFN_vkGetImageOpaqueCaptureDescriptorDataEXT GetImageOpaqueCaptureDescriptorDataEXT;
        /*  582 */ PFN_vkGetImageViewOpaqueCaptureDescriptorDataEXT GetImageViewOpaqueCaptureDescriptorDataEXT;
        /*  583 */ PFN_vkGetSamplerOpaqueCaptureDescriptorDataEXT GetSamplerOpaqueCaptureDescriptorDataEXT;
        /*  584 */ PFN_vkCmdBeginConditionalRendering2EXT CmdBeginConditionalRendering2EXT;
        /*  585 */ PFN_vkCmdBeginTransformFeedback2EXT CmdBeginTransformFeedback2EXT;
        /*  586 */ PFN_vkCmdBindIndexBuffer3KHR CmdBindIndexBuffer3KHR;
        /*  587 */ PFN_vkCmdBindTransformFeedbackBuffers2EXT CmdBindTransformFeedbackBuffers2EXT;
        /*  588 */ PFN_vkCmdBindVertexBuffers3KHR CmdBindVertexBuffers3KHR;
        /*  589 */ PFN_vkCmdCopyImageToMemoryKHR CmdCopyImageToMemoryKHR;
        /*  590 */ PFN_vkCmdCopyMemoryKHR CmdCopyMemoryKHR;
        /*  591 */ PFN_vkCmdCopyMemoryToImageKHR CmdCopyMemoryToImageKHR;
        /*  592 */ PFN_vkCmdCopyQueryPoolResultsToMemoryKHR CmdCopyQueryPoolResultsToMemoryKHR;
        /*  593 */ PFN_vkCmdDispatchIndirect2KHR CmdDispatchIndirect2KHR;
        /*  594 */ PFN_vkCmdDrawIndexedIndirect2KHR CmdDrawIndexedIndirect2KHR;
        /*  595 */ PFN_vkCmdDrawIndexedIndirectCount2KHR CmdDrawIndexedIndirectCount2KHR;
        /*  596 */ PFN_vkCmdDrawIndirect2KHR CmdDrawIndirect2KHR;
        /*  597 */ PFN_vkCmdDrawIndirectByteCount2EXT CmdDrawIndirectByteCount2EXT;
        /*  598 */ PFN_vkCmdDrawIndirectCount2KHR CmdDrawIndirectCount2KHR;
        /*  599 */ PFN_vkCmdDrawMeshTasksIndirect2EXT CmdDrawMeshTasksIndirect2EXT;
        /*  600 */ PFN_vkCmdDrawMeshTasksIndirectCount2EXT CmdDrawMeshTasksIndirectCount2EXT;
        /*  601 */ PFN_vkCmdEndTransformFeedback2EXT CmdEndTransformFeedback2EXT;
        /*  602 */ PFN_vkCmdFillMemoryKHR CmdFillMemoryKHR;
        /*  603 */ PFN_vkCmdUpdateMemoryKHR CmdUpdateMemoryKHR;
        /*  604 */ PFN_vkCmdWriteMarkerToMemoryAMD CmdWriteMarkerToMemoryAMD;
        /*  605 */ PFN_vkCreateAccelerationStructure2KHR CreateAccelerationStructure2KHR;
        /*  606 */ PFN_vkCmdSetFragmentShadingRateEnumNV CmdSetFragmentShadingRateEnumNV;
        /*  607 */ PFN_vkCmdDrawMeshTasksEXT CmdDrawMeshTasksEXT;
        /*  608 */ PFN_vkCmdDrawMeshTasksIndirectCountEXT CmdDrawMeshTasksIndirectCountEXT;
        /*  609 */ PFN_vkCmdDrawMeshTasksIndirectEXT CmdDrawMeshTasksIndirectEXT;
        /*  610 */ PFN_vkCmdBlitImage2KHR CmdBlitImage2KHR;
        /*  611 */ PFN_vkCmdCopyBuffer2KHR CmdCopyBuffer2KHR;
        /*  612 */ PFN_vkCmdCopyBufferToImage2KHR CmdCopyBufferToImage2KHR;
        /*  613 */ PFN_vkCmdCopyImage2KHR CmdCopyImage2KHR;
        /*  614 */ PFN_vkCmdCopyImageToBuffer2KHR CmdCopyImageToBuffer2KHR;
        /*  615 */ PFN_vkCmdResolveImage2KHR CmdResolveImage2KHR;
        /*  616 */ PFN_vkGetDeviceFaultInfoEXT GetDeviceFaultInfoEXT;
#if defined(VK_USE_PLATFORM_WIN32_KHR)
        /*  617 */ PFN_vkAcquireWinrtDisplayNV AcquireWinrtDisplayNV;
        /*  618 */ PFN_vkGetWinrtDisplayNV GetWinrtDisplayNV;
#else
        /*  617 */ void *_pad617;
        /*  618 */ void *_pad618;
#endif
#if defined(VK_USE_PLATFORM_DIRECTFB_EXT)
        /*  619 */ PFN_vkCreateDirectFBSurfaceEXT CreateDirectFBSurfaceEXT;
        /*  620 */ PFN_vkGetPhysicalDeviceDirectFBPresentationSupportEXT GetPhysicalDeviceDirectFBPresentationSupportEXT;
#else
        /*  619 */ void *_pad619;
        /*  620 */ void *_pad620;
#endif
        /*  621 */ PFN_vkCmdSetVertexInputEXT CmdSetVertexInputEXT;
#if defined(VK_USE_PLATFORM_FUCHSIA)
        /*  622 */ PFN_vkGetMemoryZirconHandleFUCHSIA GetMemoryZirconHandleFUCHSIA;
        /*  623 */ PFN_vkGetMemoryZirconHandlePropertiesFUCHSIA GetMemoryZirconHandlePropertiesFUCHSIA;
        /*  624 */ PFN_vkGetSemaphoreZirconHandleFUCHSIA GetSemaphoreZirconHandleFUCHSIA;
        /*  625 */ PFN_vkImportSemaphoreZirconHandleFUCHSIA ImportSemaphoreZirconHandleFUCHSIA;
        /*  626 */ PFN_vkCreateBufferCollectionFUCHSIA CreateBufferCollectionFUCHSIA;
        /*  627 */ PFN_vkDestroyBufferCollectionFUCHSIA DestroyBufferCollectionFUCHSIA;
        /*  628 */ PFN_vkGetBufferCollectionPropertiesFUCHSIA GetBufferCollectionPropertiesFUCHSIA;
        /*  629 */ PFN_vkSetBufferCollectionBufferConstraintsFUCHSIA SetBufferCollectionBufferConstraintsFUCHSIA;
        /*  630 */ PFN_vkSetBufferCollectionImageConstraintsFUCHSIA SetBufferCollectionImageConstraintsFUCHSIA;
#else
        /*  622 */ void *_pad622;
        /*  623 */ void *_pad623;
        /*  624 */ void *_pad624;
        /*  625 */ void *_pad625;
        /*  626 */ void *_pad626;
        /*  627 */ void *_pad627;
        /*  628 */ void *_pad628;
        /*  629 */ void *_pad629;
        /*  630 */ void *_pad630;
#endif
        /*  631 */ PFN_vkCmdSubpassShadingHUAWEI CmdSubpassShadingHUAWEI;
        /*  632 */ PFN_vkGetDeviceSubpassShadingMaxWorkgroupSizeHUAWEI GetDeviceSubpassShadingMaxWorkgroupSizeHUAWEI;
        /*  633 */ PFN_vkCmdBindInvocationMaskHUAWEI CmdBindInvocationMaskHUAWEI;
        /*  634 */ PFN_vkGetMemoryRemoteAddressNV GetMemoryRemoteAddressNV;
        /*  635 */ PFN_vkGetPipelinePropertiesEXT GetPipelinePropertiesEXT;
        /*  636 */ PFN_vkCmdSetDepthBiasEnableEXT CmdSetDepthBiasEnableEXT;
        /*  637 */ PFN_vkCmdSetLogicOpEXT CmdSetLogicOpEXT;
        /*  638 */ PFN_vkCmdSetPatchControlPointsEXT CmdSetPatchControlPointsEXT;
        /*  639 */ PFN_vkCmdSetPrimitiveRestartEnableEXT CmdSetPrimitiveRestartEnableEXT;
        /*  640 */ PFN_vkCmdSetRasterizerDiscardEnableEXT CmdSetRasterizerDiscardEnableEXT;
#if defined(VK_USE_PLATFORM_SCREEN_QNX)
        /*  641 */ PFN_vkCreateScreenSurfaceQNX CreateScreenSurfaceQNX;
        /*  642 */ PFN_vkGetPhysicalDeviceScreenPresentationSupportQNX GetPhysicalDeviceScreenPresentationSupportQNX;
#else
        /*  641 */ void *_pad641;
        /*  642 */ void *_pad642;
#endif
        /*  643 */ PFN_vkCmdSetColorWriteEnableEXT CmdSetColorWriteEnableEXT;
        /*  644 */ PFN_vkCmdTraceRaysIndirect2KHR CmdTraceRaysIndirect2KHR;
        /*  645 */ PFN_vkCmdDrawMultiEXT CmdDrawMultiEXT;
        /*  646 */ PFN_vkCmdDrawMultiIndexedEXT CmdDrawMultiIndexedEXT;
        /*  647 */ PFN_vkBuildMicromapsEXT BuildMicromapsEXT;
        /*  648 */ PFN_vkCmdBuildMicromapsEXT CmdBuildMicromapsEXT;
        /*  649 */ PFN_vkCmdCopyMemoryToMicromapEXT CmdCopyMemoryToMicromapEXT;
        /*  650 */ PFN_vkCmdCopyMicromapEXT CmdCopyMicromapEXT;
        /*  651 */ PFN_vkCmdCopyMicromapToMemoryEXT CmdCopyMicromapToMemoryEXT;
        /*  652 */ PFN_vkCmdWriteMicromapsPropertiesEXT CmdWriteMicromapsPropertiesEXT;
        /*  653 */ PFN_vkCopyMemoryToMicromapEXT CopyMemoryToMicromapEXT;
        /*  654 */ PFN_vkCopyMicromapEXT CopyMicromapEXT;
        /*  655 */ PFN_vkCopyMicromapToMemoryEXT CopyMicromapToMemoryEXT;
        /*  656 */ PFN_vkCreateMicromapEXT CreateMicromapEXT;
        /*  657 */ PFN_vkDestroyMicromapEXT DestroyMicromapEXT;
        /*  658 */ PFN_vkGetDeviceMicromapCompatibilityEXT GetDeviceMicromapCompatibilityEXT;
        /*  659 */ PFN_vkGetMicromapBuildSizesEXT GetMicromapBuildSizesEXT;
        /*  660 */ PFN_vkWriteMicromapsPropertiesEXT WriteMicromapsPropertiesEXT;
        /*  661 */ PFN_vkCmdDrawClusterHUAWEI CmdDrawClusterHUAWEI;
        /*  662 */ PFN_vkCmdDrawClusterIndirectHUAWEI CmdDrawClusterIndirectHUAWEI;
        /*  663 */ PFN_vkSetDeviceMemoryPriorityEXT SetDeviceMemoryPriorityEXT;
        /*  664 */ PFN_vkGetDeviceBufferMemoryRequirementsKHR GetDeviceBufferMemoryRequirementsKHR;
        /*  665 */ PFN_vkGetDeviceImageMemoryRequirementsKHR GetDeviceImageMemoryRequirementsKHR;
        /*  666 */ PFN_vkGetDeviceImageSparseMemoryRequirementsKHR GetDeviceImageSparseMemoryRequirementsKHR;
        /*  667 */ PFN_vkCmdSetDispatchParametersARM CmdSetDispatchParametersARM;
        /*  668 */ PFN_vkGetDescriptorSetHostMappingVALVE GetDescriptorSetHostMappingVALVE;
        /*  669 */ PFN_vkGetDescriptorSetLayoutHostMappingInfoVALVE GetDescriptorSetLayoutHostMappingInfoVALVE;
        /*  670 */ PFN_vkCmdCopyMemoryIndirectNV CmdCopyMemoryIndirectNV;
        /*  671 */ PFN_vkCmdCopyMemoryToImageIndirectNV CmdCopyMemoryToImageIndirectNV;
        /*  672 */ PFN_vkCmdDecompressMemoryIndirectCountNV CmdDecompressMemoryIndirectCountNV;
        /*  673 */ PFN_vkCmdDecompressMemoryNV CmdDecompressMemoryNV;
        /*  674 */ PFN_vkCmdUpdatePipelineIndirectBufferNV CmdUpdatePipelineIndirectBufferNV;
        /*  675 */ PFN_vkGetPipelineIndirectDeviceAddressNV GetPipelineIndirectDeviceAddressNV;
        /*  676 */ PFN_vkGetPipelineIndirectMemoryRequirementsNV GetPipelineIndirectMemoryRequirementsNV;
#if defined(VK_USE_PLATFORM_OHOS)
        /*  677 */ PFN_vkGetMemoryNativeBufferOHOS GetMemoryNativeBufferOHOS;
        /*  678 */ PFN_vkGetNativeBufferPropertiesOHOS GetNativeBufferPropertiesOHOS;
#else
        /*  677 */ void *_pad677;
        /*  678 */ void *_pad678;
#endif
        /*  679 */ PFN_vkCmdSetAlphaToCoverageEnableEXT CmdSetAlphaToCoverageEnableEXT;
        /*  680 */ PFN_vkCmdSetAlphaToOneEnableEXT CmdSetAlphaToOneEnableEXT;
        /*  681 */ PFN_vkCmdSetColorBlendAdvancedEXT CmdSetColorBlendAdvancedEXT;
        /*  682 */ PFN_vkCmdSetColorBlendEnableEXT CmdSetColorBlendEnableEXT;
        /*  683 */ PFN_vkCmdSetColorBlendEquationEXT CmdSetColorBlendEquationEXT;
        /*  684 */ PFN_vkCmdSetColorWriteMaskEXT CmdSetColorWriteMaskEXT;
        /*  685 */ PFN_vkCmdSetConservativeRasterizationModeEXT CmdSetConservativeRasterizationModeEXT;
        /*  686 */ PFN_vkCmdSetCoverageModulationModeNV CmdSetCoverageModulationModeNV;
        /*  687 */ PFN_vkCmdSetCoverageModulationTableEnableNV CmdSetCoverageModulationTableEnableNV;
        /*  688 */ PFN_vkCmdSetCoverageModulationTableNV CmdSetCoverageModulationTableNV;
        /*  689 */ PFN_vkCmdSetCoverageReductionModeNV CmdSetCoverageReductionModeNV;
        /*  690 */ PFN_vkCmdSetCoverageToColorEnableNV CmdSetCoverageToColorEnableNV;
        /*  691 */ PFN_vkCmdSetCoverageToColorLocationNV CmdSetCoverageToColorLocationNV;
        /*  692 */ PFN_vkCmdSetDepthClampEnableEXT CmdSetDepthClampEnableEXT;
        /*  693 */ PFN_vkCmdSetDepthClipEnableEXT CmdSetDepthClipEnableEXT;
        /*  694 */ PFN_vkCmdSetDepthClipNegativeOneToOneEXT CmdSetDepthClipNegativeOneToOneEXT;
        /*  695 */ PFN_vkCmdSetExtraPrimitiveOverestimationSizeEXT CmdSetExtraPrimitiveOverestimationSizeEXT;
        /*  696 */ PFN_vkCmdSetLineRasterizationModeEXT CmdSetLineRasterizationModeEXT;
        /*  697 */ PFN_vkCmdSetLineStippleEnableEXT CmdSetLineStippleEnableEXT;
        /*  698 */ PFN_vkCmdSetLogicOpEnableEXT CmdSetLogicOpEnableEXT;
        /*  699 */ PFN_vkCmdSetPolygonModeEXT CmdSetPolygonModeEXT;
        /*  700 */ PFN_vkCmdSetProvokingVertexModeEXT CmdSetProvokingVertexModeEXT;
        /*  701 */ PFN_vkCmdSetRasterizationSamplesEXT CmdSetRasterizationSamplesEXT;
        /*  702 */ PFN_vkCmdSetRasterizationStreamEXT CmdSetRasterizationStreamEXT;
        /*  703 */ PFN_vkCmdSetRepresentativeFragmentTestEnableNV CmdSetRepresentativeFragmentTestEnableNV;
        /*  704 */ PFN_vkCmdSetSampleLocationsEnableEXT CmdSetSampleLocationsEnableEXT;
        /*  705 */ PFN_vkCmdSetSampleMaskEXT CmdSetSampleMaskEXT;
        /*  706 */ PFN_vkCmdSetShadingRateImageEnableNV CmdSetShadingRateImageEnableNV;
        /*  707 */ PFN_vkCmdSetTessellationDomainOriginEXT CmdSetTessellationDomainOriginEXT;
        /*  708 */ PFN_vkCmdSetViewportSwizzleNV CmdSetViewportSwizzleNV;
        /*  709 */ PFN_vkCmdSetViewportWScalingEnableNV CmdSetViewportWScalingEnableNV;
        /*  710 */ PFN_vkBindTensorMemoryARM BindTensorMemoryARM;
        /*  711 */ PFN_vkCmdCopyTensorARM CmdCopyTensorARM;
        /*  712 */ PFN_vkCreateTensorARM CreateTensorARM;
        /*  713 */ PFN_vkCreateTensorViewARM CreateTensorViewARM;
        /*  714 */ PFN_vkDestroyTensorARM DestroyTensorARM;
        /*  715 */ PFN_vkDestroyTensorViewARM DestroyTensorViewARM;
        /*  716 */ PFN_vkGetDeviceTensorMemoryRequirementsARM GetDeviceTensorMemoryRequirementsARM;
        /*  717 */ PFN_vkGetPhysicalDeviceExternalTensorPropertiesARM GetPhysicalDeviceExternalTensorPropertiesARM;
        /*  718 */ PFN_vkGetTensorMemoryRequirementsARM GetTensorMemoryRequirementsARM;
        /*  719 */ PFN_vkGetTensorOpaqueCaptureDescriptorDataARM GetTensorOpaqueCaptureDescriptorDataARM;
        /*  720 */ PFN_vkGetTensorViewOpaqueCaptureDescriptorDataARM GetTensorViewOpaqueCaptureDescriptorDataARM;
        /*  721 */ PFN_vkGetShaderModuleCreateInfoIdentifierEXT GetShaderModuleCreateInfoIdentifierEXT;
        /*  722 */ PFN_vkGetShaderModuleIdentifierEXT GetShaderModuleIdentifierEXT;
        /*  723 */ PFN_vkBindOpticalFlowSessionImageNV BindOpticalFlowSessionImageNV;
        /*  724 */ PFN_vkCmdOpticalFlowExecuteNV CmdOpticalFlowExecuteNV;
        /*  725 */ PFN_vkCreateOpticalFlowSessionNV CreateOpticalFlowSessionNV;
        /*  726 */ PFN_vkDestroyOpticalFlowSessionNV DestroyOpticalFlowSessionNV;
        /*  727 */ PFN_vkGetPhysicalDeviceOpticalFlowImageFormatsNV GetPhysicalDeviceOpticalFlowImageFormatsNV;
        /*  728 */ PFN_vkCmdBindIndexBuffer2KHR CmdBindIndexBuffer2KHR;
        /*  729 */ PFN_vkGetDeviceImageSubresourceLayoutKHR GetDeviceImageSubresourceLayoutKHR;
        /*  730 */ PFN_vkGetImageSubresourceLayout2KHR GetImageSubresourceLayout2KHR;
        /*  731 */ PFN_vkGetRenderingAreaGranularityKHR GetRenderingAreaGranularityKHR;
        /*  732 */ PFN_vkAntiLagUpdateAMD AntiLagUpdateAMD;
        /*  733 */ PFN_vkWaitForPresent2KHR WaitForPresent2KHR;
        /*  734 */ PFN_vkCmdBindShadersEXT CmdBindShadersEXT;
        /*  735 */ PFN_vkCreateShadersEXT CreateShadersEXT;
        /*  736 */ PFN_vkDestroyShaderEXT DestroyShaderEXT;
        /*  737 */ PFN_vkGetShaderBinaryDataEXT GetShaderBinaryDataEXT;
        /*  738 */ PFN_vkCmdSetDepthClampRangeEXT CmdSetDepthClampRangeEXT;
        /*  739 */ PFN_vkCreatePipelineBinariesKHR CreatePipelineBinariesKHR;
        /*  740 */ PFN_vkDestroyPipelineBinaryKHR DestroyPipelineBinaryKHR;
        /*  741 */ PFN_vkGetPipelineBinaryDataKHR GetPipelineBinaryDataKHR;
        /*  742 */ PFN_vkGetPipelineKeyKHR GetPipelineKeyKHR;
        /*  743 */ PFN_vkReleaseCapturedPipelineDataKHR ReleaseCapturedPipelineDataKHR;
        /*  744 */ PFN_vkGetDynamicRenderingTilePropertiesQCOM GetDynamicRenderingTilePropertiesQCOM;
        /*  745 */ PFN_vkGetFramebufferTilePropertiesQCOM GetFramebufferTilePropertiesQCOM;
        /*  746 */ PFN_vkReleaseSwapchainImagesKHR ReleaseSwapchainImagesKHR;
        /*  747 */ PFN_vkCmdConvertCooperativeVectorMatrixNV CmdConvertCooperativeVectorMatrixNV;
        /*  748 */ PFN_vkConvertCooperativeVectorMatrixNV ConvertCooperativeVectorMatrixNV;
        /*  749 */ PFN_vkGetPhysicalDeviceCooperativeVectorPropertiesNV GetPhysicalDeviceCooperativeVectorPropertiesNV;
        /*  750 */ PFN_vkGetLatencyTimingsNV GetLatencyTimingsNV;
        /*  751 */ PFN_vkLatencySleepNV LatencySleepNV;
        /*  752 */ PFN_vkQueueNotifyOutOfBandNV QueueNotifyOutOfBandNV;
        /*  753 */ PFN_vkSetLatencyMarkerNV SetLatencyMarkerNV;
        /*  754 */ PFN_vkSetLatencySleepModeNV SetLatencySleepModeNV;
        /*  755 */ PFN_vkGetPhysicalDeviceCooperativeMatrixPropertiesKHR GetPhysicalDeviceCooperativeMatrixPropertiesKHR;
        /*  756 */ PFN_vkBindDataGraphPipelineSessionMemoryARM BindDataGraphPipelineSessionMemoryARM;
        /*  757 */ PFN_vkCmdDispatchDataGraphARM CmdDispatchDataGraphARM;
        /*  758 */ PFN_vkCreateDataGraphPipelineSessionARM CreateDataGraphPipelineSessionARM;
        /*  759 */ PFN_vkCreateDataGraphPipelinesARM CreateDataGraphPipelinesARM;
        /*  760 */ PFN_vkDestroyDataGraphPipelineSessionARM DestroyDataGraphPipelineSessionARM;
        /*  761 */ PFN_vkGetDataGraphPipelineAvailablePropertiesARM GetDataGraphPipelineAvailablePropertiesARM;
        /*  762 */ PFN_vkGetDataGraphPipelinePropertiesARM GetDataGraphPipelinePropertiesARM;
        /*  763 */ PFN_vkGetDataGraphPipelineSessionBindPointRequirementsARM GetDataGraphPipelineSessionBindPointRequirementsARM;
        /*  764 */ PFN_vkGetDataGraphPipelineSessionMemoryRequirementsARM GetDataGraphPipelineSessionMemoryRequirementsARM;
        /*  765 */ PFN_vkGetPhysicalDeviceQueueFamilyDataGraphProcessingEnginePropertiesARM GetPhysicalDeviceQueueFamilyDataGraphProcessingEnginePropertiesARM;
        /*  766 */ PFN_vkGetPhysicalDeviceQueueFamilyDataGraphPropertiesARM GetPhysicalDeviceQueueFamilyDataGraphPropertiesARM;
        /*  767 */ PFN_vkGetPhysicalDeviceQueueFamilyDataGraphEngineOperationPropertiesARM GetPhysicalDeviceQueueFamilyDataGraphEngineOperationPropertiesARM;
        /*  768 */ PFN_vkCmdSetAttachmentFeedbackLoopEnableEXT CmdSetAttachmentFeedbackLoopEnableEXT;
#if defined(VK_USE_PLATFORM_SCREEN_QNX)
        /*  769 */ PFN_vkGetScreenBufferPropertiesQNX GetScreenBufferPropertiesQNX;
#else
        /*  769 */ void *_pad769;
#endif
        /*  770 */ PFN_vkCmdSetLineStippleKHR CmdSetLineStippleKHR;
        /*  771 */ PFN_vkGetCalibratedTimestampsKHR GetCalibratedTimestampsKHR;
        /*  772 */ PFN_vkGetPhysicalDeviceCalibrateableTimeDomainsKHR GetPhysicalDeviceCalibrateableTimeDomainsKHR;
        /*  773 */ PFN_vkCmdBindDescriptorBufferEmbeddedSamplers2EXT CmdBindDescriptorBufferEmbeddedSamplers2EXT;
        /*  774 */ PFN_vkCmdBindDescriptorSets2KHR CmdBindDescriptorSets2KHR;
        /*  775 */ PFN_vkCmdPushConstants2KHR CmdPushConstants2KHR;
        /*  776 */ PFN_vkCmdPushDescriptorSet2KHR CmdPushDescriptorSet2KHR;
        /*  777 */ PFN_vkCmdPushDescriptorSetWithTemplate2KHR CmdPushDescriptorSetWithTemplate2KHR;
        /*  778 */ PFN_vkCmdSetDescriptorBufferOffsets2EXT CmdSetDescriptorBufferOffsets2EXT;
        /*  779 */ PFN_vkCmdBindTileMemoryQCOM CmdBindTileMemoryQCOM;
        /*  780 */ PFN_vkCmdCopyMemoryIndirectKHR CmdCopyMemoryIndirectKHR;
        /*  781 */ PFN_vkCmdCopyMemoryToImageIndirectKHR CmdCopyMemoryToImageIndirectKHR;
        /*  782 */ PFN_vkCmdDecompressMemoryEXT CmdDecompressMemoryEXT;
        /*  783 */ PFN_vkCmdDecompressMemoryIndirectCountEXT CmdDecompressMemoryIndirectCountEXT;
        /*  784 */ PFN_vkCreateExternalComputeQueueNV CreateExternalComputeQueueNV;
        /*  785 */ PFN_vkDestroyExternalComputeQueueNV DestroyExternalComputeQueueNV;
        /*  786 */ PFN_vkGetExternalComputeQueueDataNV GetExternalComputeQueueDataNV;
        /*  787 */ PFN_vkCmdBuildClusterAccelerationStructureIndirectNV CmdBuildClusterAccelerationStructureIndirectNV;
        /*  788 */ PFN_vkGetClusterAccelerationStructureBuildSizesNV GetClusterAccelerationStructureBuildSizesNV;
        /*  789 */ PFN_vkCmdBuildPartitionedAccelerationStructuresNV CmdBuildPartitionedAccelerationStructuresNV;
        /*  790 */ PFN_vkGetPartitionedAccelerationStructuresBuildSizesNV GetPartitionedAccelerationStructuresBuildSizesNV;
        /*  791 */ PFN_vkCmdExecuteGeneratedCommandsEXT CmdExecuteGeneratedCommandsEXT;
        /*  792 */ PFN_vkCmdPreprocessGeneratedCommandsEXT CmdPreprocessGeneratedCommandsEXT;
        /*  793 */ PFN_vkCreateIndirectCommandsLayoutEXT CreateIndirectCommandsLayoutEXT;
        /*  794 */ PFN_vkCreateIndirectExecutionSetEXT CreateIndirectExecutionSetEXT;
        /*  795 */ PFN_vkDestroyIndirectCommandsLayoutEXT DestroyIndirectCommandsLayoutEXT;
        /*  796 */ PFN_vkDestroyIndirectExecutionSetEXT DestroyIndirectExecutionSetEXT;
        /*  797 */ PFN_vkGetGeneratedCommandsMemoryRequirementsEXT GetGeneratedCommandsMemoryRequirementsEXT;
        /*  798 */ PFN_vkUpdateIndirectExecutionSetPipelineEXT UpdateIndirectExecutionSetPipelineEXT;
        /*  799 */ PFN_vkUpdateIndirectExecutionSetShaderEXT UpdateIndirectExecutionSetShaderEXT;
        /*  800 */ PFN_vkGetDeviceFaultDebugInfoKHR GetDeviceFaultDebugInfoKHR;
        /*  801 */ PFN_vkGetDeviceFaultReportsKHR GetDeviceFaultReportsKHR;
#if defined(VK_USE_PLATFORM_OHOS)
        /*  802 */ PFN_vkCreateSurfaceOHOS CreateSurfaceOHOS;
#else
        /*  802 */ void *_pad802;
#endif
        /*  803 */ PFN_vkGetPhysicalDeviceCooperativeMatrixFlexibleDimensionsPropertiesNV GetPhysicalDeviceCooperativeMatrixFlexibleDimensionsPropertiesNV;
#if defined(VK_USE_PLATFORM_METAL_EXT)
        /*  804 */ PFN_vkGetMemoryMetalHandleEXT GetMemoryMetalHandleEXT;
        /*  805 */ PFN_vkGetMemoryMetalHandlePropertiesEXT GetMemoryMetalHandlePropertiesEXT;
#else
        /*  804 */ void *_pad804;
        /*  805 */ void *_pad805;
#endif
        /*  806 */ PFN_vkEnumeratePhysicalDeviceQueueFamilyPerformanceCountersByRegionARM EnumeratePhysicalDeviceQueueFamilyPerformanceCountersByRegionARM;
        /*  807 */ PFN_vkClearShaderInstrumentationMetricsARM ClearShaderInstrumentationMetricsARM;
        /*  808 */ PFN_vkCmdBeginShaderInstrumentationARM CmdBeginShaderInstrumentationARM;
        /*  809 */ PFN_vkCmdEndShaderInstrumentationARM CmdEndShaderInstrumentationARM;
        /*  810 */ PFN_vkCreateShaderInstrumentationARM CreateShaderInstrumentationARM;
        /*  811 */ PFN_vkDestroyShaderInstrumentationARM DestroyShaderInstrumentationARM;
        /*  812 */ PFN_vkEnumeratePhysicalDeviceShaderInstrumentationMetricsARM EnumeratePhysicalDeviceShaderInstrumentationMetricsARM;
        /*  813 */ PFN_vkGetShaderInstrumentationValuesARM GetShaderInstrumentationValuesARM;
        /*  814 */ PFN_vkCmdEndRendering2EXT CmdEndRendering2EXT;
        /*  815 */ PFN_vkCmdBeginCustomResolveEXT CmdBeginCustomResolveEXT;
        /*  816 */ PFN_vkCmdEndRendering2KHR CmdEndRendering2KHR;
        /*  817 */ PFN_vkGetPhysicalDeviceQueueFamilyDataGraphOpticalFlowImageFormatsARM GetPhysicalDeviceQueueFamilyDataGraphOpticalFlowImageFormatsARM;
        /*  818 */ PFN_vkCmdSetComputeOccupancyPriorityNV CmdSetComputeOccupancyPriorityNV;
#if defined(VK_USE_PLATFORM_UBM_SEC)
        /*  819 */ PFN_vkCreateUbmSurfaceSEC CreateUbmSurfaceSEC;
        /*  820 */ PFN_vkGetPhysicalDeviceUbmPresentationSupportSEC GetPhysicalDeviceUbmPresentationSupportSEC;
#else
        /*  819 */ void *_pad819;
        /*  820 */ void *_pad820;
#endif
        /*  821 */ PFN_vkCmdSetPrimitiveRestartIndexEXT CmdSetPrimitiveRestartIndexEXT;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;

    /* The last VkInstance this context loaded entry points from */
    VkInstance vk_loaded_instance;
    /* The last VkDevice this context loaded entry points from */
    VkDevice vk_loaded_device;
    /* Vulkan discovery-path metadata — used by gloamLoaderLoadVulkanContext to make
