/*
 * Generated by gloam 0.4.8. DO NOT EDIT.
 *
 *   gloam --api gl:core,gles2,egl --merge --fetch --out-path gl-egl --quiet c --alias --loader
 *
 * Extensions: all (969 included)
 *
 * Copyright (c) 2026 Steven Noonan
 * SPDX-License-Identifier: MIT
 *
 * Portions derived from Khronos Group XML API Registry specifications.
 * Copyright (c) 2013-2026 The Khronos Group Inc.
 * SPDX-License-Identifier: Apache-2.0
 *
 * Includes extensions from the ANGLE project (gl_angle_ext.xml, egl_angle_ext.xml).
 * Copyright (c) 2026 Google Inc.
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef GLOAM_GL_H
#define GLOAM_GL_H

#ifdef __clang__
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#endif
#ifdef __gl_h_
  #error OpenGL (gl.h) header already included (API: gl), remove previous include!
#endif
#define __gl_h_ 1
#ifdef __glext_h_
  #error OpenGL (glext.h) header already included (API: gl), remove previous include!
#endif
#define __glext_h_ 1
#ifdef __gl2_h_
  #error OpenGL ES 2 (gl2.h) header already included (API: gles2), remove previous include!
#endif
#define __gl2_h_ 1
#ifdef __gles2_gl2_h_
  #error OpenGL ES 2 header already included (API: gles2), remove previous include!
#endif
#define __gles2_gl2_h_ 1
#ifdef __gl3_h_
  #error OpenGL ES 3 (gl3.h) header already included (API: gles2), remove previous include!
#endif
#define __gl3_h_ 1
#ifdef __gles2_gl3_h_
  #error OpenGL ES 3 header already included (API: gles2), remove previous include!

typedef void (APIENTRYP PFNGLTEXSTORAGEMEMFLAGS3DANGLEPROC)(GLenum target, GLsizei levels, GLenum internalFormat, GLsizei width, GLsizei height, GLsizei depth, GLuint memory, GLuint64 offset, GLbitfield createFlags, GLbitfield usageFlags, const void * imageCreateInfoPNext);
typedef void (APIENTRYP PFNGLTEXSTORAGEMEMFLAGS3DMULTISAMPLEANGLEPROC)(GLenum target, GLsizei samples, GLenum internalFormat, GLsizei width, GLsizei height, GLsizei depth, GLboolean fixedSampleLocations, GLuint memory, GLuint64 offset, GLbitfield createFlags, GLbitfield usageFlags, const void * imageCreateInfoPNext);
typedef void (APIENTRYP PFNGLIMPORTMEMORYZIRCONHANDLEANGLEPROC)(GLuint memory, GLuint64 size, GLenum handleType, GLuint handle);
typedef void (APIENTRYP PFNGLIMPORTSEMAPHOREZIRCONHANDLEANGLEPROC)(GLuint semaphore, GLenum handleType, GLuint handle);
typedef void (APIENTRYP PFNGLBEGINPIXELLOCALSTORAGEANGLEPROC)(GLsizei n, const GLenum * loadops);
typedef void (APIENTRYP PFNGLENDPIXELLOCALSTORAGEANGLEPROC)(GLsizei n, const GLenum * storeops);
typedef void (APIENTRYP PFNGLENDPIXELLOCALSTORAGEIMPLICITANGLEPROC)(void);
typedef void (APIENTRYP PFNGLFRAMEBUFFERMEMORYLESSPIXELLOCALSTORAGEANGLEPROC)(GLint plane, GLenum internalformat, GLbitfield usage);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEFVANGLEPROC)(GLint plane, const GLfloat * value);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEIVANGLEPROC)(GLint plane, const GLint * value);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEUIVANGLEPROC)(GLint plane, const GLuint * value);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALSTORAGEINTERRUPTANGLEPROC)(void);
typedef void (APIENTRYP PFNGLFRAMEBUFFERPIXELLOCALSTORAGERESTOREANGLEPROC)(void);
typedef void (APIENTRYP PFNGLFRAMEBUFFERTEXTUREPIXELLOCALSTORAGEANGLEPROC)(GLint plane, GLuint backingtexture, GLint level, GLint layer, GLbitfield usage);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVANGLEPROC)(GLint plane, GLenum pname, GLfloat * params);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVANGLEPROC)(GLint plane, GLenum pname, GLint * params);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERUIVANGLEPROC)(GLint plane, GLenum pname, GLuint * params);
typedef void (APIENTRYP PFNGLPIXELLOCALSTORAGEBARRIERANGLEPROC)(void);
typedef void (APIENTRYP PFNGLLOGICOPANGLEPROC)(GLenum opcode);
typedef void (APIENTRYP PFNGLBLOBCACHECALLBACKSANGLEPROC)(GLSETBLOBPROCANGLE set, GLGETBLOBPROCANGLE get, const void * userParam);
typedef void (APIENTRYP PFNGLGETPOINTERVANGLEPROC)(GLenum pname, void ** params);


/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamGLContext {
    union {
        unsigned char featArray[23];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        /*    5 */ unsigned char VERSION_1_5;
        /*    6 */ unsigned char VERSION_2_0;
        /*    7 */ unsigned char VERSION_2_1;
        /*    8 */ unsigned char VERSION_3_0;
        /*    9 */ unsigned char VERSION_3_1;
        /*   10 */ unsigned char VERSION_3_2;
        /*   11 */ unsigned char VERSION_3_3;
        /*   12 */ unsigned char VERSION_4_0;
        /*   13 */ unsigned char VERSION_4_1;
        /*   14 */ unsigned char VERSION_4_2;
        /*   15 */ unsigned char VERSION_4_3;
        /*   16 */ unsigned char VERSION_4_4;
        /*   17 */ unsigned char VERSION_4_5;
        /*   18 */ unsigned char VERSION_4_6;
        /*   19 */ unsigned char ES_VERSION_2_0;
        /*   20 */ unsigned char ES_VERSION_3_0;
        /*   21 */ unsigned char ES_VERSION_3_1;
        /*   22 */ unsigned char ES_VERSION_3_2;
        };
    };

    union {
        unsigned char extArray[969];
        struct {
        /*    0 */ unsigned char _3DFX_multisample;
        /*    1 */ unsigned char _3DFX_tbuffer;
        /*    2 */ unsigned char _3DFX_texture_compression_FXT1;
        /*    3 */ unsigned char AMD_blend_minmax_factor;
        /*    4 */ unsigned char AMD_compressed_3DC_texture;
        /*    5 */ unsigned char AMD_compressed_ATC_texture;
        /*    6 */ unsigned char AMD_conservative_depth;
        /*    7 */ unsigned char AMD_debug_output;
        /*    8 */ unsigned char AMD_depth_clamp_separate;
        /*    9 */ unsigned char AMD_draw_buffers_blend;
        /*   10 */ unsigned char AMD_framebuffer_multisample_advanced;
        /*   11 */ unsigned char AMD_framebuffer_sample_positions;
        /*   12 */ unsigned char AMD_gcn_shader;
        /*   13 */ unsigned char AMD_gpu_shader_half_float;
        /*   14 */ unsigned char AMD_gpu_shader_int16;
        /*   15 */ unsigned char AMD_gpu_shader_int64;
        /*   16 */ unsigned char AMD_interleaved_elements;
        /*   17 */ unsigned char AMD_multi_draw_indirect;
        /*   18 */ unsigned char AMD_name_gen_delete;
        /*   19 */ unsigned char AMD_occlusion_query_event;
        /*   20 */ unsigned char AMD_performance_monitor;
        /*   21 */ unsigned char AMD_pinned_memory;
        /*   22 */ unsigned char AMD_program_binary_Z400;
        /*   23 */ unsigned char AMD_query_buffer_object;
        /*   24 */ unsigned char AMD_sample_positions;
        /*   25 */ unsigned char AMD_seamless_cubemap_per_texture;
        /*   26 */ unsigned char AMD_shader_atomic_counter_ops;
        /*   27 */ unsigned char AMD_shader_ballot;
        /*   28 */ unsigned char AMD_shader_explicit_vertex_parameter;
        /*   29 */ unsigned char AMD_shader_fragment_mask;
        /*   30 */ unsigned char AMD_shader_gpu_shader_half_float_fetch;
        /*   31 */ unsigned char AMD_shader_image_load_store_lod;
        /*   32 */ unsigned char AMD_shader_stencil_export;
        /*   33 */ unsigned char AMD_shader_trinary_minmax;
        /*   34 */ unsigned char AMD_sparse_texture;
        /*   35 */ unsigned char AMD_stencil_operation_extended;
        /*   36 */ unsigned char AMD_texture_gather_bias_lod;
        /*   37 */ unsigned char AMD_texture_texture4;
        /*   38 */ unsigned char AMD_transform_feedback3_lines_triangles;
        /*   39 */ unsigned char AMD_transform_feedback4;
        /*   40 */ unsigned char AMD_vertex_shader_layer;
        /*   41 */ unsigned char AMD_vertex_shader_tessellator;
        /*   42 */ unsigned char AMD_vertex_shader_viewport_index;
        /*   43 */ unsigned char ANDROID_extension_pack_es31a;
        /*   44 */ unsigned char ANGLE_base_vertex_base_instance;
        /*   45 */ unsigned char ANGLE_blob_cache;
        /*   46 */ unsigned char ANGLE_client_arrays;
        /*   47 */ unsigned char ANGLE_clip_cull_distance;
        /*   48 */ unsigned char ANGLE_copy_texture_3d;
        /*   49 */ unsigned char ANGLE_depth_texture;
        /*   50 */ unsigned char ANGLE_framebuffer_blit;
        /*   51 */ unsigned char ANGLE_framebuffer_multisample;
        /*   52 */ unsigned char ANGLE_get_image;
        /*   53 */ unsigned char ANGLE_get_serialized_context_string;
        /*   54 */ unsigned char ANGLE_get_tex_level_parameter;
        /*   55 */ unsigned char ANGLE_instanced_arrays;
        /*   56 */ unsigned char ANGLE_logic_op;
        /*   57 */ unsigned char ANGLE_lossy_etc_decode;
        /*   58 */ unsigned char ANGLE_memory_object_flags;
        /*   59 */ unsigned char ANGLE_memory_object_fuchsia;
        /*   60 */ unsigned char ANGLE_memory_size;
        /*   61 */ unsigned char ANGLE_multi_draw;
        /*   62 */ unsigned char ANGLE_pack_reverse_row_order;
        /*   63 */ unsigned char ANGLE_polygon_mode;
        /*   64 */ unsigned char ANGLE_program_binary;
        /*   65 */ unsigned char ANGLE_program_binary_readiness_query;
        /*   66 */ unsigned char ANGLE_program_cache_control;
        /*   67 */ unsigned char ANGLE_provoking_vertex;
        /*   68 */ unsigned char ANGLE_renderability_validation;
        /*   69 */ unsigned char ANGLE_request_extension;
        /*   70 */ unsigned char ANGLE_rgbx_internal_format;
        /*   71 */ unsigned char ANGLE_robust_client_memory;
        /*   72 */ unsigned char ANGLE_robust_fragment_shader_output;
        /*   73 */ unsigned char ANGLE_robust_resource_initialization;
        /*   74 */ unsigned char ANGLE_semaphore_fuchsia;
        /*   75 */ unsigned char ANGLE_shader_binary;
        /*   76 */ unsigned char ANGLE_shader_pixel_local_storage;
        /*   77 */ unsigned char ANGLE_stencil_texturing;
        /*   78 */ unsigned char ANGLE_texture_compression_dxt1;
        /*   79 */ unsigned char ANGLE_texture_compression_dxt3;
        /*   80 */ unsigned char ANGLE_texture_compression_dxt5;
        /*   81 */ unsigned char ANGLE_texture_external_update;
        /*   82 */ unsigned char ANGLE_texture_multisample;
        /*   83 */ unsigned char ANGLE_texture_usage;
        /*   84 */ unsigned char ANGLE_translated_shader_source;
        /*   85 */ unsigned char ANGLE_vulkan_image;
        /*   86 */ unsigned char ANGLE_yuv_internal_format;
        /*   87 */ unsigned char APPLE_aux_depth_stencil;
        /*   88 */ unsigned char APPLE_client_storage;
        /*   89 */ unsigned char APPLE_clip_distance;
        /*   90 */ unsigned char APPLE_color_buffer_packed_float;
        /*   91 */ unsigned char APPLE_copy_texture_levels;
        /*   92 */ unsigned char APPLE_element_array;
        /*   93 */ unsigned char APPLE_fence;
        /*   94 */ unsigned char APPLE_float_pixels;
        /*   95 */ unsigned char APPLE_flush_buffer_range;
        /*   96 */ unsigned char APPLE_framebuffer_multisample;
        /*   97 */ unsigned char APPLE_object_purgeable;
        /*   98 */ unsigned char APPLE_rgb_422;
        /*   99 */ unsigned char APPLE_row_bytes;
        /*  100 */ unsigned char APPLE_specular_vector;
        /*  101 */ unsigned char APPLE_sync;
        /*  102 */ unsigned char APPLE_texture_format_BGRA8888;
        /*  103 */ unsigned char APPLE_texture_max_level;
        /*  104 */ unsigned char APPLE_texture_packed_float;
        /*  105 */ unsigned char APPLE_texture_range;
        /*  106 */ unsigned char APPLE_transform_hint;
        /*  107 */ unsigned char APPLE_vertex_array_object;
        /*  108 */ unsigned char APPLE_vertex_array_range;
        /*  109 */ unsigned char APPLE_vertex_program_evaluators;
        /*  110 */ unsigned char APPLE_ycbcr_422;
        /*  111 */ unsigned char ARB_ES2_compatibility;
        /*  112 */ unsigned char ARB_ES3_1_compatibility;
        /*  113 */ unsigned char ARB_ES3_2_compatibility;
        /*  114 */ unsigned char ARB_ES3_compatibility;
        /*  115 */ unsigned char ARB_arrays_of_arrays;
        /*  116 */ unsigned char ARB_base_instance;
        /*  117 */ unsigned char ARB_bindless_texture;
        /*  118 */ unsigned char ARB_blend_func_extended;
        /*  119 */ unsigned char ARB_buffer_storage;
        /*  120 */ unsigned char ARB_cl_event;
        /*  121 */ unsigned char ARB_clear_buffer_object;
        /*  122 */ unsigned char ARB_clear_texture;
        /*  123 */ unsigned char ARB_clip_control;
        /*  124 */ unsigned char ARB_color_buffer_float;
        /*  125 */ unsigned char ARB_compatibility;
        /*  126 */ unsigned char ARB_compressed_texture_pixel_storage;
        /*  127 */ unsigned char ARB_compute_shader;
        /*  128 */ unsigned char ARB_compute_variable_group_size;
        /*  129 */ unsigned char ARB_conditional_render_inverted;
        /*  130 */ unsigned char ARB_conservative_depth;
        /*  131 */ unsigned char ARB_copy_buffer;
        /*  132 */ unsigned char ARB_copy_image;
        /*  133 */ unsigned char ARB_cull_distance;
        /*  134 */ unsigned char ARB_debug_output;
        /*  135 */ unsigned char ARB_depth_buffer_float;
        /*  136 */ unsigned char ARB_depth_clamp;
        /*  137 */ unsigned char ARB_depth_texture;
        /*  138 */ unsigned char ARB_derivative_control;
        /*  139 */ unsigned char ARB_direct_state_access;
        /*  140 */ unsigned char ARB_draw_buffers;
        /*  141 */ unsigned char ARB_draw_buffers_blend;
        /*  142 */ unsigned char ARB_draw_elements_base_vertex;
        /*  143 */ unsigned char ARB_draw_indirect;
        /*  144 */ unsigned char ARB_draw_instanced;
        /*  145 */ unsigned char ARB_enhanced_layouts;
        /*  146 */ unsigned char ARB_explicit_attrib_location;
        /*  147 */ unsigned char ARB_explicit_uniform_location;
        /*  148 */ unsigned char ARB_fragment_coord_conventions;
        /*  149 */ unsigned char ARB_fragment_layer_viewport;
        /*  150 */ unsigned char ARB_fragment_program;
        /*  151 */ unsigned char ARB_fragment_program_shadow;
        /*  152 */ unsigned char ARB_fragment_shader;
        /*  153 */ unsigned char ARB_fragment_shader_interlock;
        /*  154 */ unsigned char ARB_framebuffer_no_attachments;
        /*  155 */ unsigned char ARB_framebuffer_object;
        /*  156 */ unsigned char ARB_framebuffer_sRGB;
        /*  157 */ unsigned char ARB_geometry_shader4;
        /*  158 */ unsigned char ARB_get_program_binary;
        /*  159 */ unsigned char ARB_get_texture_sub_image;
        /*  160 */ unsigned char ARB_gl_spirv;
        /*  161 */ unsigned char ARB_gpu_shader5;
        /*  162 */ unsigned char ARB_gpu_shader_fp64;
        /*  163 */ unsigned char ARB_gpu_shader_int64;
        /*  164 */ unsigned char ARB_half_float_pixel;
        /*  165 */ unsigned char ARB_half_float_vertex;
        /*  166 */ unsigned char ARB_imaging;
        /*  167 */ unsigned char ARB_indirect_parameters;
        /*  168 */ unsigned char ARB_instanced_arrays;
        /*  169 */ unsigned char ARB_internalformat_query;
        /*  170 */ unsigned char ARB_internalformat_query2;
        /*  171 */ unsigned char ARB_invalidate_subdata;
        /*  172 */ unsigned char ARB_map_buffer_alignment;
        /*  173 */ unsigned char ARB_map_buffer_range;
        /*  174 */ unsigned char ARB_matrix_palette;
        /*  175 */ unsigned char ARB_multi_bind;
        /*  176 */ unsigned char ARB_multi_draw_indirect;
        /*  177 */ unsigned char ARB_multisample;
        /*  178 */ unsigned char ARB_multitexture;
        /*  179 */ unsigned char ARB_occlusion_query;
        /*  180 */ unsigned char ARB_occlusion_query2;
        /*  181 */ unsigned char ARB_parallel_shader_compile;
        /*  182 */ unsigned char ARB_pipeline_statistics_query;
        /*  183 */ unsigned char ARB_pixel_buffer_object;
        /*  184 */ unsigned char ARB_point_parameters;
        /*  185 */ unsigned char ARB_point_sprite;
        /*  186 */ unsigned char ARB_polygon_offset_clamp;
        /*  187 */ unsigned char ARB_post_depth_coverage;
        /*  188 */ unsigned char ARB_program_interface_query;
        /*  189 */ unsigned char ARB_provoking_vertex;
        /*  190 */ unsigned char ARB_query_buffer_object;
        /*  191 */ unsigned char ARB_robust_buffer_access_behavior;
        /*  192 */ unsigned char ARB_robustness;
        /*  193 */ unsigned char ARB_robustness_isolation;
        /*  194 */ unsigned char ARB_sample_locations;
        /*  195 */ unsigned char ARB_sample_shading;
        /*  196 */ unsigned char ARB_sampler_objects;
        /*  197 */ unsigned char ARB_seamless_cube_map;
        /*  198 */ unsigned char ARB_seamless_cubemap_per_texture;
        /*  199 */ unsigned char ARB_separate_shader_objects;
        /*  200 */ unsigned char ARB_shader_atomic_counter_ops;
        /*  201 */ unsigned char ARB_shader_atomic_counters;
        /*  202 */ unsigned char ARB_shader_ballot;
        /*  203 */ unsigned char ARB_shader_bit_encoding;
        /*  204 */ unsigned char ARB_shader_clock;
        /*  205 */ unsigned char ARB_shader_draw_parameters;
        /*  206 */ unsigned char ARB_shader_group_vote;
        /*  207 */ unsigned char ARB_shader_image_load_store;
        /*  208 */ unsigned char ARB_shader_image_size;
        /*  209 */ unsigned char ARB_shader_objects;
        /*  210 */ unsigned char ARB_shader_precision;
        /*  211 */ unsigned char ARB_shader_stencil_export;
        /*  212 */ unsigned char ARB_shader_storage_buffer_object;
        /*  213 */ unsigned char ARB_shader_subroutine;
        /*  214 */ unsigned char ARB_shader_texture_image_samples;
        /*  215 */ unsigned char ARB_shader_texture_lod;
        /*  216 */ unsigned char ARB_shader_viewport_layer_array;
        /*  217 */ unsigned char ARB_shading_language_100;
        /*  218 */ unsigned char ARB_shading_language_420pack;
        /*  219 */ unsigned char ARB_shading_language_include;
        /*  220 */ unsigned char ARB_shading_language_packing;
        /*  221 */ unsigned char ARB_shadow;
        /*  222 */ unsigned char ARB_shadow_ambient;
        /*  223 */ unsigned char ARB_sparse_buffer;
        /*  224 */ unsigned char ARB_sparse_texture;
        /*  225 */ unsigned char ARB_sparse_texture2;
        /*  226 */ unsigned char ARB_sparse_texture_clamp;
        /*  227 */ unsigned char ARB_spirv_extensions;
        /*  228 */ unsigned char ARB_stencil_texturing;
        /*  229 */ unsigned char ARB_sync;
        /*  230 */ unsigned char ARB_tessellation_shader;
        /*  231 */ unsigned char ARB_texture_barrier;
        /*  232 */ unsigned char ARB_texture_border_clamp;
        /*  233 */ unsigned char ARB_texture_buffer_object;
        /*  234 */ unsigned char ARB_texture_buffer_object_rgb32;
        /*  235 */ unsigned char ARB_texture_buffer_range;
        /*  236 */ unsigned char ARB_texture_compression;
        /*  237 */ unsigned char ARB_texture_compression_bptc;
        /*  238 */ unsigned char ARB_texture_compression_rgtc;
        /*  239 */ unsigned char ARB_texture_cube_map;
        /*  240 */ unsigned char ARB_texture_cube_map_array;
        /*  241 */ unsigned char ARB_texture_env_add;
        /*  242 */ unsigned char ARB_texture_env_combine;
        /*  243 */ unsigned char ARB_texture_env_crossbar;
        /*  244 */ unsigned char ARB_texture_env_dot3;
        /*  245 */ unsigned char ARB_texture_filter_anisotropic;
        /*  246 */ unsigned char ARB_texture_filter_minmax;
        /*  247 */ unsigned char ARB_texture_float;
        /*  248 */ unsigned char ARB_texture_gather;
        /*  249 */ unsigned char ARB_texture_mirror_clamp_to_edge;
        /*  250 */ unsigned char ARB_texture_mirrored_repeat;
        /*  251 */ unsigned char ARB_texture_multisample;
        /*  252 */ unsigned char ARB_texture_non_power_of_two;
        /*  253 */ unsigned char ARB_texture_query_levels;
        /*  254 */ unsigned char ARB_texture_query_lod;
        /*  255 */ unsigned char ARB_texture_rectangle;
        /*  256 */ unsigned char ARB_texture_rg;
        /*  257 */ unsigned char ARB_texture_rgb10_a2ui;
        /*  258 */ unsigned char ARB_texture_stencil8;
        /*  259 */ unsigned char ARB_texture_storage;
        /*  260 */ unsigned char ARB_texture_storage_multisample;
        /*  261 */ unsigned char ARB_texture_swizzle;
        /*  262 */ unsigned char ARB_texture_view;
        /*  263 */ unsigned char ARB_timer_query;
        /*  264 */ unsigned char ARB_transform_feedback2;
        /*  265 */ unsigned char ARB_transform_feedback3;
        /*  266 */ unsigned char ARB_transform_feedback_instanced;
        /*  267 */ unsigned char ARB_transform_feedback_overflow_query;
        /*  268 */ unsigned char ARB_transpose_matrix;
        /*  269 */ unsigned char ARB_uniform_buffer_object;
        /*  270 */ unsigned char ARB_vertex_array_bgra;
        /*  271 */ unsigned char ARB_vertex_array_object;
        /*  272 */ unsigned char ARB_vertex_attrib_64bit;
        /*  273 */ unsigned char ARB_vertex_attrib_binding;
        /*  274 */ unsigned char ARB_vertex_blend;
        /*  275 */ unsigned char ARB_vertex_buffer_object;
        /*  276 */ unsigned char ARB_vertex_program;
        /*  277 */ unsigned char ARB_vertex_shader;
        /*  278 */ unsigned char ARB_vertex_type_10f_11f_11f_rev;
        /*  279 */ unsigned char ARB_vertex_type_2_10_10_10_rev;
        /*  280 */ unsigned char ARB_viewport_array;
        /*  281 */ unsigned char ARB_window_pos;
        /*  282 */ unsigned char ARM_cooperative_matrix_layouts;
        /*  283 */ unsigned char ARM_mali_program_binary;
        /*  284 */ unsigned char ARM_mali_shader_binary;
        /*  285 */ unsigned char ARM_rgba8;
        /*  286 */ unsigned char ARM_shader_core_builtins;
        /*  287 */ unsigned char ARM_shader_core_properties;
        /*  288 */ unsigned char ARM_shader_framebuffer_fetch;
        /*  289 */ unsigned char ARM_shader_framebuffer_fetch_depth_stencil;
        /*  290 */ unsigned char ARM_texture_unnormalized_coordinates;
        /*  291 */ unsigned char ATI_draw_buffers;
        /*  292 */ unsigned char ATI_element_array;
        /*  293 */ unsigned char ATI_envmap_bumpmap;
        /*  294 */ unsigned char ATI_fragment_shader;
        /*  295 */ unsigned char ATI_map_object_buffer;
        /*  296 */ unsigned char ATI_meminfo;
        /*  297 */ unsigned char ATI_pixel_format_float;
        /*  298 */ unsigned char ATI_pn_triangles;
        /*  299 */ unsigned char ATI_separate_stencil;
        /*  300 */ unsigned char ATI_text_fragment_shader;
        /*  301 */ unsigned char ATI_texture_env_combine3;
        /*  302 */ unsigned char ATI_texture_float;
        /*  303 */ unsigned char ATI_texture_mirror_once;
        /*  304 */ unsigned char ATI_vertex_array_object;
        /*  305 */ unsigned char ATI_vertex_attrib_array_object;
        /*  306 */ unsigned char ATI_vertex_streams;
        /*  307 */ unsigned char CHROMIUM_bind_uniform_location;
        /*  308 */ unsigned char CHROMIUM_copy_compressed_texture;
        /*  309 */ unsigned char CHROMIUM_copy_texture;
        /*  310 */ unsigned char CHROMIUM_framebuffer_mixed_samples;
        /*  311 */ unsigned char CHROMIUM_lose_context;
        /*  312 */ unsigned char DMP_program_binary;
        /*  313 */ unsigned char DMP_shader_binary;
        /*  314 */ unsigned char EXT_422_pixels;
        /*  315 */ unsigned char EXT_EGL_image_array;
        /*  316 */ unsigned char EXT_EGL_image_storage;
        /*  317 */ unsigned char EXT_EGL_image_storage_compression;
        /*  318 */ unsigned char EXT_EGL_sync;
        /*  319 */ unsigned char EXT_YUV_target;
        /*  320 */ unsigned char EXT_abgr;
        /*  321 */ unsigned char EXT_base_instance;
        /*  322 */ unsigned char EXT_bfloat16;
        /*  323 */ unsigned char EXT_bgra;
        /*  324 */ unsigned char EXT_bindable_uniform;
        /*  325 */ unsigned char EXT_blend_color;
        /*  326 */ unsigned char EXT_blend_equation_separate;
        /*  327 */ unsigned char EXT_blend_func_extended;
        /*  328 */ unsigned char EXT_blend_func_separate;
        /*  329 */ unsigned char EXT_blend_logic_op;
        /*  330 */ unsigned char EXT_blend_minmax;
        /*  331 */ unsigned char EXT_blend_subtract;
        /*  332 */ unsigned char EXT_buffer_reference;
        /*  333 */ unsigned char EXT_buffer_reference2;
        /*  334 */ unsigned char EXT_buffer_reference_uvec2;
        /*  335 */ unsigned char EXT_buffer_storage;
        /*  336 */ unsigned char EXT_clear_texture;
        /*  337 */ unsigned char EXT_clip_control;
        /*  338 */ unsigned char EXT_clip_cull_distance;
        /*  339 */ unsigned char EXT_clip_volume_hint;
        /*  340 */ unsigned char EXT_cmyka;
        /*  341 */ unsigned char EXT_color_buffer_float;
        /*  342 */ unsigned char EXT_color_buffer_half_float;
        /*  343 */ unsigned char EXT_color_subtable;
        /*  344 */ unsigned char EXT_compiled_vertex_array;
        /*  345 */ unsigned char EXT_conservative_depth;
        /*  346 */ unsigned char EXT_control_flow_attributes;
        /*  347 */ unsigned char EXT_control_flow_attributes2;
        /*  348 */ unsigned char EXT_convolution;
        /*  349 */ unsigned char EXT_coordinate_frame;
        /*  350 */ unsigned char EXT_copy_image;
        /*  351 */ unsigned char EXT_copy_texture;
        /*  352 */ unsigned char EXT_cull_vertex;
        /*  353 */ unsigned char EXT_debug_label;
        /*  354 */ unsigned char EXT_debug_marker;
        /*  355 */ unsigned char EXT_debug_printf;
        /*  356 */ unsigned char EXT_demote_to_helper_invocation;
        /*  357 */ unsigned char EXT_depth_bounds_test;
        /*  358 */ unsigned char EXT_depth_clamp;
        /*  359 */ unsigned char EXT_device_group;
        /*  360 */ unsigned char EXT_direct_state_access;
        /*  361 */ unsigned char EXT_discard_framebuffer;
        /*  362 */ unsigned char EXT_disjoint_timer_query;
        /*  363 */ unsigned char EXT_draw_buffers;
        /*  364 */ unsigned char EXT_draw_buffers2;
        /*  365 */ unsigned char EXT_draw_buffers_indexed;
        /*  366 */ unsigned char EXT_draw_elements_base_vertex;
        /*  367 */ unsigned char EXT_draw_instanced;
        /*  368 */ unsigned char EXT_draw_range_elements;
        /*  369 */ unsigned char EXT_draw_transform_feedback;
        /*  370 */ unsigned char EXT_expect_assume;
        /*  371 */ unsigned char EXT_external_buffer;
        /*  372 */ unsigned char EXT_float8_e5m2_e4m3;
        /*  373 */ unsigned char EXT_float_blend;
        /*  374 */ unsigned char EXT_fog_coord;
        /*  375 */ unsigned char EXT_fragment_invocation_density;
        /*  376 */ unsigned char EXT_fragment_shader_barycentric;
        /*  377 */ unsigned char EXT_fragment_shading_rate;
        /*  378 */ unsigned char EXT_framebuffer_blit;
        /*  379 */ unsigned char EXT_framebuffer_blit_layers;
        /*  380 */ unsigned char EXT_framebuffer_multisample;
        /*  381 */ unsigned char EXT_framebuffer_multisample_blit_scaled;
        /*  382 */ unsigned char EXT_framebuffer_object;
        /*  383 */ unsigned char EXT_framebuffer_sRGB;
        /*  384 */ unsigned char EXT_geometry_point_size;
        /*  385 */ unsigned char EXT_geometry_shader;
        /*  386 */ unsigned char EXT_geometry_shader4;
        /*  387 */ unsigned char EXT_gpu_program_parameters;
        /*  388 */ unsigned char EXT_gpu_shader4;
        /*  389 */ unsigned char EXT_gpu_shader5;
        /*  390 */ unsigned char EXT_histogram;
        /*  391 */ unsigned char EXT_index_array_formats;
        /*  392 */ unsigned char EXT_index_func;
        /*  393 */ unsigned char EXT_index_material;
        /*  394 */ unsigned char EXT_index_texture;
        /*  395 */ unsigned char EXT_instanced_arrays;
        /*  396 */ unsigned char EXT_integer_dot_product;
        /*  397 */ unsigned char EXT_light_texture;
        /*  398 */ unsigned char EXT_map_buffer_range;
        /*  399 */ unsigned char EXT_maximal_reconvergence;
        /*  400 */ unsigned char EXT_memory_object;
        /*  401 */ unsigned char EXT_memory_object_fd;
        /*  402 */ unsigned char EXT_memory_object_win32;
        /*  403 */ unsigned char EXT_mesh_shader;
        /*  404 */ unsigned char EXT_misc_attribute;
        /*  405 */ unsigned char EXT_multi_draw_arrays;
        /*  406 */ unsigned char EXT_multi_draw_indirect;
        /*  407 */ unsigned char EXT_multisample;
        /*  408 */ unsigned char EXT_multisampled_compatibility;
        /*  409 */ unsigned char EXT_multisampled_render_to_texture;
        /*  410 */ unsigned char EXT_multisampled_render_to_texture2;
        /*  411 */ unsigned char EXT_multiview_draw_buffers;
        /*  412 */ unsigned char EXT_multiview_tessellation_geometry_shader;
        /*  413 */ unsigned char EXT_multiview_texture_multisample;
        /*  414 */ unsigned char EXT_multiview_timer_query;
        /*  415 */ unsigned char EXT_nontemporal_keyword;
        /*  416 */ unsigned char EXT_nonuniform_qualifier;
        /*  417 */ unsigned char EXT_null_initializer;
        /*  418 */ unsigned char EXT_occlusion_query_boolean;
        /*  419 */ unsigned char EXT_opacity_micromap;
        /*  420 */ unsigned char EXT_packed_depth_stencil;
        /*  421 */ unsigned char EXT_packed_float;
        /*  422 */ unsigned char EXT_packed_pixels;
        /*  423 */ unsigned char EXT_paletted_texture;
        /*  424 */ unsigned char EXT_pixel_buffer_object;
        /*  425 */ unsigned char EXT_pixel_transform;
        /*  426 */ unsigned char EXT_pixel_transform_color_table;
        /*  427 */ unsigned char EXT_point_parameters;
        /*  428 */ unsigned char EXT_polygon_offset;
        /*  429 */ unsigned char EXT_polygon_offset_clamp;
        /*  430 */ unsigned char EXT_post_depth_coverage;
        /*  431 */ unsigned char EXT_primitive_bounding_box;
        /*  432 */ unsigned char EXT_protected_textures;
        /*  433 */ unsigned char EXT_provoking_vertex;
        /*  434 */ unsigned char EXT_pvrtc_sRGB;
        /*  435 */ unsigned char EXT_raster_multisample;
        /*  436 */ unsigned char EXT_ray_cull_mask;
        /*  437 */ unsigned char EXT_ray_flags_primitive_culling;
        /*  438 */ unsigned char EXT_ray_query;
        /*  439 */ unsigned char EXT_ray_tracing;
        /*  440 */ unsigned char EXT_ray_tracing_position_fetch;
        /*  441 */ unsigned char EXT_read_format_bgra;
        /*  442 */ unsigned char EXT_render_snorm;
        /*  443 */ unsigned char EXT_rescale_normal;
        /*  444 */ unsigned char EXT_robustness;
        /*  445 */ unsigned char EXT_sRGB;
        /*  446 */ unsigned char EXT_sRGB_write_control;
        /*  447 */ unsigned char EXT_samplerless_texture_functions;
        /*  448 */ unsigned char EXT_scalar_block_layout;
        /*  449 */ unsigned char EXT_secondary_color;
        /*  450 */ unsigned char EXT_semaphore;
        /*  451 */ unsigned char EXT_semaphore_fd;
        /*  452 */ unsigned char EXT_semaphore_win32;
        /*  453 */ unsigned char EXT_separate_depth_stencil;
        /*  454 */ unsigned char EXT_separate_shader_objects;
        /*  455 */ unsigned char EXT_separate_specular_color;
        /*  456 */ unsigned char EXT_shader_16bit_storage;
        /*  457 */ unsigned char EXT_shader_8bit_storage;
        /*  458 */ unsigned char EXT_shader_atomic_float;
        /*  459 */ unsigned char EXT_shader_atomic_float2;
        /*  460 */ unsigned char EXT_shader_atomic_int64;
        /*  461 */ unsigned char EXT_shader_explicit_arithmetic_types;
        /*  462 */ unsigned char EXT_shader_explicit_arithmetic_types_float16;
        /*  463 */ unsigned char EXT_shader_explicit_arithmetic_types_float32;
        /*  464 */ unsigned char EXT_shader_explicit_arithmetic_types_float64;
        /*  465 */ unsigned char EXT_shader_explicit_arithmetic_types_int16;
        /*  466 */ unsigned char EXT_shader_explicit_arithmetic_types_int32;
        /*  467 */ unsigned char EXT_shader_explicit_arithmetic_types_int64;
        /*  468 */ unsigned char EXT_shader_explicit_arithmetic_types_int8;
        /*  469 */ unsigned char EXT_shader_framebuffer_fetch;
        /*  470 */ unsigned char EXT_shader_framebuffer_fetch_non_coherent;
        /*  471 */ unsigned char EXT_shader_group_vote;
        /*  472 */ unsigned char EXT_shader_image_int64;
        /*  473 */ unsigned char EXT_shader_image_load_formatted;
        /*  474 */ unsigned char EXT_shader_image_load_store;
        /*  475 */ unsigned char EXT_shader_implicit_conversions;
        /*  476 */ unsigned char EXT_shader_integer_mix;
        /*  477 */ unsigned char EXT_shader_io_blocks;
        /*  478 */ unsigned char EXT_shader_non_constant_global_initializers;
        /*  479 */ unsigned char EXT_shader_pixel_local_storage;
        /*  480 */ unsigned char EXT_shader_pixel_local_storage2;
        /*  481 */ unsigned char EXT_shader_quad_control;
        /*  482 */ unsigned char EXT_shader_realtime_clock;
        /*  483 */ unsigned char EXT_shader_samples_identical;
        /*  484 */ unsigned char EXT_shader_subgroup_extended_types;
        /*  485 */ unsigned char EXT_shader_subgroup_extended_types_float16;
        /*  486 */ unsigned char EXT_shader_subgroup_extended_types_int16;
        /*  487 */ unsigned char EXT_shader_subgroup_extended_types_int64;
        /*  488 */ unsigned char EXT_shader_subgroup_extended_types_int8;
        /*  489 */ unsigned char EXT_shader_texture_lod;
        /*  490 */ unsigned char EXT_shader_texture_samples;
        /*  491 */ unsigned char EXT_shader_tile_image;
        /*  492 */ unsigned char EXT_shadow_funcs;
        /*  493 */ unsigned char EXT_shadow_samplers;
        /*  494 */ unsigned char EXT_shared_memory_block;
        /*  495 */ unsigned char EXT_shared_texture_palette;
        /*  496 */ unsigned char EXT_sparse_texture;
        /*  497 */ unsigned char EXT_sparse_texture2;
        /*  498 */ unsigned char EXT_spec_constant_composites;
        /*  499 */ unsigned char EXT_spirv_intrinsics;
        /*  500 */ unsigned char EXT_stencil_clear_tag;
        /*  501 */ unsigned char EXT_stencil_two_side;
        /*  502 */ unsigned char EXT_stencil_wrap;
        /*  503 */ unsigned char EXT_subgroup_uniform_control_flow;
        /*  504 */ unsigned char EXT_subgroupuniform_qualifier;
        /*  505 */ unsigned char EXT_subtexture;
        /*  506 */ unsigned char EXT_terminate_invocation;
        /*  507 */ unsigned char EXT_tessellation_point_size;
        /*  508 */ unsigned char EXT_tessellation_shader;
        /*  509 */ unsigned char EXT_texture;
        /*  510 */ unsigned char EXT_texture3D;
        /*  511 */ unsigned char EXT_texture_array;
        /*  512 */ unsigned char EXT_texture_border_clamp;
        /*  513 */ unsigned char EXT_texture_buffer;
        /*  514 */ unsigned char EXT_texture_buffer_object;
        /*  515 */ unsigned char EXT_texture_compression_astc_decode_mode;
        /*  516 */ unsigned char EXT_texture_compression_bptc;
        /*  517 */ unsigned char EXT_texture_compression_dxt1;
        /*  518 */ unsigned char EXT_texture_compression_latc;
        /*  519 */ unsigned char EXT_texture_compression_rgtc;
        /*  520 */ unsigned char EXT_texture_compression_s3tc;
        /*  521 */ unsigned char EXT_texture_compression_s3tc_srgb;
        /*  522 */ unsigned char EXT_texture_cube_map;
        /*  523 */ unsigned char EXT_texture_cube_map_array;
        /*  524 */ unsigned char EXT_texture_env_add;
        /*  525 */ unsigned char EXT_texture_env_combine;
        /*  526 */ unsigned char EXT_texture_env_dot3;
        /*  527 */ unsigned char EXT_texture_filter_anisotropic;
        /*  528 */ unsigned char EXT_texture_filter_minmax;
        /*  529 */ unsigned char EXT_texture_format_BGRA8888;
        /*  530 */ unsigned char EXT_texture_format_sRGB_override;
        /*  531 */ unsigned char EXT_texture_integer;
        /*  532 */ unsigned char EXT_texture_lod_bias;
        /*  533 */ unsigned char EXT_texture_mirror_clamp;
        /*  534 */ unsigned char EXT_texture_mirror_clamp_to_edge;
        /*  535 */ unsigned char EXT_texture_norm16;
        /*  536 */ unsigned char EXT_texture_object;
        /*  537 */ unsigned char EXT_texture_offset_non_const;
        /*  538 */ unsigned char EXT_texture_perturb_normal;
        /*  539 */ unsigned char EXT_texture_query_lod;
        /*  540 */ unsigned char EXT_texture_rg;
        /*  541 */ unsigned char EXT_texture_sRGB;
        /*  542 */ unsigned char EXT_texture_sRGB_R8;
        /*  543 */ unsigned char EXT_texture_sRGB_RG8;
        /*  544 */ unsigned char EXT_texture_sRGB_decode;
        /*  545 */ unsigned char EXT_texture_shadow_lod;
        /*  546 */ unsigned char EXT_texture_shared_exponent;
        /*  547 */ unsigned char EXT_texture_snorm;
        /*  548 */ unsigned char EXT_texture_storage;
        /*  549 */ unsigned char EXT_texture_storage_compression;
        /*  550 */ unsigned char EXT_texture_swizzle;
        /*  551 */ unsigned char EXT_texture_type_2_10_10_10_REV;
        /*  552 */ unsigned char EXT_texture_view;
        /*  553 */ unsigned char EXT_timer_query;
        /*  554 */ unsigned char EXT_transform_feedback;
        /*  555 */ unsigned char EXT_unpack_subimage;
        /*  556 */ unsigned char EXT_vertex_array;
        /*  557 */ unsigned char EXT_vertex_array_bgra;
        /*  558 */ unsigned char EXT_vertex_attrib_64bit;
        /*  559 */ unsigned char EXT_vertex_shader;
        /*  560 */ unsigned char EXT_vertex_weighting;
        /*  561 */ unsigned char EXT_vulkan_glsl_relaxed;
        /*  562 */ unsigned char EXT_win32_keyed_mutex;
        /*  563 */ unsigned char EXT_window_rectangles;
        /*  564 */ unsigned char EXT_x11_sync_object;
        /*  565 */ unsigned char FJ_shader_binary_GCCSO;
        /*  566 */ unsigned char GREMEDY_frame_terminator;
        /*  567 */ unsigned char GREMEDY_string_marker;
        /*  568 */ unsigned char HP_convolution_border_modes;
        /*  569 */ unsigned char HP_image_transform;
        /*  570 */ unsigned char HP_occlusion_test;
        /*  571 */ unsigned char HP_texture_lighting;
        /*  572 */ unsigned char HUAWEI_cluster_culling_shader;
        /*  573 */ unsigned char HUAWEI_program_binary;
        /*  574 */ unsigned char HUAWEI_shader_binary;
        /*  575 */ unsigned char HUAWEI_subpass_shading;
        /*  576 */ unsigned char IBM_cull_vertex;
        /*  577 */ unsigned char IBM_multimode_draw_arrays;
        /*  578 */ unsigned char IBM_rasterpos_clip;
        /*  579 */ unsigned char IBM_static_data;
        /*  580 */ unsigned char IBM_texture_mirrored_repeat;
        /*  581 */ unsigned char IBM_vertex_array_lists;
        /*  582 */ unsigned char IMG_bindless_texture;
        /*  583 */ unsigned char IMG_framebuffer_downsample;
        /*  584 */ unsigned char IMG_multisampled_render_to_texture;
        /*  585 */ unsigned char IMG_program_binary;
        /*  586 */ unsigned char IMG_read_format;
        /*  587 */ unsigned char IMG_shader_binary;
        /*  588 */ unsigned char IMG_texture_compression_pvrtc;
        /*  589 */ unsigned char IMG_texture_compression_pvrtc2;
        /*  590 */ unsigned char IMG_texture_filter_cubic;
        /*  591 */ unsigned char INGR_blend_func_separate;
        /*  592 */ unsigned char INGR_color_clamp;
        /*  593 */ unsigned char INGR_interlace_read;
        /*  594 */ unsigned char INTEL_blackhole_render;
        /*  595 */ unsigned char INTEL_conservative_rasterization;
        /*  596 */ unsigned char INTEL_fragment_shader_ordering;
        /*  597 */ unsigned char INTEL_framebuffer_CMAA;
        /*  598 */ unsigned char INTEL_map_texture;
        /*  599 */ unsigned char INTEL_parallel_arrays;
        /*  600 */ unsigned char INTEL_performance_query;
        /*  601 */ unsigned char KHR_blend_equation_advanced;
        /*  602 */ unsigned char KHR_blend_equation_advanced_coherent;
        /*  603 */ unsigned char KHR_context_flush_control;
        /*  604 */ unsigned char KHR_cooperative_matrix;
        /*  605 */ unsigned char KHR_debug;
        /*  606 */ unsigned char KHR_memory_scope_semantics;
        /*  607 */ unsigned char KHR_no_error;
        /*  608 */ unsigned char KHR_parallel_shader_compile;
        /*  609 */ unsigned char KHR_robust_buffer_access_behavior;
        /*  610 */ unsigned char KHR_robustness;
        /*  611 */ unsigned char KHR_shader_subgroup;
        /*  612 */ unsigned char KHR_shader_subgroup_arithmetic;
        /*  613 */ unsigned char KHR_shader_subgroup_ballot;
        /*  614 */ unsigned char KHR_shader_subgroup_basic;
        /*  615 */ unsigned char KHR_shader_subgroup_clustered;
        /*  616 */ unsigned char KHR_shader_subgroup_quad;
        /*  617 */ unsigned char KHR_shader_subgroup_rotate;
        /*  618 */ unsigned char KHR_shader_subgroup_shuffle;
        /*  619 */ unsigned char KHR_shader_subgroup_shuffle_relative;
        /*  620 */ unsigned char KHR_shader_subgroup_vote;
        /*  621 */ unsigned char KHR_texture_compression_astc_hdr;
        /*  622 */ unsigned char KHR_texture_compression_astc_ldr;
        /*  623 */ unsigned char KHR_texture_compression_astc_sliced_3d;
        /*  624 */ unsigned char KHR_vulkan_glsl;
        /*  625 */ unsigned char MESAX_texture_stack;
        /*  626 */ unsigned char MESA_bgra;
        /*  627 */ unsigned char MESA_framebuffer_flip_x;
        /*  628 */ unsigned char MESA_framebuffer_flip_y;
        /*  629 */ unsigned char MESA_framebuffer_swap_xy;
        /*  630 */ unsigned char MESA_map_buffer_client_pointer;
        /*  631 */ unsigned char MESA_pack_invert;
        /*  632 */ unsigned char MESA_program_binary_formats;
        /*  633 */ unsigned char MESA_resize_buffers;
        /*  634 */ unsigned char MESA_sampler_objects;
        /*  635 */ unsigned char MESA_shader_integer_functions;
        /*  636 */ unsigned char MESA_texture_const_bandwidth;
        /*  637 */ unsigned char MESA_tile_raster_order;
        /*  638 */ unsigned char MESA_window_pos;
        /*  639 */ unsigned char MESA_ycbcr_texture;
        /*  640 */ unsigned char NVX_blend_equation_advanced_multi_draw_buffers;
        /*  641 */ unsigned char NVX_conditional_render;
        /*  642 */ unsigned char NVX_gpu_memory_info;
        /*  643 */ unsigned char NVX_gpu_multicast2;
        /*  644 */ unsigned char NVX_linked_gpu_multicast;
        /*  645 */ unsigned char NVX_multiview_per_view_attributes;
        /*  646 */ unsigned char NVX_progress_fence;
        /*  647 */ unsigned char NV_alpha_to_coverage_dither_control;
        /*  648 */ unsigned char NV_bindless_multi_draw_indirect;
        /*  649 */ unsigned char NV_bindless_multi_draw_indirect_count;
        /*  650 */ unsigned char NV_bindless_texture;
        /*  651 */ unsigned char NV_blend_equation_advanced;
        /*  652 */ unsigned char NV_blend_equation_advanced_coherent;
        /*  653 */ unsigned char NV_blend_minmax_factor;
        /*  654 */ unsigned char NV_blend_square;
        /*  655 */ unsigned char NV_clip_space_w_scaling;
        /*  656 */ unsigned char NV_cluster_acceleration_structure;
        /*  657 */ unsigned char NV_command_list;
        /*  658 */ unsigned char NV_compute_program5;
        /*  659 */ unsigned char NV_compute_shader_derivatives;
        /*  660 */ unsigned char NV_conditional_render;
        /*  661 */ unsigned char NV_conservative_raster;
        /*  662 */ unsigned char NV_conservative_raster_dilate;
        /*  663 */ unsigned char NV_conservative_raster_pre_snap;
        /*  664 */ unsigned char NV_conservative_raster_pre_snap_triangles;
        /*  665 */ unsigned char NV_conservative_raster_underestimation;
        /*  666 */ unsigned char NV_cooperative_matrix;
        /*  667 */ unsigned char NV_cooperative_matrix2;
        /*  668 */ unsigned char NV_cooperative_vector;
        /*  669 */ unsigned char NV_copy_buffer;
        /*  670 */ unsigned char NV_copy_depth_to_color;
        /*  671 */ unsigned char NV_copy_image;
        /*  672 */ unsigned char NV_coverage_sample;
        /*  673 */ unsigned char NV_deep_texture3D;
        /*  674 */ unsigned char NV_depth_buffer_float;
        /*  675 */ unsigned char NV_depth_clamp;
        /*  676 */ unsigned char NV_depth_nonlinear;
        /*  677 */ unsigned char NV_displacement_micromap;
        /*  678 */ unsigned char NV_draw_buffers;
        /*  679 */ unsigned char NV_draw_instanced;
        /*  680 */ unsigned char NV_draw_texture;
        /*  681 */ unsigned char NV_draw_vulkan_image;
        /*  682 */ unsigned char NV_evaluators;
        /*  683 */ unsigned char NV_explicit_attrib_location;
        /*  684 */ unsigned char NV_explicit_multisample;
        /*  685 */ unsigned char NV_fbo_color_attachments;
        /*  686 */ unsigned char NV_fence;
        /*  687 */ unsigned char NV_fill_rectangle;
        /*  688 */ unsigned char NV_float_buffer;
        /*  689 */ unsigned char NV_fog_distance;
        /*  690 */ unsigned char NV_fragment_coverage_to_color;
        /*  691 */ unsigned char NV_fragment_program;
        /*  692 */ unsigned char NV_fragment_program2;
        /*  693 */ unsigned char NV_fragment_program4;
        /*  694 */ unsigned char NV_fragment_program_option;
        /*  695 */ unsigned char NV_fragment_shader_barycentric;
        /*  696 */ unsigned char NV_fragment_shader_interlock;
        /*  697 */ unsigned char NV_framebuffer_blit;
        /*  698 */ unsigned char NV_framebuffer_mixed_samples;
        /*  699 */ unsigned char NV_framebuffer_multisample;
        /*  700 */ unsigned char NV_framebuffer_multisample_coverage;
        /*  701 */ unsigned char NV_generate_mipmap_sRGB;
        /*  702 */ unsigned char NV_geometry_program4;
        /*  703 */ unsigned char NV_geometry_shader4;
        /*  704 */ unsigned char NV_geometry_shader_passthrough;
        /*  705 */ unsigned char NV_gpu_multicast;
        /*  706 */ unsigned char NV_gpu_program4;
        /*  707 */ unsigned char NV_gpu_program5;
        /*  708 */ unsigned char NV_gpu_program5_mem_extended;
        /*  709 */ unsigned char NV_gpu_shader5;
        /*  710 */ unsigned char NV_half_float;
        /*  711 */ unsigned char NV_image_formats;
        /*  712 */ unsigned char NV_instanced_arrays;
        /*  713 */ unsigned char NV_integer_cooperative_matrix;
        /*  714 */ unsigned char NV_internalformat_sample_query;
        /*  715 */ unsigned char NV_light_max_exponent;
        /*  716 */ unsigned char NV_linear_swept_spheres;
        /*  717 */ unsigned char NV_memory_attachment;
        /*  718 */ unsigned char NV_memory_object_sparse;
        /*  719 */ unsigned char NV_mesh_shader;
        /*  720 */ unsigned char NV_multisample_coverage;
        /*  721 */ unsigned char NV_multisample_filter_hint;
        /*  722 */ unsigned char NV_non_square_matrices;
        /*  723 */ unsigned char NV_occlusion_query;
        /*  724 */ unsigned char NV_pack_subimage;
        /*  725 */ unsigned char NV_packed_depth_stencil;
        /*  726 */ unsigned char NV_parameter_buffer_object;
        /*  727 */ unsigned char NV_parameter_buffer_object2;
        /*  728 */ unsigned char NV_path_rendering;
        /*  729 */ unsigned char NV_path_rendering_shared_edge;
        /*  730 */ unsigned char NV_pixel_buffer_object;
        /*  731 */ unsigned char NV_pixel_data_range;
        /*  732 */ unsigned char NV_point_sprite;
        /*  733 */ unsigned char NV_polygon_mode;
        /*  734 */ unsigned char NV_present_video;
        /*  735 */ unsigned char NV_primitive_restart;
        /*  736 */ unsigned char NV_primitive_shading_rate;
        /*  737 */ unsigned char NV_query_resource;
        /*  738 */ unsigned char NV_query_resource_tag;
        /*  739 */ unsigned char NV_ray_tracing;
        /*  740 */ unsigned char NV_ray_tracing_motion_blur;
        /*  741 */ unsigned char NV_read_buffer;
        /*  742 */ unsigned char NV_read_buffer_front;
        /*  743 */ unsigned char NV_read_depth;
        /*  744 */ unsigned char NV_read_depth_stencil;
        /*  745 */ unsigned char NV_read_stencil;
        /*  746 */ unsigned char NV_register_combiners;
        /*  747 */ unsigned char NV_register_combiners2;
        /*  748 */ unsigned char NV_representative_fragment_test;
        /*  749 */ unsigned char NV_robustness_video_memory_purge;
        /*  750 */ unsigned char NV_sRGB_formats;
        /*  751 */ unsigned char NV_sample_locations;
        /*  752 */ unsigned char NV_sample_mask_override_coverage;
        /*  753 */ unsigned char NV_scissor_exclusive;
        /*  754 */ unsigned char NV_shader_atomic_counters;
        /*  755 */ unsigned char NV_shader_atomic_float;
        /*  756 */ unsigned char NV_shader_atomic_float64;
        /*  757 */ unsigned char NV_shader_atomic_fp16_vector;
        /*  758 */ unsigned char NV_shader_atomic_int64;
        /*  759 */ unsigned char NV_shader_buffer_load;
        /*  760 */ unsigned char NV_shader_buffer_store;
        /*  761 */ unsigned char NV_shader_invocation_reorder;
        /*  762 */ unsigned char NV_shader_noperspective_interpolation;
        /*  763 */ unsigned char NV_shader_sm_builtins;
        /*  764 */ unsigned char NV_shader_storage_buffer_object;
        /*  765 */ unsigned char NV_shader_subgroup_partitioned;
        /*  766 */ unsigned char NV_shader_texture_footprint;
        /*  767 */ unsigned char NV_shader_thread_group;
        /*  768 */ unsigned char NV_shader_thread_shuffle;
        /*  769 */ unsigned char NV_shading_rate_image;
        /*  770 */ unsigned char NV_shadow_samplers_array;
        /*  771 */ unsigned char NV_shadow_samplers_cube;
        /*  772 */ unsigned char NV_stereo_view_rendering;
        /*  773 */ unsigned char NV_tessellation_program5;
        /*  774 */ unsigned char NV_texgen_emboss;
        /*  775 */ unsigned char NV_texgen_reflection;
        /*  776 */ unsigned char NV_texture_barrier;
        /*  777 */ unsigned char NV_texture_border_clamp;
        /*  778 */ unsigned char NV_texture_compression_s3tc_update;
        /*  779 */ unsigned char NV_texture_compression_vtc;
        /*  780 */ unsigned char NV_texture_env_combine4;
        /*  781 */ unsigned char NV_texture_expand_normal;
        /*  782 */ unsigned char NV_texture_multisample;
        /*  783 */ unsigned char NV_texture_npot_2D_mipmap;
        /*  784 */ unsigned char NV_texture_rectangle;
        /*  785 */ unsigned char NV_texture_rectangle_compressed;
        /*  786 */ unsigned char NV_texture_shader;
        /*  787 */ unsigned char NV_texture_shader2;
        /*  788 */ unsigned char NV_texture_shader3;
        /*  789 */ unsigned char NV_timeline_semaphore;
        /*  790 */ unsigned char NV_transform_feedback;
        /*  791 */ unsigned char NV_transform_feedback2;
        /*  792 */ unsigned char NV_uniform_buffer_std430_layout;
        /*  793 */ unsigned char NV_uniform_buffer_unified_memory;
        /*  794 */ unsigned char NV_vdpau_interop;
        /*  795 */ unsigned char NV_vdpau_interop2;
        /*  796 */ unsigned char NV_vertex_array_range;
        /*  797 */ unsigned char NV_vertex_array_range2;
        /*  798 */ unsigned char NV_vertex_attrib_integer_64bit;
        /*  799 */ unsigned char NV_vertex_buffer_unified_memory;
        /*  800 */ unsigned char NV_vertex_program;
        /*  801 */ unsigned char NV_vertex_program1_1;
        /*  802 */ unsigned char NV_vertex_program2;
        /*  803 */ unsigned char NV_vertex_program2_option;
        /*  804 */ unsigned char NV_vertex_program3;
        /*  805 */ unsigned char NV_vertex_program4;
        /*  806 */ unsigned char NV_video_capture;
        /*  807 */ unsigned char NV_viewport_array;
        /*  808 */ unsigned char NV_viewport_array2;
        /*  809 */ unsigned char NV_viewport_swizzle;
        /*  810 */ unsigned char OES_EGL_image;
        /*  811 */ unsigned char OES_EGL_image_external;
        /*  812 */ unsigned char OES_EGL_image_external_essl3;
        /*  813 */ unsigned char OES_byte_coordinates;
        /*  814 */ unsigned char OES_compressed_ETC1_RGB8_sub_texture;
        /*  815 */ unsigned char OES_compressed_ETC1_RGB8_texture;
        /*  816 */ unsigned char OES_compressed_paletted_texture;
        /*  817 */ unsigned char OES_copy_image;
        /*  818 */ unsigned char OES_depth24;
        /*  819 */ unsigned char OES_depth32;
        /*  820 */ unsigned char OES_depth_texture;
        /*  821 */ unsigned char OES_draw_buffers_indexed;
        /*  822 */ unsigned char OES_draw_elements_base_vertex;
        /*  823 */ unsigned char OES_element_index_uint;
        /*  824 */ unsigned char OES_fbo_render_mipmap;
        /*  825 */ unsigned char OES_fixed_point;
        /*  826 */ unsigned char OES_fragment_precision_high;
        /*  827 */ unsigned char OES_geometry_point_size;
        /*  828 */ unsigned char OES_geometry_shader;
        /*  829 */ unsigned char OES_get_program_binary;
        /*  830 */ unsigned char OES_gpu_shader5;
        /*  831 */ unsigned char OES_mapbuffer;
        /*  832 */ unsigned char OES_packed_depth_stencil;
        /*  833 */ unsigned char OES_primitive_bounding_box;
        /*  834 */ unsigned char OES_query_matrix;
        /*  835 */ unsigned char OES_read_format;
        /*  836 */ unsigned char OES_required_internalformat;
        /*  837 */ unsigned char OES_rgb8_rgba8;
        /*  838 */ unsigned char OES_sample_shading;
        /*  839 */ unsigned char OES_sample_variables;
        /*  840 */ unsigned char OES_shader_image_atomic;
        /*  841 */ unsigned char OES_shader_io_blocks;
        /*  842 */ unsigned char OES_shader_multisample_interpolation;
        /*  843 */ unsigned char OES_single_precision;
        /*  844 */ unsigned char OES_standard_derivatives;
        /*  845 */ unsigned char OES_stencil1;
        /*  846 */ unsigned char OES_stencil4;
        /*  847 */ unsigned char OES_surfaceless_context;
        /*  848 */ unsigned char OES_tessellation_point_size;
        /*  849 */ unsigned char OES_tessellation_shader;
        /*  850 */ unsigned char OES_texture_3D;
        /*  851 */ unsigned char OES_texture_border_clamp;
        /*  852 */ unsigned char OES_texture_buffer;
        /*  853 */ unsigned char OES_texture_compression_astc;
        /*  854 */ unsigned char OES_texture_cube_map_array;
        /*  855 */ unsigned char OES_texture_float;
        /*  856 */ unsigned char OES_texture_float_linear;
        /*  857 */ unsigned char OES_texture_half_float;
        /*  858 */ unsigned char OES_texture_half_float_linear;
        /*  859 */ unsigned char OES_texture_npot;
        /*  860 */ unsigned char OES_texture_stencil8;
        /*  861 */ unsigned char OES_texture_storage_multisample_2d_array;
        /*  862 */ unsigned char OES_texture_view;
        /*  863 */ unsigned char OES_vertex_array_object;
        /*  864 */ unsigned char OES_vertex_half_float;
        /*  865 */ unsigned char OES_vertex_type_10_10_10_2;
        /*  866 */ unsigned char OES_viewport_array;
        /*  867 */ unsigned char OML_interlace;
        /*  868 */ unsigned char OML_resample;
        /*  869 */ unsigned char OML_subsample;
        /*  870 */ unsigned char OVR_multiview;
        /*  871 */ unsigned char OVR_multiview2;
        /*  872 */ unsigned char OVR_multiview_multisampled_render_to_texture;
        /*  873 */ unsigned char PGI_misc_hints;
        /*  874 */ unsigned char PGI_vertex_hints;
        /*  875 */ unsigned char QCOM_YUV_texture_gather;
        /*  876 */ unsigned char QCOM_alpha_test;
        /*  877 */ unsigned char QCOM_binning_control;
        /*  878 */ unsigned char QCOM_cooperative_matrix_conversion;
        /*  879 */ unsigned char QCOM_driver_control;
        /*  880 */ unsigned char QCOM_extended_get;
        /*  881 */ unsigned char QCOM_extended_get2;
        /*  882 */ unsigned char QCOM_frame_extrapolation;
        /*  883 */ unsigned char QCOM_framebuffer_foveated;
        /*  884 */ unsigned char QCOM_image_processing;
        /*  885 */ unsigned char QCOM_image_processing2;
        /*  886 */ unsigned char QCOM_motion_estimation;
        /*  887 */ unsigned char QCOM_perfmon_global_mode;
        /*  888 */ unsigned char QCOM_render_sRGB_R8_RG8;
        /*  889 */ unsigned char QCOM_render_shared_exponent;
        /*  890 */ unsigned char QCOM_shader_framebuffer_fetch_noncoherent;
        /*  891 */ unsigned char QCOM_shader_framebuffer_fetch_rate;
        /*  892 */ unsigned char QCOM_shading_rate;
        /*  893 */ unsigned char QCOM_texture_foveated;
        /*  894 */ unsigned char QCOM_texture_foveated2;
        /*  895 */ unsigned char QCOM_texture_foveated_subsampled_layout;
        /*  896 */ unsigned char QCOM_texture_lod_bias;
        /*  897 */ unsigned char QCOM_tile_shading;
        /*  898 */ unsigned char QCOM_tiled_rendering;
        /*  899 */ unsigned char QCOM_writeonly_rendering;
        /*  900 */ unsigned char QCOM_ycbcr_degamma;
        /*  901 */ unsigned char REND_screen_coordinates;
        /*  902 */ unsigned char S3_s3tc;
        /*  903 */ unsigned char SGIS_detail_texture;
        /*  904 */ unsigned char SGIS_fog_function;
        /*  905 */ unsigned char SGIS_generate_mipmap;
        /*  906 */ unsigned char SGIS_multisample;
        /*  907 */ unsigned char SGIS_pixel_texture;
        /*  908 */ unsigned char SGIS_point_line_texgen;
        /*  909 */ unsigned char SGIS_point_parameters;
        /*  910 */ unsigned char SGIS_sharpen_texture;
        /*  911 */ unsigned char SGIS_texture4D;
        /*  912 */ unsigned char SGIS_texture_border_clamp;
        /*  913 */ unsigned char SGIS_texture_color_mask;
        /*  914 */ unsigned char SGIS_texture_edge_clamp;
        /*  915 */ unsigned char SGIS_texture_filter4;
        /*  916 */ unsigned char SGIS_texture_lod;
        /*  917 */ unsigned char SGIS_texture_select;
        /*  918 */ unsigned char SGIX_async;
        /*  919 */ unsigned char SGIX_async_histogram;
        /*  920 */ unsigned char SGIX_async_pixel;
        /*  921 */ unsigned char SGIX_blend_alpha_minmax;
        /*  922 */ unsigned char SGIX_calligraphic_fragment;
        /*  923 */ unsigned char SGIX_clipmap;
        /*  924 */ unsigned char SGIX_convolution_accuracy;
        /*  925 */ unsigned char SGIX_depth_pass_instrument;
        /*  926 */ unsigned char SGIX_depth_texture;
        /*  927 */ unsigned char SGIX_flush_raster;
        /*  928 */ unsigned char SGIX_fog_offset;
        /*  929 */ unsigned char SGIX_fragment_lighting;
        /*  930 */ unsigned char SGIX_framezoom;
        /*  931 */ unsigned char SGIX_igloo_interface;
        /*  932 */ unsigned char SGIX_instruments;
        /*  933 */ unsigned char SGIX_interlace;
        /*  934 */ unsigned char SGIX_ir_instrument1;
        /*  935 */ unsigned char SGIX_list_priority;
        /*  936 */ unsigned char SGIX_pixel_texture;
        /*  937 */ unsigned char SGIX_pixel_tiles;
        /*  938 */ unsigned char SGIX_polynomial_ffd;
        /*  939 */ unsigned char SGIX_reference_plane;
        /*  940 */ unsigned char SGIX_resample;
        /*  941 */ unsigned char SGIX_scalebias_hint;
        /*  942 */ unsigned char SGIX_shadow;
        /*  943 */ unsigned char SGIX_shadow_ambient;
        /*  944 */ unsigned char SGIX_sprite;
        /*  945 */ unsigned char SGIX_subsample;
        /*  946 */ unsigned char SGIX_tag_sample_buffer;
        /*  947 */ unsigned char SGIX_texture_add_env;
        /*  948 */ unsigned char SGIX_texture_coordinate_clamp;
        /*  949 */ unsigned char SGIX_texture_lod_bias;
        /*  950 */ unsigned char SGIX_texture_multi_buffer;
        /*  951 */ unsigned char SGIX_texture_scale_bias;
        /*  952 */ unsigned char SGIX_vertex_preclip;
        /*  953 */ unsigned char SGIX_ycrcb;
        /*  954 */ unsigned char SGIX_ycrcb_subsample;
        /*  955 */ unsigned char SGIX_ycrcba;
        /*  956 */ unsigned char SGI_color_matrix;
        /*  957 */ unsigned char SGI_color_table;
        /*  958 */ unsigned char SGI_texture_color_table;
        /*  959 */ unsigned char SUNX_constant_data;
        /*  960 */ unsigned char SUN_convolution_border_modes;
        /*  961 */ unsigned char SUN_global_alpha;
        /*  962 */ unsigned char SUN_mesh_array;
        /*  963 */ unsigned char SUN_slice_accum;
        /*  964 */ unsigned char SUN_triangle_list;
        /*  965 */ unsigned char SUN_vertex;
        /*  966 */ unsigned char VIV_shader_binary;
        /*  967 */ unsigned char WIN_phong_shading;
        /*  968 */ unsigned char WIN_specular_fog;
        };
    };

    union {
        void *pfnArray[2955];
        struct {
        /*    0 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*    1 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*    2 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*    3 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*    4 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*    5 */ PFNGLLOGICOPPROC LogicOp;
        /*    6 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*    7 */ PFNGLPOINTSIZEPROC PointSize;
        /*    8 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*    9 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*   10 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*   11 */ PFNGLCLEARPROC Clear;
        /*   12 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   13 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   14 */ PFNGLCOLORMASKPROC ColorMask;
        /*   15 */ PFNGLCULLFACEPROC CullFace;
        /*   16 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*   17 */ PFNGLDEPTHMASKPROC DepthMask;
        /*   18 */ PFNGLDISABLEPROC Disable;
        /*   19 */ PFNGLENABLEPROC Enable;
        /*   20 */ PFNGLFINISHPROC Finish;
        /*   21 */ PFNGLFLUSHPROC Flush;
        /*   22 */ PFNGLFRONTFACEPROC FrontFace;
        /*   23 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*   24 */ PFNGLGETERRORPROC GetError;
        /*   25 */ PFNGLGETFLOATVPROC GetFloatv;
        /*   26 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*   27 */ PFNGLGETSTRINGPROC GetString;
        /*   28 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*   29 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*   30 */ PFNGLHINTPROC Hint;
        /*   31 */ PFNGLISENABLEDPROC IsEnabled;
        /*   32 */ PFNGLLINEWIDTHPROC LineWidth;
        /*   33 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*   34 */ PFNGLREADPIXELSPROC ReadPixels;
        /*   35 */ PFNGLSCISSORPROC Scissor;
        /*   36 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*   37 */ PFNGLSTENCILMASKPROC StencilMask;
        /*   38 */ PFNGLSTENCILOPPROC StencilOp;
        /*   39 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*   40 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*   41 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*   42 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*   43 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*   44 */ PFNGLVIEWPORTPROC Viewport;
        /*   45 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*   46 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*   47 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*   48 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*   49 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*   50 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*   51 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   52 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   53 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   54 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*   55 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*   56 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*   57 */ PFNGLGENTEXTURESPROC GenTextures;
        /*   58 */ PFNGLISTEXTUREPROC IsTexture;
        /*   59 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*   60 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*   61 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*   62 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*   63 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*   64 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*   65 */ PFNGLCOMPRESSEDTEXIMAGE1DPROC CompressedTexImage1D;
        /*   66 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC CompressedTexSubImage1D;
        /*   67 */ PFNGLGETCOMPRESSEDTEXIMAGEPROC GetCompressedTexImage;
        /*   68 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*   69 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*   70 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*   71 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*   72 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*   73 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*   74 */ PFNGLMULTIDRAWARRAYSPROC MultiDrawArrays;
        /*   75 */ PFNGLMULTIDRAWELEMENTSPROC MultiDrawElements;
        /*   76 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*   77 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*   78 */ PFNGLPOINTPARAMETERIPROC PointParameteri;
        /*   79 */ PFNGLPOINTPARAMETERIVPROC PointParameteriv;
        /*   80 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*   81 */ PFNGLBLENDCOLORPROC BlendColor;
        /*   82 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*   83 */ PFNGLGETBUFFERSUBDATAPROC GetBufferSubData;
        /*   84 */ PFNGLGETQUERYOBJECTIVPROC GetQueryObjectiv;
        /*   85 */ PFNGLMAPBUFFERPROC MapBuffer;
        /*   86 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*   87 */ PFNGLBUFFERDATAPROC BufferData;
        /*   88 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*   89 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*   90 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*   91 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*   92 */ PFNGLISBUFFERPROC IsBuffer;
        /*   93 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*   94 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*   95 */ PFNGLENDQUERYPROC EndQuery;
        /*   96 */ PFNGLGENQUERIESPROC GenQueries;
        /*   97 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*   98 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*   99 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*  100 */ PFNGLISQUERYPROC IsQuery;
        /*  101 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /*  102 */ PFNGLGETVERTEXATTRIBDVPROC GetVertexAttribdv;
        /*  103 */ PFNGLVERTEXATTRIB1DPROC VertexAttrib1d;
        /*  104 */ PFNGLVERTEXATTRIB1DVPROC VertexAttrib1dv;
        /*  105 */ PFNGLVERTEXATTRIB1SPROC VertexAttrib1s;
        /*  106 */ PFNGLVERTEXATTRIB1SVPROC VertexAttrib1sv;
        /*  107 */ PFNGLVERTEXATTRIB2DPROC VertexAttrib2d;
        /*  108 */ PFNGLVERTEXATTRIB2DVPROC VertexAttrib2dv;
        /*  109 */ PFNGLVERTEXATTRIB2SPROC VertexAttrib2s;
        /*  110 */ PFNGLVERTEXATTRIB2SVPROC VertexAttrib2sv;
        /*  111 */ PFNGLVERTEXATTRIB3DPROC VertexAttrib3d;
        /*  112 */ PFNGLVERTEXATTRIB3DVPROC VertexAttrib3dv;
        /*  113 */ PFNGLVERTEXATTRIB3SPROC VertexAttrib3s;
        /*  114 */ PFNGLVERTEXATTRIB3SVPROC VertexAttrib3sv;
        /*  115 */ PFNGLVERTEXATTRIB4NBVPROC VertexAttrib4Nbv;
        /*  116 */ PFNGLVERTEXATTRIB4NIVPROC VertexAttrib4Niv;
        /*  117 */ PFNGLVERTEXATTRIB4NSVPROC VertexAttrib4Nsv;
        /*  118 */ PFNGLVERTEXATTRIB4NUBPROC VertexAttrib4Nub;
        /*  119 */ PFNGLVERTEXATTRIB4NUBVPROC VertexAttrib4Nubv;
        /*  120 */ PFNGLVERTEXATTRIB4NUIVPROC VertexAttrib4Nuiv;
        /*  121 */ PFNGLVERTEXATTRIB4NUSVPROC VertexAttrib4Nusv;
        /*  122 */ PFNGLVERTEXATTRIB4BVPROC VertexAttrib4bv;
        /*  123 */ PFNGLVERTEXATTRIB4DPROC VertexAttrib4d;
        /*  124 */ PFNGLVERTEXATTRIB4DVPROC VertexAttrib4dv;
        /*  125 */ PFNGLVERTEXATTRIB4IVPROC VertexAttrib4iv;
        /*  126 */ PFNGLVERTEXATTRIB4SPROC VertexAttrib4s;
        /*  127 */ PFNGLVERTEXATTRIB4SVPROC VertexAttrib4sv;
        /*  128 */ PFNGLVERTEXATTRIB4UBVPROC VertexAttrib4ubv;
        /*  129 */ PFNGLVERTEXATTRIB4UIVPROC VertexAttrib4uiv;
        /*  130 */ PFNGLVERTEXATTRIB4USVPROC VertexAttrib4usv;
        /*  131 */ PFNGLATTACHSHADERPROC AttachShader;
        /*  132 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*  133 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*  134 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*  135 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  136 */ PFNGLCREATESHADERPROC CreateShader;
        /*  137 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  138 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  139 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  140 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  141 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  142 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  143 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  144 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  145 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  146 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  147 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  148 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  149 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  150 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  151 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  152 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  153 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  154 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  155 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  156 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  157 */ PFNGLISPROGRAMPROC IsProgram;
        /*  158 */ PFNGLISSHADERPROC IsShader;
        /*  159 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  160 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /*  161 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /*  162 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /*  163 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /*  164 */ PFNGLUNIFORM1FPROC Uniform1f;
        /*  165 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /*  166 */ PFNGLUNIFORM1IPROC Uniform1i;
        /*  167 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /*  168 */ PFNGLUNIFORM2FPROC Uniform2f;
        /*  169 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /*  170 */ PFNGLUNIFORM2IPROC Uniform2i;
        /*  171 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /*  172 */ PFNGLUNIFORM3FPROC Uniform3f;
        /*  173 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /*  174 */ PFNGLUNIFORM3IPROC Uniform3i;
        /*  175 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /*  176 */ PFNGLUNIFORM4FPROC Uniform4f;
        /*  177 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /*  178 */ PFNGLUNIFORM4IPROC Uniform4i;
        /*  179 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /*  180 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /*  181 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /*  182 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /*  183 */ PFNGLUSEPROGRAMPROC UseProgram;
        /*  184 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /*  185 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /*  186 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /*  187 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /*  188 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /*  189 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /*  190 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /*  191 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /*  192 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /*  193 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /*  194 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  195 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /*  196 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /*  197 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /*  198 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /*  199 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /*  200 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /*  201 */ PFNGLBEGINCONDITIONALRENDERPROC BeginConditionalRender;
        /*  202 */ PFNGLBINDFRAGDATALOCATIONPROC BindFragDataLocation;
        /*  203 */ PFNGLCLAMPCOLORPROC ClampColor;
        /*  204 */ PFNGLENDCONDITIONALRENDERPROC EndConditionalRender;
        /*  205 */ PFNGLVERTEXATTRIBI1IPROC VertexAttribI1i;
        /*  206 */ PFNGLVERTEXATTRIBI1IVPROC VertexAttribI1iv;
        /*  207 */ PFNGLVERTEXATTRIBI1UIPROC VertexAttribI1ui;
        /*  208 */ PFNGLVERTEXATTRIBI1UIVPROC VertexAttribI1uiv;
        /*  209 */ PFNGLVERTEXATTRIBI2IPROC VertexAttribI2i;
        /*  210 */ PFNGLVERTEXATTRIBI2IVPROC VertexAttribI2iv;
        /*  211 */ PFNGLVERTEXATTRIBI2UIPROC VertexAttribI2ui;
        /*  212 */ PFNGLVERTEXATTRIBI2UIVPROC VertexAttribI2uiv;
        /*  213 */ PFNGLVERTEXATTRIBI3IPROC VertexAttribI3i;
        /*  214 */ PFNGLVERTEXATTRIBI3IVPROC VertexAttribI3iv;
        /*  215 */ PFNGLVERTEXATTRIBI3UIPROC VertexAttribI3ui;
        /*  216 */ PFNGLVERTEXATTRIBI3UIVPROC VertexAttribI3uiv;
        /*  217 */ PFNGLVERTEXATTRIBI4BVPROC VertexAttribI4bv;
        /*  218 */ PFNGLVERTEXATTRIBI4SVPROC VertexAttribI4sv;
        /*  219 */ PFNGLVERTEXATTRIBI4UBVPROC VertexAttribI4ubv;
        /*  220 */ PFNGLVERTEXATTRIBI4USVPROC VertexAttribI4usv;
        /*  221 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /*  222 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /*  223 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /*  224 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /*  225 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /*  226 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /*  227 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /*  228 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /*  229 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /*  230 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /*  231 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /*  232 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /*  233 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /*  234 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /*  235 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /*  236 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /*  237 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /*  238 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /*  239 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /*  240 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /*  241 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /*  242 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /*  243 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /*  244 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /*  245 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /*  246 */ PFNGLGETSTRINGIPROC GetStringi;
        /*  247 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /*  248 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /*  249 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /*  250 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /*  251 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /*  252 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /*  253 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /*  254 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /*  255 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /*  256 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /*  257 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /*  258 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /*  259 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /*  260 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /*  261 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /*  262 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /*  263 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /*  264 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /*  265 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /*  266 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /*  267 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /*  268 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /*  269 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /*  270 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /*  271 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /*  272 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /*  273 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /*  274 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /*  275 */ PFNGLCOLORMASKIPROC ColorMaski;
        /*  276 */ PFNGLDISABLEIPROC Disablei;
        /*  277 */ PFNGLENABLEIPROC Enablei;
        /*  278 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /*  279 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /*  280 */ PFNGLISENABLEDIPROC IsEnabledi;
        /*  281 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /*  282 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /*  283 */ PFNGLFRAMEBUFFERTEXTURE1DPROC FramebufferTexture1D;
        /*  284 */ PFNGLFRAMEBUFFERTEXTURE3DPROC FramebufferTexture3D;
        /*  285 */ PFNGLPRIMITIVERESTARTINDEXPROC PrimitiveRestartIndex;
        /*  286 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /*  287 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /*  288 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /*  289 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /*  290 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /*  291 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /*  292 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /*  293 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /*  294 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /*  295 */ PFNGLTEXBUFFERPROC TexBuffer;
        /*  296 */ PFNGLGETACTIVEUNIFORMNAMEPROC GetActiveUniformName;
        /*  297 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /*  298 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /*  299 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*  300 */ PFNGLDELETESYNCPROC DeleteSync;
        /*  301 */ PFNGLFENCESYNCPROC FenceSync;
        /*  302 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /*  303 */ PFNGLGETSYNCIVPROC GetSynciv;
        /*  304 */ PFNGLISSYNCPROC IsSync;
        /*  305 */ PFNGLWAITSYNCPROC WaitSync;
        /*  306 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /*  307 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /*  308 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /*  309 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /*  310 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /*  311 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /*  312 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXPROC MultiDrawElementsBaseVertex;
        /*  313 */ PFNGLPROVOKINGVERTEXPROC ProvokingVertex;
        /*  314 */ PFNGLTEXIMAGE2DMULTISAMPLEPROC TexImage2DMultisample;
        /*  315 */ PFNGLTEXIMAGE3DMULTISAMPLEPROC TexImage3DMultisample;
        /*  316 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /*  317 */ PFNGLBINDSAMPLERPROC BindSampler;
        /*  318 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /*  319 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /*  320 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /*  321 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /*  322 */ PFNGLISSAMPLERPROC IsSampler;
        /*  323 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /*  324 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /*  325 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /*  326 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /*  327 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /*  328 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /*  329 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /*  330 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /*  331 */ PFNGLBINDFRAGDATALOCATIONINDEXEDPROC BindFragDataLocationIndexed;
        /*  332 */ PFNGLGETFRAGDATAINDEXPROC GetFragDataIndex;
        /*  333 */ PFNGLGETQUERYOBJECTI64VPROC GetQueryObjecti64v;
        /*  334 */ PFNGLGETQUERYOBJECTUI64VPROC GetQueryObjectui64v;
        /*  335 */ PFNGLQUERYCOUNTERPROC QueryCounter;
        /*  336 */ PFNGLVERTEXATTRIBP1UIPROC VertexAttribP1ui;
        /*  337 */ PFNGLVERTEXATTRIBP1UIVPROC VertexAttribP1uiv;
        /*  338 */ PFNGLVERTEXATTRIBP2UIPROC VertexAttribP2ui;
        /*  339 */ PFNGLVERTEXATTRIBP2UIVPROC VertexAttribP2uiv;
        /*  340 */ PFNGLVERTEXATTRIBP3UIPROC VertexAttribP3ui;
        /*  341 */ PFNGLVERTEXATTRIBP3UIVPROC VertexAttribP3uiv;
        /*  342 */ PFNGLVERTEXATTRIBP4UIPROC VertexAttribP4ui;
        /*  343 */ PFNGLVERTEXATTRIBP4UIVPROC VertexAttribP4uiv;
        /*  344 */ PFNGLBINDTRANSFORMFEEDBACKPROC BindTransformFeedback;
        /*  345 */ PFNGLDELETETRANSFORMFEEDBACKSPROC DeleteTransformFeedbacks;
        /*  346 */ PFNGLGENTRANSFORMFEEDBACKSPROC GenTransformFeedbacks;
        /*  347 */ PFNGLISTRANSFORMFEEDBACKPROC IsTransformFeedback;
        /*  348 */ PFNGLPAUSETRANSFORMFEEDBACKPROC PauseTransformFeedback;
        /*  349 */ PFNGLRESUMETRANSFORMFEEDBACKPROC ResumeTransformFeedback;
        /*  350 */ PFNGLDRAWARRAYSINDIRECTPROC DrawArraysIndirect;
        /*  351 */ PFNGLDRAWELEMENTSINDIRECTPROC DrawElementsIndirect;
        /*  352 */ PFNGLBLENDEQUATIONSEPARATEIPROC BlendEquationSeparatei;
        /*  353 */ PFNGLBLENDEQUATIONIPROC BlendEquationi;
        /*  354 */ PFNGLBLENDFUNCSEPARATEIPROC BlendFuncSeparatei;
        /*  355 */ PFNGLBLENDFUNCIPROC BlendFunci;
        /*  356 */ PFNGLMINSAMPLESHADINGPROC MinSampleShading;
        /*  357 */ PFNGLPATCHPARAMETERIPROC PatchParameteri;
        /*  358 */ PFNGLGETUNIFORMDVPROC GetUniformdv;
        /*  359 */ PFNGLUNIFORM1DPROC Uniform1d;
        /*  360 */ PFNGLUNIFORM1DVPROC Uniform1dv;
        /*  361 */ PFNGLUNIFORM2DPROC Uniform2d;
        /*  362 */ PFNGLUNIFORM2DVPROC Uniform2dv;
        /*  363 */ PFNGLUNIFORM3DPROC Uniform3d;
        /*  364 */ PFNGLUNIFORM3DVPROC Uniform3dv;
        /*  365 */ PFNGLUNIFORM4DPROC Uniform4d;
        /*  366 */ PFNGLUNIFORM4DVPROC Uniform4dv;
        /*  367 */ PFNGLUNIFORMMATRIX2DVPROC UniformMatrix2dv;
        /*  368 */ PFNGLUNIFORMMATRIX2X3DVPROC UniformMatrix2x3dv;
        /*  369 */ PFNGLUNIFORMMATRIX2X4DVPROC UniformMatrix2x4dv;
        /*  370 */ PFNGLUNIFORMMATRIX3DVPROC UniformMatrix3dv;
        /*  371 */ PFNGLUNIFORMMATRIX3X2DVPROC UniformMatrix3x2dv;
        /*  372 */ PFNGLUNIFORMMATRIX3X4DVPROC UniformMatrix3x4dv;
        /*  373 */ PFNGLUNIFORMMATRIX4DVPROC UniformMatrix4dv;
        /*  374 */ PFNGLUNIFORMMATRIX4X2DVPROC UniformMatrix4x2dv;
        /*  375 */ PFNGLUNIFORMMATRIX4X3DVPROC UniformMatrix4x3dv;
        /*  376 */ PFNGLGETACTIVESUBROUTINENAMEPROC GetActiveSubroutineName;
        /*  377 */ PFNGLGETACTIVESUBROUTINEUNIFORMNAMEPROC GetActiveSubroutineUniformName;
        /*  378 */ PFNGLGETACTIVESUBROUTINEUNIFORMIVPROC GetActiveSubroutineUniformiv;
        /*  379 */ PFNGLGETPROGRAMSTAGEIVPROC GetProgramStageiv;
        /*  380 */ PFNGLGETSUBROUTINEINDEXPROC GetSubroutineIndex;
        /*  381 */ PFNGLGETSUBROUTINEUNIFORMLOCATIONPROC GetSubroutineUniformLocation;
        /*  382 */ PFNGLGETUNIFORMSUBROUTINEUIVPROC GetUniformSubroutineuiv;
        /*  383 */ PFNGLUNIFORMSUBROUTINESUIVPROC UniformSubroutinesuiv;
        /*  384 */ PFNGLPATCHPARAMETERFVPROC PatchParameterfv;
        /*  385 */ PFNGLDRAWTRANSFORMFEEDBACKPROC DrawTransformFeedback;
        /*  386 */ PFNGLBEGINQUERYINDEXEDPROC BeginQueryIndexed;
        /*  387 */ PFNGLDRAWTRANSFORMFEEDBACKSTREAMPROC DrawTransformFeedbackStream;
        /*  388 */ PFNGLENDQUERYINDEXEDPROC EndQueryIndexed;
        /*  389 */ PFNGLGETQUERYINDEXEDIVPROC GetQueryIndexediv;
        /*  390 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /*  391 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /*  392 */ PFNGLGETSHADERPRECISIONFORMATPROC GetShaderPrecisionFormat;
        /*  393 */ PFNGLRELEASESHADERCOMPILERPROC ReleaseShaderCompiler;
        /*  394 */ PFNGLSHADERBINARYPROC ShaderBinary;
        /*  395 */ PFNGLGETPROGRAMBINARYPROC GetProgramBinary;
        /*  396 */ PFNGLPROGRAMBINARYPROC ProgramBinary;
        /*  397 */ PFNGLPROGRAMPARAMETERIPROC ProgramParameteri;
        /*  398 */ PFNGLACTIVESHADERPROGRAMPROC ActiveShaderProgram;
        /*  399 */ PFNGLBINDPROGRAMPIPELINEPROC BindProgramPipeline;
        /*  400 */ PFNGLCREATESHADERPROGRAMVPROC CreateShaderProgramv;
        /*  401 */ PFNGLDELETEPROGRAMPIPELINESPROC DeleteProgramPipelines;
        /*  402 */ PFNGLGENPROGRAMPIPELINESPROC GenProgramPipelines;
        /*  403 */ PFNGLGETPROGRAMPIPELINEINFOLOGPROC GetProgramPipelineInfoLog;
        /*  404 */ PFNGLGETPROGRAMPIPELINEIVPROC GetProgramPipelineiv;
        /*  405 */ PFNGLISPROGRAMPIPELINEPROC IsProgramPipeline;
        /*  406 */ PFNGLPROGRAMUNIFORM1FPROC ProgramUniform1f;
        /*  407 */ PFNGLPROGRAMUNIFORM1FVPROC ProgramUniform1fv;
        /*  408 */ PFNGLPROGRAMUNIFORM1IPROC ProgramUniform1i;
        /*  409 */ PFNGLPROGRAMUNIFORM1IVPROC ProgramUniform1iv;
        /*  410 */ PFNGLPROGRAMUNIFORM1UIPROC ProgramUniform1ui;
        /*  411 */ PFNGLPROGRAMUNIFORM1UIVPROC ProgramUniform1uiv;
        /*  412 */ PFNGLPROGRAMUNIFORM2FPROC ProgramUniform2f;
        /*  413 */ PFNGLPROGRAMUNIFORM2FVPROC ProgramUniform2fv;
        /*  414 */ PFNGLPROGRAMUNIFORM2IPROC ProgramUniform2i;
        /*  415 */ PFNGLPROGRAMUNIFORM2IVPROC ProgramUniform2iv;
        /*  416 */ PFNGLPROGRAMUNIFORM2UIPROC ProgramUniform2ui;
        /*  417 */ PFNGLPROGRAMUNIFORM2UIVPROC ProgramUniform2uiv;
        /*  418 */ PFNGLPROGRAMUNIFORM3FPROC ProgramUniform3f;
        /*  419 */ PFNGLPROGRAMUNIFORM3FVPROC ProgramUniform3fv;
        /*  420 */ PFNGLPROGRAMUNIFORM3IPROC ProgramUniform3i;
        /*  421 */ PFNGLPROGRAMUNIFORM3IVPROC ProgramUniform3iv;
        /*  422 */ PFNGLPROGRAMUNIFORM3UIPROC ProgramUniform3ui;
        /*  423 */ PFNGLPROGRAMUNIFORM3UIVPROC ProgramUniform3uiv;
        /*  424 */ PFNGLPROGRAMUNIFORM4FPROC ProgramUniform4f;
        /*  425 */ PFNGLPROGRAMUNIFORM4FVPROC ProgramUniform4fv;
        /*  426 */ PFNGLPROGRAMUNIFORM4IPROC ProgramUniform4i;
        /*  427 */ PFNGLPROGRAMUNIFORM4IVPROC ProgramUniform4iv;
        /*  428 */ PFNGLPROGRAMUNIFORM4UIPROC ProgramUniform4ui;
        /*  429 */ PFNGLPROGRAMUNIFORM4UIVPROC ProgramUniform4uiv;
        /*  430 */ PFNGLPROGRAMUNIFORMMATRIX2FVPROC ProgramUniformMatrix2fv;
        /*  431 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVPROC ProgramUniformMatrix2x3fv;
        /*  432 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVPROC ProgramUniformMatrix2x4fv;
        /*  433 */ PFNGLPROGRAMUNIFORMMATRIX3FVPROC ProgramUniformMatrix3fv;
        /*  434 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVPROC ProgramUniformMatrix3x2fv;
        /*  435 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVPROC ProgramUniformMatrix3x4fv;
        /*  436 */ PFNGLPROGRAMUNIFORMMATRIX4FVPROC ProgramUniformMatrix4fv;
        /*  437 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVPROC ProgramUniformMatrix4x2fv;
        /*  438 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVPROC ProgramUniformMatrix4x3fv;
        /*  439 */ PFNGLUSEPROGRAMSTAGESPROC UseProgramStages;
        /*  440 */ PFNGLVALIDATEPROGRAMPIPELINEPROC ValidateProgramPipeline;
        /*  441 */ PFNGLPROGRAMUNIFORM1DPROC ProgramUniform1d;
        /*  442 */ PFNGLPROGRAMUNIFORM1DVPROC ProgramUniform1dv;
        /*  443 */ PFNGLPROGRAMUNIFORM2DPROC ProgramUniform2d;
        /*  444 */ PFNGLPROGRAMUNIFORM2DVPROC ProgramUniform2dv;
        /*  445 */ PFNGLPROGRAMUNIFORM3DPROC ProgramUniform3d;
        /*  446 */ PFNGLPROGRAMUNIFORM3DVPROC ProgramUniform3dv;
        /*  447 */ PFNGLPROGRAMUNIFORM4DPROC ProgramUniform4d;
        /*  448 */ PFNGLPROGRAMUNIFORM4DVPROC ProgramUniform4dv;
        /*  449 */ PFNGLPROGRAMUNIFORMMATRIX2DVPROC ProgramUniformMatrix2dv;
        /*  450 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVPROC ProgramUniformMatrix2x3dv;
        /*  451 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVPROC ProgramUniformMatrix2x4dv;
        /*  452 */ PFNGLPROGRAMUNIFORMMATRIX3DVPROC ProgramUniformMatrix3dv;
        /*  453 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVPROC ProgramUniformMatrix3x2dv;
        /*  454 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVPROC ProgramUniformMatrix3x4dv;
        /*  455 */ PFNGLPROGRAMUNIFORMMATRIX4DVPROC ProgramUniformMatrix4dv;
        /*  456 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVPROC ProgramUniformMatrix4x2dv;
        /*  457 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVPROC ProgramUniformMatrix4x3dv;
        /*  458 */ PFNGLGETVERTEXATTRIBLDVPROC GetVertexAttribLdv;
        /*  459 */ PFNGLVERTEXATTRIBL1DPROC VertexAttribL1d;
        /*  460 */ PFNGLVERTEXATTRIBL1DVPROC VertexAttribL1dv;
        /*  461 */ PFNGLVERTEXATTRIBL2DPROC VertexAttribL2d;
        /*  462 */ PFNGLVERTEXATTRIBL2DVPROC VertexAttribL2dv;
        /*  463 */ PFNGLVERTEXATTRIBL3DPROC VertexAttribL3d;
        /*  464 */ PFNGLVERTEXATTRIBL3DVPROC VertexAttribL3dv;
        /*  465 */ PFNGLVERTEXATTRIBL4DPROC VertexAttribL4d;
        /*  466 */ PFNGLVERTEXATTRIBL4DVPROC VertexAttribL4dv;
        /*  467 */ PFNGLVERTEXATTRIBLPOINTERPROC VertexAttribLPointer;
        /*  468 */ PFNGLDEPTHRANGEARRAYVPROC DepthRangeArrayv;
        /*  469 */ PFNGLDEPTHRANGEINDEXEDPROC DepthRangeIndexed;
        /*  470 */ PFNGLGETDOUBLEI_VPROC GetDoublei_v;
        /*  471 */ PFNGLGETFLOATI_VPROC GetFloati_v;
        /*  472 */ PFNGLSCISSORARRAYVPROC ScissorArrayv;
        /*  473 */ PFNGLSCISSORINDEXEDPROC ScissorIndexed;
        /*  474 */ PFNGLSCISSORINDEXEDVPROC ScissorIndexedv;
        /*  475 */ PFNGLVIEWPORTARRAYVPROC ViewportArrayv;
        /*  476 */ PFNGLVIEWPORTINDEXEDFPROC ViewportIndexedf;
        /*  477 */ PFNGLVIEWPORTINDEXEDFVPROC ViewportIndexedfv;
        /*  478 */ PFNGLGETINTERNALFORMATIVPROC GetInternalformativ;
        /*  479 */ PFNGLTEXSTORAGE2DPROC TexStorage2D;
        /*  480 */ PFNGLTEXSTORAGE3DPROC TexStorage3D;
        /*  481 */ PFNGLBINDIMAGETEXTUREPROC BindImageTexture;
        /*  482 */ PFNGLMEMORYBARRIERPROC MemoryBarrier;
        /*  483 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEPROC DrawArraysInstancedBaseInstance;
        /*  484 */ PFNGLDRAWELEMENTSINSTANCEDBASEINSTANCEPROC DrawElementsInstancedBaseInstance;
        /*  485 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEPROC DrawElementsInstancedBaseVertexBaseInstance;
        /*  486 */ PFNGLGETACTIVEATOMICCOUNTERBUFFERIVPROC GetActiveAtomicCounterBufferiv;
        /*  487 */ PFNGLTEXSTORAGE1DPROC TexStorage1D;
        /*  488 */ PFNGLDRAWTRANSFORMFEEDBACKINSTANCEDPROC DrawTransformFeedbackInstanced;
        /*  489 */ PFNGLDRAWTRANSFORMFEEDBACKSTREAMINSTANCEDPROC DrawTransformFeedbackStreamInstanced;
        /*  490 */ PFNGLINVALIDATEFRAMEBUFFERPROC InvalidateFramebuffer;
        /*  491 */ PFNGLINVALIDATESUBFRAMEBUFFERPROC InvalidateSubFramebuffer;
        /*  492 */ PFNGLDISPATCHCOMPUTEPROC DispatchCompute;
        /*  493 */ PFNGLDISPATCHCOMPUTEINDIRECTPROC DispatchComputeIndirect;
        /*  494 */ PFNGLFRAMEBUFFERPARAMETERIPROC FramebufferParameteri;
        /*  495 */ PFNGLGETFRAMEBUFFERPARAMETERIVPROC GetFramebufferParameteriv;
        /*  496 */ PFNGLGETPROGRAMINTERFACEIVPROC GetProgramInterfaceiv;
        /*  497 */ PFNGLGETPROGRAMRESOURCEINDEXPROC GetProgramResourceIndex;
        /*  498 */ PFNGLGETPROGRAMRESOURCELOCATIONPROC GetProgramResourceLocation;
        /*  499 */ PFNGLGETPROGRAMRESOURCENAMEPROC GetProgramResourceName;
        /*  500 */ PFNGLGETPROGRAMRESOURCEIVPROC GetProgramResourceiv;
        /*  501 */ PFNGLTEXSTORAGE2DMULTISAMPLEPROC TexStorage2DMultisample;
        /*  502 */ PFNGLBINDVERTEXBUFFERPROC BindVertexBuffer;
        /*  503 */ PFNGLVERTEXATTRIBBINDINGPROC VertexAttribBinding;
        /*  504 */ PFNGLVERTEXATTRIBFORMATPROC VertexAttribFormat;
        /*  505 */ PFNGLVERTEXATTRIBIFORMATPROC VertexAttribIFormat;
        /*  506 */ PFNGLVERTEXBINDINGDIVISORPROC VertexBindingDivisor;
        /*  507 */ PFNGLCOPYIMAGESUBDATAPROC CopyImageSubData;
        /*  508 */ PFNGLTEXBUFFERRANGEPROC TexBufferRange;
        /*  509 */ PFNGLTEXSTORAGE3DMULTISAMPLEPROC TexStorage3DMultisample;
        /*  510 */ PFNGLDEBUGMESSAGECALLBACKPROC DebugMessageCallback;
        /*  511 */ PFNGLDEBUGMESSAGECONTROLPROC DebugMessageControl;
        /*  512 */ PFNGLDEBUGMESSAGEINSERTPROC DebugMessageInsert;
        /*  513 */ PFNGLGETDEBUGMESSAGELOGPROC GetDebugMessageLog;
        /*  514 */ PFNGLGETOBJECTLABELPROC GetObjectLabel;
        /*  515 */ PFNGLGETOBJECTPTRLABELPROC GetObjectPtrLabel;
        /*  516 */ PFNGLOBJECTLABELPROC ObjectLabel;
        /*  517 */ PFNGLOBJECTPTRLABELPROC ObjectPtrLabel;
        /*  518 */ PFNGLPOPDEBUGGROUPPROC PopDebugGroup;
        /*  519 */ PFNGLPUSHDEBUGGROUPPROC PushDebugGroup;
        /*  520 */ PFNGLCLEARBUFFERDATAPROC ClearBufferData;
        /*  521 */ PFNGLCLEARBUFFERSUBDATAPROC ClearBufferSubData;
        /*  522 */ PFNGLGETINTERNALFORMATI64VPROC GetInternalformati64v;
        /*  523 */ PFNGLINVALIDATEBUFFERDATAPROC InvalidateBufferData;
        /*  524 */ PFNGLINVALIDATEBUFFERSUBDATAPROC InvalidateBufferSubData;
        /*  525 */ PFNGLINVALIDATETEXIMAGEPROC InvalidateTexImage;
        /*  526 */ PFNGLINVALIDATETEXSUBIMAGEPROC InvalidateTexSubImage;
        /*  527 */ PFNGLMULTIDRAWARRAYSINDIRECTPROC MultiDrawArraysIndirect;
        /*  528 */ PFNGLMULTIDRAWELEMENTSINDIRECTPROC MultiDrawElementsIndirect;
        /*  529 */ PFNGLGETPROGRAMRESOURCELOCATIONINDEXPROC GetProgramResourceLocationIndex;
        /*  530 */ PFNGLSHADERSTORAGEBLOCKBINDINGPROC ShaderStorageBlockBinding;
        /*  531 */ PFNGLTEXTUREVIEWPROC TextureView;
        /*  532 */ PFNGLVERTEXATTRIBLFORMATPROC VertexAttribLFormat;
        /*  533 */ PFNGLBUFFERSTORAGEPROC BufferStorage;
        /*  534 */ PFNGLCLEARTEXIMAGEPROC ClearTexImage;
        /*  535 */ PFNGLCLEARTEXSUBIMAGEPROC ClearTexSubImage;
        /*  536 */ PFNGLBINDBUFFERSBASEPROC BindBuffersBase;
        /*  537 */ PFNGLBINDBUFFERSRANGEPROC BindBuffersRange;
        /*  538 */ PFNGLBINDIMAGETEXTURESPROC BindImageTextures;
        /*  539 */ PFNGLBINDSAMPLERSPROC BindSamplers;
        /*  540 */ PFNGLBINDTEXTURESPROC BindTextures;
        /*  541 */ PFNGLBINDVERTEXBUFFERSPROC BindVertexBuffers;
        /*  542 */ PFNGLGETNCOMPRESSEDTEXIMAGEPROC GetnCompressedTexImage;
        /*  543 */ PFNGLGETNTEXIMAGEPROC GetnTexImage;
        /*  544 */ PFNGLGETNUNIFORMDVPROC GetnUniformdv;
        /*  545 */ PFNGLMEMORYBARRIERBYREGIONPROC MemoryBarrierByRegion;
        /*  546 */ PFNGLGETGRAPHICSRESETSTATUSPROC GetGraphicsResetStatus;
        /*  547 */ PFNGLGETNUNIFORMFVPROC GetnUniformfv;
        /*  548 */ PFNGLGETNUNIFORMIVPROC GetnUniformiv;
        /*  549 */ PFNGLGETNUNIFORMUIVPROC GetnUniformuiv;
        /*  550 */ PFNGLREADNPIXELSPROC ReadnPixels;
        /*  551 */ PFNGLCLIPCONTROLPROC ClipControl;
        /*  552 */ PFNGLBINDTEXTUREUNITPROC BindTextureUnit;
        /*  553 */ PFNGLBLITNAMEDFRAMEBUFFERPROC BlitNamedFramebuffer;
        /*  554 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSPROC CheckNamedFramebufferStatus;
        /*  555 */ PFNGLCLEARNAMEDBUFFERDATAPROC ClearNamedBufferData;
        /*  556 */ PFNGLCLEARNAMEDBUFFERSUBDATAPROC ClearNamedBufferSubData;
        /*  557 */ PFNGLCLEARNAMEDFRAMEBUFFERFIPROC ClearNamedFramebufferfi;
        /*  558 */ PFNGLCLEARNAMEDFRAMEBUFFERFVPROC ClearNamedFramebufferfv;
        /*  559 */ PFNGLCLEARNAMEDFRAMEBUFFERIVPROC ClearNamedFramebufferiv;
        /*  560 */ PFNGLCLEARNAMEDFRAMEBUFFERUIVPROC ClearNamedFramebufferuiv;
        /*  561 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DPROC CompressedTextureSubImage1D;
        /*  562 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DPROC CompressedTextureSubImage2D;
        /*  563 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DPROC CompressedTextureSubImage3D;
        /*  564 */ PFNGLCOPYNAMEDBUFFERSUBDATAPROC CopyNamedBufferSubData;
        /*  565 */ PFNGLCOPYTEXTURESUBIMAGE1DPROC CopyTextureSubImage1D;
        /*  566 */ PFNGLCOPYTEXTURESUBIMAGE2DPROC CopyTextureSubImage2D;
        /*  567 */ PFNGLCOPYTEXTURESUBIMAGE3DPROC CopyTextureSubImage3D;
        /*  568 */ PFNGLCREATEBUFFERSPROC CreateBuffers;
        /*  569 */ PFNGLCREATEFRAMEBUFFERSPROC CreateFramebuffers;
        /*  570 */ PFNGLCREATEPROGRAMPIPELINESPROC CreateProgramPipelines;
        /*  571 */ PFNGLCREATEQUERIESPROC CreateQueries;
        /*  572 */ PFNGLCREATERENDERBUFFERSPROC CreateRenderbuffers;
        /*  573 */ PFNGLCREATESAMPLERSPROC CreateSamplers;
        /*  574 */ PFNGLCREATETEXTURESPROC CreateTextures;
        /*  575 */ PFNGLCREATETRANSFORMFEEDBACKSPROC CreateTransformFeedbacks;
        /*  576 */ PFNGLCREATEVERTEXARRAYSPROC CreateVertexArrays;
        /*  577 */ PFNGLDISABLEVERTEXARRAYATTRIBPROC DisableVertexArrayAttrib;
        /*  578 */ PFNGLENABLEVERTEXARRAYATTRIBPROC EnableVertexArrayAttrib;
        /*  579 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEPROC FlushMappedNamedBufferRange;
        /*  580 */ PFNGLGENERATETEXTUREMIPMAPPROC GenerateTextureMipmap;
        /*  581 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEPROC GetCompressedTextureImage;
        /*  582 */ PFNGLGETNAMEDBUFFERPARAMETERI64VPROC GetNamedBufferParameteri64v;
        /*  583 */ PFNGLGETNAMEDBUFFERPARAMETERIVPROC GetNamedBufferParameteriv;
        /*  584 */ PFNGLGETNAMEDBUFFERPOINTERVPROC GetNamedBufferPointerv;
        /*  585 */ PFNGLGETNAMEDBUFFERSUBDATAPROC GetNamedBufferSubData;
        /*  586 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetNamedFramebufferAttachmentParameteriv;
        /*  587 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVPROC GetNamedFramebufferParameteriv;
        /*  588 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVPROC GetNamedRenderbufferParameteriv;
        /*  589 */ PFNGLGETQUERYBUFFEROBJECTI64VPROC GetQueryBufferObjecti64v;
        /*  590 */ PFNGLGETQUERYBUFFEROBJECTIVPROC GetQueryBufferObjectiv;
        /*  591 */ PFNGLGETQUERYBUFFEROBJECTUI64VPROC GetQueryBufferObjectui64v;
        /*  592 */ PFNGLGETQUERYBUFFEROBJECTUIVPROC GetQueryBufferObjectuiv;
        /*  593 */ PFNGLGETTEXTUREIMAGEPROC GetTextureImage;
        /*  594 */ PFNGLGETTEXTURELEVELPARAMETERFVPROC GetTextureLevelParameterfv;
        /*  595 */ PFNGLGETTEXTURELEVELPARAMETERIVPROC GetTextureLevelParameteriv;
        /*  596 */ PFNGLGETTEXTUREPARAMETERIIVPROC GetTextureParameterIiv;
        /*  597 */ PFNGLGETTEXTUREPARAMETERIUIVPROC GetTextureParameterIuiv;
        /*  598 */ PFNGLGETTEXTUREPARAMETERFVPROC GetTextureParameterfv;
        /*  599 */ PFNGLGETTEXTUREPARAMETERIVPROC GetTextureParameteriv;
        /*  600 */ PFNGLGETTRANSFORMFEEDBACKI64_VPROC GetTransformFeedbacki64_v;
        /*  601 */ PFNGLGETTRANSFORMFEEDBACKI_VPROC GetTransformFeedbacki_v;
        /*  602 */ PFNGLGETTRANSFORMFEEDBACKIVPROC GetTransformFeedbackiv;
        /*  603 */ PFNGLGETVERTEXARRAYINDEXED64IVPROC GetVertexArrayIndexed64iv;
        /*  604 */ PFNGLGETVERTEXARRAYINDEXEDIVPROC GetVertexArrayIndexediv;
        /*  605 */ PFNGLGETVERTEXARRAYIVPROC GetVertexArrayiv;
        /*  606 */ PFNGLINVALIDATENAMEDFRAMEBUFFERDATAPROC InvalidateNamedFramebufferData;
        /*  607 */ PFNGLINVALIDATENAMEDFRAMEBUFFERSUBDATAPROC InvalidateNamedFramebufferSubData;
        /*  608 */ PFNGLMAPNAMEDBUFFERPROC MapNamedBuffer;
        /*  609 */ PFNGLMAPNAMEDBUFFERRANGEPROC MapNamedBufferRange;
        /*  610 */ PFNGLNAMEDBUFFERDATAPROC NamedBufferData;
        /*  611 */ PFNGLNAMEDBUFFERSTORAGEPROC NamedBufferStorage;
        /*  612 */ PFNGLNAMEDBUFFERSUBDATAPROC NamedBufferSubData;
        /*  613 */ PFNGLNAMEDFRAMEBUFFERDRAWBUFFERPROC NamedFramebufferDrawBuffer;
        /*  614 */ PFNGLNAMEDFRAMEBUFFERDRAWBUFFERSPROC NamedFramebufferDrawBuffers;
        /*  615 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIPROC NamedFramebufferParameteri;
        /*  616 */ PFNGLNAMEDFRAMEBUFFERREADBUFFERPROC NamedFramebufferReadBuffer;
        /*  617 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFERPROC NamedFramebufferRenderbuffer;
        /*  618 */ PFNGLNAMEDFRAMEBUFFERTEXTUREPROC NamedFramebufferTexture;
        /*  619 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYERPROC NamedFramebufferTextureLayer;
        /*  620 */ PFNGLNAMEDRENDERBUFFERSTORAGEPROC NamedRenderbufferStorage;
        /*  621 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEPROC NamedRenderbufferStorageMultisample;
        /*  622 */ PFNGLTEXTUREBUFFERPROC TextureBuffer;
        /*  623 */ PFNGLTEXTUREBUFFERRANGEPROC TextureBufferRange;
        /*  624 */ PFNGLTEXTUREPARAMETERIIVPROC TextureParameterIiv;
        /*  625 */ PFNGLTEXTUREPARAMETERIUIVPROC TextureParameterIuiv;
        /*  626 */ PFNGLTEXTUREPARAMETERFPROC TextureParameterf;
        /*  627 */ PFNGLTEXTUREPARAMETERFVPROC TextureParameterfv;
        /*  628 */ PFNGLTEXTUREPARAMETERIPROC TextureParameteri;
        /*  629 */ PFNGLTEXTUREPARAMETERIVPROC TextureParameteriv;
        /*  630 */ PFNGLTEXTURESTORAGE1DPROC TextureStorage1D;
        /*  631 */ PFNGLTEXTURESTORAGE2DPROC TextureStorage2D;
        /*  632 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEPROC TextureStorage2DMultisample;
        /*  633 */ PFNGLTEXTURESTORAGE3DPROC TextureStorage3D;
        /*  634 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEPROC TextureStorage3DMultisample;
        /*  635 */ PFNGLTEXTURESUBIMAGE1DPROC TextureSubImage1D;
        /*  636 */ PFNGLTEXTURESUBIMAGE2DPROC TextureSubImage2D;
        /*  637 */ PFNGLTEXTURESUBIMAGE3DPROC TextureSubImage3D;
        /*  638 */ PFNGLTRANSFORMFEEDBACKBUFFERBASEPROC TransformFeedbackBufferBase;
        /*  639 */ PFNGLTRANSFORMFEEDBACKBUFFERRANGEPROC TransformFeedbackBufferRange;
        /*  640 */ PFNGLUNMAPNAMEDBUFFERPROC UnmapNamedBuffer;
        /*  641 */ PFNGLVERTEXARRAYATTRIBBINDINGPROC VertexArrayAttribBinding;
        /*  642 */ PFNGLVERTEXARRAYATTRIBFORMATPROC VertexArrayAttribFormat;
        /*  643 */ PFNGLVERTEXARRAYATTRIBIFORMATPROC VertexArrayAttribIFormat;
        /*  644 */ PFNGLVERTEXARRAYATTRIBLFORMATPROC VertexArrayAttribLFormat;
        /*  645 */ PFNGLVERTEXARRAYBINDINGDIVISORPROC VertexArrayBindingDivisor;
        /*  646 */ PFNGLVERTEXARRAYELEMENTBUFFERPROC VertexArrayElementBuffer;
        /*  647 */ PFNGLVERTEXARRAYVERTEXBUFFERPROC VertexArrayVertexBuffer;
        /*  648 */ PFNGLVERTEXARRAYVERTEXBUFFERSPROC VertexArrayVertexBuffers;
        /*  649 */ PFNGLGETCOMPRESSEDTEXTURESUBIMAGEPROC GetCompressedTextureSubImage;
        /*  650 */ PFNGLGETTEXTURESUBIMAGEPROC GetTextureSubImage;
        /*  651 */ PFNGLTEXTUREBARRIERPROC TextureBarrier;
        /*  652 */ PFNGLMULTIDRAWARRAYSINDIRECTCOUNTPROC MultiDrawArraysIndirectCount;
        /*  653 */ PFNGLMULTIDRAWELEMENTSINDIRECTCOUNTPROC MultiDrawElementsIndirectCount;
        /*  654 */ PFNGLSPECIALIZESHADERPROC SpecializeShader;
        /*  655 */ PFNGLPOLYGONOFFSETCLAMPPROC PolygonOffsetClamp;
        /*  656 */ PFNGLBLENDBARRIERPROC BlendBarrier;
        /*  657 */ PFNGLPRIMITIVEBOUNDINGBOXPROC PrimitiveBoundingBox;
        /*  658 */ PFNGLGETPOINTERVPROC GetPointerv;
        /*  659 */ PFNGLTBUFFERMASK3DFXPROC TbufferMask3DFX;
        /*  660 */ PFNGLDEBUGMESSAGECALLBACKAMDPROC DebugMessageCallbackAMD;
        /*  661 */ PFNGLDEBUGMESSAGEENABLEAMDPROC DebugMessageEnableAMD;
        /*  662 */ PFNGLDEBUGMESSAGEINSERTAMDPROC DebugMessageInsertAMD;
        /*  663 */ PFNGLGETDEBUGMESSAGELOGAMDPROC GetDebugMessageLogAMD;
        /*  664 */ PFNGLBLENDEQUATIONINDEXEDAMDPROC BlendEquationIndexedAMD;
        /*  665 */ PFNGLBLENDEQUATIONSEPARATEINDEXEDAMDPROC BlendEquationSeparateIndexedAMD;
        /*  666 */ PFNGLBLENDFUNCINDEXEDAMDPROC BlendFuncIndexedAMD;
        /*  667 */ PFNGLBLENDFUNCSEPARATEINDEXEDAMDPROC BlendFuncSeparateIndexedAMD;
        /*  668 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEADVANCEDAMDPROC NamedRenderbufferStorageMultisampleAdvancedAMD;
        /*  669 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEADVANCEDAMDPROC RenderbufferStorageMultisampleAdvancedAMD;
        /*  670 */ PFNGLFRAMEBUFFERSAMPLEPOSITIONSFVAMDPROC FramebufferSamplePositionsfvAMD;
        /*  671 */ PFNGLGETFRAMEBUFFERPARAMETERFVAMDPROC GetFramebufferParameterfvAMD;
        /*  672 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERFVAMDPROC GetNamedFramebufferParameterfvAMD;
        /*  673 */ PFNGLNAMEDFRAMEBUFFERSAMPLEPOSITIONSFVAMDPROC NamedFramebufferSamplePositionsfvAMD;
        /*  674 */ PFNGLGETUNIFORMI64VNVPROC GetUniformi64vNV;
        /*  675 */ PFNGLPROGRAMUNIFORM1I64NVPROC ProgramUniform1i64NV;
        /*  676 */ PFNGLPROGRAMUNIFORM1I64VNVPROC ProgramUniform1i64vNV;
        /*  677 */ PFNGLPROGRAMUNIFORM1UI64NVPROC ProgramUniform1ui64NV;
        /*  678 */ PFNGLPROGRAMUNIFORM1UI64VNVPROC ProgramUniform1ui64vNV;
        /*  679 */ PFNGLPROGRAMUNIFORM2I64NVPROC ProgramUniform2i64NV;
        /*  680 */ PFNGLPROGRAMUNIFORM2I64VNVPROC ProgramUniform2i64vNV;
        /*  681 */ PFNGLPROGRAMUNIFORM2UI64NVPROC ProgramUniform2ui64NV;
        /*  682 */ PFNGLPROGRAMUNIFORM2UI64VNVPROC ProgramUniform2ui64vNV;
        /*  683 */ PFNGLPROGRAMUNIFORM3I64NVPROC ProgramUniform3i64NV;
        /*  684 */ PFNGLPROGRAMUNIFORM3I64VNVPROC ProgramUniform3i64vNV;
        /*  685 */ PFNGLPROGRAMUNIFORM3UI64NVPROC ProgramUniform3ui64NV;
        /*  686 */ PFNGLPROGRAMUNIFORM3UI64VNVPROC ProgramUniform3ui64vNV;
        /*  687 */ PFNGLPROGRAMUNIFORM4I64NVPROC ProgramUniform4i64NV;
        /*  688 */ PFNGLPROGRAMUNIFORM4I64VNVPROC ProgramUniform4i64vNV;
        /*  689 */ PFNGLPROGRAMUNIFORM4UI64NVPROC ProgramUniform4ui64NV;
        /*  690 */ PFNGLPROGRAMUNIFORM4UI64VNVPROC ProgramUniform4ui64vNV;
        /*  691 */ PFNGLUNIFORM1I64NVPROC Uniform1i64NV;
        /*  692 */ PFNGLUNIFORM1I64VNVPROC Uniform1i64vNV;
        /*  693 */ PFNGLUNIFORM1UI64NVPROC Uniform1ui64NV;
        /*  694 */ PFNGLUNIFORM1UI64VNVPROC Uniform1ui64vNV;
        /*  695 */ PFNGLUNIFORM2I64NVPROC Uniform2i64NV;
        /*  696 */ PFNGLUNIFORM2I64VNVPROC Uniform2i64vNV;
        /*  697 */ PFNGLUNIFORM2UI64NVPROC Uniform2ui64NV;
        /*  698 */ PFNGLUNIFORM2UI64VNVPROC Uniform2ui64vNV;
        /*  699 */ PFNGLUNIFORM3I64NVPROC Uniform3i64NV;
        /*  700 */ PFNGLUNIFORM3I64VNVPROC Uniform3i64vNV;
        /*  701 */ PFNGLUNIFORM3UI64NVPROC Uniform3ui64NV;
        /*  702 */ PFNGLUNIFORM3UI64VNVPROC Uniform3ui64vNV;
        /*  703 */ PFNGLUNIFORM4I64NVPROC Uniform4i64NV;
        /*  704 */ PFNGLUNIFORM4I64VNVPROC Uniform4i64vNV;
        /*  705 */ PFNGLUNIFORM4UI64NVPROC Uniform4ui64NV;
        /*  706 */ PFNGLUNIFORM4UI64VNVPROC Uniform4ui64vNV;
        /*  707 */ PFNGLGETUNIFORMUI64VNVPROC GetUniformui64vNV;
        /*  708 */ PFNGLVERTEXATTRIBPARAMETERIAMDPROC VertexAttribParameteriAMD;
        /*  709 */ PFNGLMULTIDRAWARRAYSINDIRECTAMDPROC MultiDrawArraysIndirectAMD;
        /*  710 */ PFNGLMULTIDRAWELEMENTSINDIRECTAMDPROC MultiDrawElementsIndirectAMD;
        /*  711 */ PFNGLDELETENAMESAMDPROC DeleteNamesAMD;
        /*  712 */ PFNGLGENNAMESAMDPROC GenNamesAMD;
        /*  713 */ PFNGLISNAMEAMDPROC IsNameAMD;
        /*  714 */ PFNGLQUERYOBJECTPARAMETERUIAMDPROC QueryObjectParameteruiAMD;
        /*  715 */ PFNGLBEGINPERFMONITORAMDPROC BeginPerfMonitorAMD;
        /*  716 */ PFNGLDELETEPERFMONITORSAMDPROC DeletePerfMonitorsAMD;
        /*  717 */ PFNGLENDPERFMONITORAMDPROC EndPerfMonitorAMD;
        /*  718 */ PFNGLGENPERFMONITORSAMDPROC GenPerfMonitorsAMD;
        /*  719 */ PFNGLGETPERFMONITORCOUNTERDATAAMDPROC GetPerfMonitorCounterDataAMD;
        /*  720 */ PFNGLGETPERFMONITORCOUNTERINFOAMDPROC GetPerfMonitorCounterInfoAMD;
        /*  721 */ PFNGLGETPERFMONITORCOUNTERSTRINGAMDPROC GetPerfMonitorCounterStringAMD;
        /*  722 */ PFNGLGETPERFMONITORCOUNTERSAMDPROC GetPerfMonitorCountersAMD;
        /*  723 */ PFNGLGETPERFMONITORGROUPSTRINGAMDPROC GetPerfMonitorGroupStringAMD;
        /*  724 */ PFNGLGETPERFMONITORGROUPSAMDPROC GetPerfMonitorGroupsAMD;
        /*  725 */ PFNGLSELECTPERFMONITORCOUNTERSAMDPROC SelectPerfMonitorCountersAMD;
        /*  726 */ PFNGLSETMULTISAMPLEFVAMDPROC SetMultisamplefvAMD;
        /*  727 */ PFNGLTEXSTORAGESPARSEAMDPROC TexStorageSparseAMD;
        /*  728 */ PFNGLTEXTURESTORAGESPARSEAMDPROC TextureStorageSparseAMD;
        /*  729 */ PFNGLSTENCILOPVALUEAMDPROC StencilOpValueAMD;
        /*  730 */ PFNGLTESSELLATIONFACTORAMDPROC TessellationFactorAMD;
        /*  731 */ PFNGLTESSELLATIONMODEAMDPROC TessellationModeAMD;
        /*  732 */ PFNGLBLITFRAMEBUFFERANGLEPROC BlitFramebufferANGLE;
        /*  733 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEANGLEPROC RenderbufferStorageMultisampleANGLE;
        /*  734 */ PFNGLDRAWARRAYSINSTANCEDANGLEPROC DrawArraysInstancedANGLE;
        /*  735 */ PFNGLDRAWELEMENTSINSTANCEDANGLEPROC DrawElementsInstancedANGLE;
        /*  736 */ PFNGLVERTEXATTRIBDIVISORANGLEPROC VertexAttribDivisorANGLE;
        /*  737 */ PFNGLGETTRANSLATEDSHADERSOURCEANGLEPROC GetTranslatedShaderSourceANGLE;
        /*  738 */ PFNGLCOPYTEXTURELEVELSAPPLEPROC CopyTextureLevelsAPPLE;
        /*  739 */ PFNGLDRAWELEMENTARRAYAPPLEPROC DrawElementArrayAPPLE;
        /*  740 */ PFNGLDRAWRANGEELEMENTARRAYAPPLEPROC DrawRangeElementArrayAPPLE;
        /*  741 */ PFNGLELEMENTPOINTERAPPLEPROC ElementPointerAPPLE;
        /*  742 */ PFNGLMULTIDRAWELEMENTARRAYAPPLEPROC MultiDrawElementArrayAPPLE;
        /*  743 */ PFNGLMULTIDRAWRANGEELEMENTARRAYAPPLEPROC MultiDrawRangeElementArrayAPPLE;
        /*  744 */ PFNGLDELETEFENCESAPPLEPROC DeleteFencesAPPLE;
        /*  745 */ PFNGLFINISHFENCEAPPLEPROC FinishFenceAPPLE;
        /*  746 */ PFNGLFINISHOBJECTAPPLEPROC FinishObjectAPPLE;
        /*  747 */ PFNGLGENFENCESAPPLEPROC GenFencesAPPLE;
        /*  748 */ PFNGLISFENCEAPPLEPROC IsFenceAPPLE;
        /*  749 */ PFNGLSETFENCEAPPLEPROC SetFenceAPPLE;
        /*  750 */ PFNGLTESTFENCEAPPLEPROC TestFenceAPPLE;
        /*  751 */ PFNGLTESTOBJECTAPPLEPROC TestObjectAPPLE;
        /*  752 */ PFNGLBUFFERPARAMETERIAPPLEPROC BufferParameteriAPPLE;
        /*  753 */ PFNGLFLUSHMAPPEDBUFFERRANGEAPPLEPROC FlushMappedBufferRangeAPPLE;
        /*  754 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEAPPLEPROC RenderbufferStorageMultisampleAPPLE;
        /*  755 */ PFNGLRESOLVEMULTISAMPLEFRAMEBUFFERAPPLEPROC ResolveMultisampleFramebufferAPPLE;
        /*  756 */ PFNGLGETOBJECTPARAMETERIVAPPLEPROC GetObjectParameterivAPPLE;
        /*  757 */ PFNGLOBJECTPURGEABLEAPPLEPROC ObjectPurgeableAPPLE;
        /*  758 */ PFNGLOBJECTUNPURGEABLEAPPLEPROC ObjectUnpurgeableAPPLE;
        /*  759 */ PFNGLCLIENTWAITSYNCAPPLEPROC ClientWaitSyncAPPLE;
        /*  760 */ PFNGLDELETESYNCAPPLEPROC DeleteSyncAPPLE;
        /*  761 */ PFNGLFENCESYNCAPPLEPROC FenceSyncAPPLE;
        /*  762 */ PFNGLGETINTEGER64VAPPLEPROC GetInteger64vAPPLE;
        /*  763 */ PFNGLGETSYNCIVAPPLEPROC GetSyncivAPPLE;
        /*  764 */ PFNGLISSYNCAPPLEPROC IsSyncAPPLE;
        /*  765 */ PFNGLWAITSYNCAPPLEPROC WaitSyncAPPLE;
        /*  766 */ PFNGLGETTEXPARAMETERPOINTERVAPPLEPROC GetTexParameterPointervAPPLE;
        /*  767 */ PFNGLTEXTURERANGEAPPLEPROC TextureRangeAPPLE;
        /*  768 */ PFNGLBINDVERTEXARRAYAPPLEPROC BindVertexArrayAPPLE;
        /*  769 */ PFNGLDELETEVERTEXARRAYSAPPLEPROC DeleteVertexArraysAPPLE;
        /*  770 */ PFNGLGENVERTEXARRAYSAPPLEPROC GenVertexArraysAPPLE;
        /*  771 */ PFNGLISVERTEXARRAYAPPLEPROC IsVertexArrayAPPLE;
        /*  772 */ PFNGLFLUSHVERTEXARRAYRANGEAPPLEPROC FlushVertexArrayRangeAPPLE;
        /*  773 */ PFNGLVERTEXARRAYPARAMETERIAPPLEPROC VertexArrayParameteriAPPLE;
        /*  774 */ PFNGLVERTEXARRAYRANGEAPPLEPROC VertexArrayRangeAPPLE;
        /*  775 */ PFNGLDISABLEVERTEXATTRIBAPPLEPROC DisableVertexAttribAPPLE;
        /*  776 */ PFNGLENABLEVERTEXATTRIBAPPLEPROC EnableVertexAttribAPPLE;
        /*  777 */ PFNGLISVERTEXATTRIBENABLEDAPPLEPROC IsVertexAttribEnabledAPPLE;
        /*  778 */ PFNGLMAPVERTEXATTRIB1DAPPLEPROC MapVertexAttrib1dAPPLE;
        /*  779 */ PFNGLMAPVERTEXATTRIB1FAPPLEPROC MapVertexAttrib1fAPPLE;
        /*  780 */ PFNGLMAPVERTEXATTRIB2DAPPLEPROC MapVertexAttrib2dAPPLE;
        /*  781 */ PFNGLMAPVERTEXATTRIB2FAPPLEPROC MapVertexAttrib2fAPPLE;
        /*  782 */ PFNGLPRIMITIVEBOUNDINGBOXARBPROC PrimitiveBoundingBoxARB;
        /*  783 */ PFNGLGETIMAGEHANDLEARBPROC GetImageHandleARB;
        /*  784 */ PFNGLGETTEXTUREHANDLEARBPROC GetTextureHandleARB;
        /*  785 */ PFNGLGETTEXTURESAMPLERHANDLEARBPROC GetTextureSamplerHandleARB;
        /*  786 */ PFNGLGETVERTEXATTRIBLUI64VARBPROC GetVertexAttribLui64vARB;
        /*  787 */ PFNGLISIMAGEHANDLERESIDENTARBPROC IsImageHandleResidentARB;
        /*  788 */ PFNGLISTEXTUREHANDLERESIDENTARBPROC IsTextureHandleResidentARB;
        /*  789 */ PFNGLMAKEIMAGEHANDLENONRESIDENTARBPROC MakeImageHandleNonResidentARB;
        /*  790 */ PFNGLMAKEIMAGEHANDLERESIDENTARBPROC MakeImageHandleResidentARB;
        /*  791 */ PFNGLMAKETEXTUREHANDLENONRESIDENTARBPROC MakeTextureHandleNonResidentARB;
        /*  792 */ PFNGLMAKETEXTUREHANDLERESIDENTARBPROC MakeTextureHandleResidentARB;
        /*  793 */ PFNGLPROGRAMUNIFORMHANDLEUI64ARBPROC ProgramUniformHandleui64ARB;
        /*  794 */ PFNGLPROGRAMUNIFORMHANDLEUI64VARBPROC ProgramUniformHandleui64vARB;
        /*  795 */ PFNGLUNIFORMHANDLEUI64ARBPROC UniformHandleui64ARB;
        /*  796 */ PFNGLUNIFORMHANDLEUI64VARBPROC UniformHandleui64vARB;
        /*  797 */ PFNGLVERTEXATTRIBL1UI64ARBPROC VertexAttribL1ui64ARB;
        /*  798 */ PFNGLVERTEXATTRIBL1UI64VARBPROC VertexAttribL1ui64vARB;
        /*  799 */ PFNGLCREATESYNCFROMCLEVENTARBPROC CreateSyncFromCLeventARB;
        /*  800 */ PFNGLCLAMPCOLORARBPROC ClampColorARB;
        /*  801 */ PFNGLDISPATCHCOMPUTEGROUPSIZEARBPROC DispatchComputeGroupSizeARB;
        /*  802 */ PFNGLDEBUGMESSAGECALLBACKARBPROC DebugMessageCallbackARB;
        /*  803 */ PFNGLDEBUGMESSAGECONTROLARBPROC DebugMessageControlARB;
        /*  804 */ PFNGLDEBUGMESSAGEINSERTARBPROC DebugMessageInsertARB;
        /*  805 */ PFNGLGETDEBUGMESSAGELOGARBPROC GetDebugMessageLogARB;
        /*  806 */ PFNGLDRAWBUFFERSARBPROC DrawBuffersARB;
        /*  807 */ PFNGLBLENDEQUATIONSEPARATEIARBPROC BlendEquationSeparateiARB;
        /*  808 */ PFNGLBLENDEQUATIONIARBPROC BlendEquationiARB;
        /*  809 */ PFNGLBLENDFUNCSEPARATEIARBPROC BlendFuncSeparateiARB;
        /*  810 */ PFNGLBLENDFUNCIARBPROC BlendFunciARB;
        /*  811 */ PFNGLDRAWARRAYSINSTANCEDARBPROC DrawArraysInstancedARB;
        /*  812 */ PFNGLDRAWELEMENTSINSTANCEDARBPROC DrawElementsInstancedARB;
        /*  813 */ PFNGLBINDPROGRAMARBPROC BindProgramARB;
        /*  814 */ PFNGLDELETEPROGRAMSARBPROC DeleteProgramsARB;
        /*  815 */ PFNGLGENPROGRAMSARBPROC GenProgramsARB;
        /*  816 */ PFNGLGETPROGRAMENVPARAMETERDVARBPROC GetProgramEnvParameterdvARB;
        /*  817 */ PFNGLGETPROGRAMENVPARAMETERFVARBPROC GetProgramEnvParameterfvARB;
        /*  818 */ PFNGLGETPROGRAMLOCALPARAMETERDVARBPROC GetProgramLocalParameterdvARB;
        /*  819 */ PFNGLGETPROGRAMLOCALPARAMETERFVARBPROC GetProgramLocalParameterfvARB;
        /*  820 */ PFNGLGETPROGRAMSTRINGARBPROC GetProgramStringARB;
        /*  821 */ PFNGLGETPROGRAMIVARBPROC GetProgramivARB;
        /*  822 */ PFNGLISPROGRAMARBPROC IsProgramARB;
        /*  823 */ PFNGLPROGRAMENVPARAMETER4DARBPROC ProgramEnvParameter4dARB;
        /*  824 */ PFNGLPROGRAMENVPARAMETER4DVARBPROC ProgramEnvParameter4dvARB;
        /*  825 */ PFNGLPROGRAMENVPARAMETER4FARBPROC ProgramEnvParameter4fARB;
        /*  826 */ PFNGLPROGRAMENVPARAMETER4FVARBPROC ProgramEnvParameter4fvARB;
        /*  827 */ PFNGLPROGRAMLOCALPARAMETER4DARBPROC ProgramLocalParameter4dARB;
        /*  828 */ PFNGLPROGRAMLOCALPARAMETER4DVARBPROC ProgramLocalParameter4dvARB;
        /*  829 */ PFNGLPROGRAMLOCALPARAMETER4FARBPROC ProgramLocalParameter4fARB;
        /*  830 */ PFNGLPROGRAMLOCALPARAMETER4FVARBPROC ProgramLocalParameter4fvARB;
        /*  831 */ PFNGLPROGRAMSTRINGARBPROC ProgramStringARB;
        /*  832 */ PFNGLFRAMEBUFFERTEXTUREARBPROC FramebufferTextureARB;
        /*  833 */ PFNGLFRAMEBUFFERTEXTUREFACEARBPROC FramebufferTextureFaceARB;
        /*  834 */ PFNGLFRAMEBUFFERTEXTURELAYERARBPROC FramebufferTextureLayerARB;
        /*  835 */ PFNGLPROGRAMPARAMETERIARBPROC ProgramParameteriARB;
        /*  836 */ PFNGLSPECIALIZESHADERARBPROC SpecializeShaderARB;
        /*  837 */ PFNGLGETUNIFORMI64VARBPROC GetUniformi64vARB;
        /*  838 */ PFNGLGETUNIFORMUI64VARBPROC GetUniformui64vARB;
        /*  839 */ PFNGLGETNUNIFORMI64VARBPROC GetnUniformi64vARB;
        /*  840 */ PFNGLGETNUNIFORMUI64VARBPROC GetnUniformui64vARB;
        /*  841 */ PFNGLPROGRAMUNIFORM1I64ARBPROC ProgramUniform1i64ARB;
        /*  842 */ PFNGLPROGRAMUNIFORM1I64VARBPROC ProgramUniform1i64vARB;
        /*  843 */ PFNGLPROGRAMUNIFORM1UI64ARBPROC ProgramUniform1ui64ARB;
        /*  844 */ PFNGLPROGRAMUNIFORM1UI64VARBPROC ProgramUniform1ui64vARB;
        /*  845 */ PFNGLPROGRAMUNIFORM2I64ARBPROC ProgramUniform2i64ARB;
        /*  846 */ PFNGLPROGRAMUNIFORM2I64VARBPROC ProgramUniform2i64vARB;
        /*  847 */ PFNGLPROGRAMUNIFORM2UI64ARBPROC ProgramUniform2ui64ARB;
        /*  848 */ PFNGLPROGRAMUNIFORM2UI64VARBPROC ProgramUniform2ui64vARB;
        /*  849 */ PFNGLPROGRAMUNIFORM3I64ARBPROC ProgramUniform3i64ARB;
        /*  850 */ PFNGLPROGRAMUNIFORM3I64VARBPROC ProgramUniform3i64vARB;
        /*  851 */ PFNGLPROGRAMUNIFORM3UI64ARBPROC ProgramUniform3ui64ARB;
        /*  852 */ PFNGLPROGRAMUNIFORM3UI64VARBPROC ProgramUniform3ui64vARB;
        /*  853 */ PFNGLPROGRAMUNIFORM4I64ARBPROC ProgramUniform4i64ARB;
        /*  854 */ PFNGLPROGRAMUNIFORM4I64VARBPROC ProgramUniform4i64vARB;
        /*  855 */ PFNGLPROGRAMUNIFORM4UI64ARBPROC ProgramUniform4ui64ARB;
        /*  856 */ PFNGLPROGRAMUNIFORM4UI64VARBPROC ProgramUniform4ui64vARB;
        /*  857 */ PFNGLUNIFORM1I64ARBPROC Uniform1i64ARB;
        /*  858 */ PFNGLUNIFORM1I64VARBPROC Uniform1i64vARB;
        /*  859 */ PFNGLUNIFORM1UI64ARBPROC Uniform1ui64ARB;
        /*  860 */ PFNGLUNIFORM1UI64VARBPROC Uniform1ui64vARB;
        /*  861 */ PFNGLUNIFORM2I64ARBPROC Uniform2i64ARB;
        /*  862 */ PFNGLUNIFORM2I64VARBPROC Uniform2i64vARB;
        /*  863 */ PFNGLUNIFORM2UI64ARBPROC Uniform2ui64ARB;
        /*  864 */ PFNGLUNIFORM2UI64VARBPROC Uniform2ui64vARB;
        /*  865 */ PFNGLUNIFORM3I64ARBPROC Uniform3i64ARB;
        /*  866 */ PFNGLUNIFORM3I64VARBPROC Uniform3i64vARB;
        /*  867 */ PFNGLUNIFORM3UI64ARBPROC Uniform3ui64ARB;
        /*  868 */ PFNGLUNIFORM3UI64VARBPROC Uniform3ui64vARB;
        /*  869 */ PFNGLUNIFORM4I64ARBPROC Uniform4i64ARB;
        /*  870 */ PFNGLUNIFORM4I64VARBPROC Uniform4i64vARB;
        /*  871 */ PFNGLUNIFORM4UI64ARBPROC Uniform4ui64ARB;
        /*  872 */ PFNGLUNIFORM4UI64VARBPROC Uniform4ui64vARB;
        /*  873 */ PFNGLCOLORSUBTABLEPROC ColorSubTable;
        /*  874 */ PFNGLCOLORTABLEPROC ColorTable;
        /*  875 */ PFNGLCOLORTABLEPARAMETERFVPROC ColorTableParameterfv;
        /*  876 */ PFNGLCOLORTABLEPARAMETERIVPROC ColorTableParameteriv;
        /*  877 */ PFNGLCONVOLUTIONFILTER1DPROC ConvolutionFilter1D;
        /*  878 */ PFNGLCONVOLUTIONFILTER2DPROC ConvolutionFilter2D;
        /*  879 */ PFNGLCONVOLUTIONPARAMETERFPROC ConvolutionParameterf;
        /*  880 */ PFNGLCONVOLUTIONPARAMETERFVPROC ConvolutionParameterfv;
        /*  881 */ PFNGLCONVOLUTIONPARAMETERIPROC ConvolutionParameteri;
        /*  882 */ PFNGLCONVOLUTIONPARAMETERIVPROC ConvolutionParameteriv;
        /*  883 */ PFNGLCOPYCOLORSUBTABLEPROC CopyColorSubTable;
        /*  884 */ PFNGLCOPYCOLORTABLEPROC CopyColorTable;
        /*  885 */ PFNGLCOPYCONVOLUTIONFILTER1DPROC CopyConvolutionFilter1D;
        /*  886 */ PFNGLCOPYCONVOLUTIONFILTER2DPROC CopyConvolutionFilter2D;
        /*  887 */ PFNGLGETCOLORTABLEPROC GetColorTable;
        /*  888 */ PFNGLGETCOLORTABLEPARAMETERFVPROC GetColorTableParameterfv;
        /*  889 */ PFNGLGETCOLORTABLEPARAMETERIVPROC GetColorTableParameteriv;
        /*  890 */ PFNGLGETCONVOLUTIONFILTERPROC GetConvolutionFilter;
        /*  891 */ PFNGLGETCONVOLUTIONPARAMETERFVPROC GetConvolutionParameterfv;
        /*  892 */ PFNGLGETCONVOLUTIONPARAMETERIVPROC GetConvolutionParameteriv;
        /*  893 */ PFNGLGETHISTOGRAMPROC GetHistogram;
        /*  894 */ PFNGLGETHISTOGRAMPARAMETERFVPROC GetHistogramParameterfv;
        /*  895 */ PFNGLGETHISTOGRAMPARAMETERIVPROC GetHistogramParameteriv;
        /*  896 */ PFNGLGETMINMAXPROC GetMinmax;
        /*  897 */ PFNGLGETMINMAXPARAMETERFVPROC GetMinmaxParameterfv;
        /*  898 */ PFNGLGETMINMAXPARAMETERIVPROC GetMinmaxParameteriv;
        /*  899 */ PFNGLGETSEPARABLEFILTERPROC GetSeparableFilter;
        /*  900 */ PFNGLHISTOGRAMPROC Histogram;
        /*  901 */ PFNGLMINMAXPROC Minmax;
        /*  902 */ PFNGLRESETHISTOGRAMPROC ResetHistogram;
        /*  903 */ PFNGLRESETMINMAXPROC ResetMinmax;
        /*  904 */ PFNGLSEPARABLEFILTER2DPROC SeparableFilter2D;
        /*  905 */ PFNGLMULTIDRAWARRAYSINDIRECTCOUNTARBPROC MultiDrawArraysIndirectCountARB;
        /*  906 */ PFNGLMULTIDRAWELEMENTSINDIRECTCOUNTARBPROC MultiDrawElementsIndirectCountARB;
        /*  907 */ PFNGLVERTEXATTRIBDIVISORARBPROC VertexAttribDivisorARB;
        /*  908 */ PFNGLCURRENTPALETTEMATRIXARBPROC CurrentPaletteMatrixARB;
        /*  909 */ PFNGLMATRIXINDEXPOINTERARBPROC MatrixIndexPointerARB;
        /*  910 */ PFNGLMATRIXINDEXUBVARBPROC MatrixIndexubvARB;
        /*  911 */ PFNGLMATRIXINDEXUIVARBPROC MatrixIndexuivARB;
        /*  912 */ PFNGLMATRIXINDEXUSVARBPROC MatrixIndexusvARB;
        /*  913 */ PFNGLSAMPLECOVERAGEARBPROC SampleCoverageARB;
        /*  914 */ PFNGLACTIVETEXTUREARBPROC ActiveTextureARB;
        /*  915 */ PFNGLCLIENTACTIVETEXTUREARBPROC ClientActiveTextureARB;
        /*  916 */ PFNGLMULTITEXCOORD1DARBPROC MultiTexCoord1dARB;
        /*  917 */ PFNGLMULTITEXCOORD1DVARBPROC MultiTexCoord1dvARB;
        /*  918 */ PFNGLMULTITEXCOORD1FARBPROC MultiTexCoord1fARB;
        /*  919 */ PFNGLMULTITEXCOORD1FVARBPROC MultiTexCoord1fvARB;
        /*  920 */ PFNGLMULTITEXCOORD1IARBPROC MultiTexCoord1iARB;
        /*  921 */ PFNGLMULTITEXCOORD1IVARBPROC MultiTexCoord1ivARB;
        /*  922 */ PFNGLMULTITEXCOORD1SARBPROC MultiTexCoord1sARB;
        /*  923 */ PFNGLMULTITEXCOORD1SVARBPROC MultiTexCoord1svARB;
        /*  924 */ PFNGLMULTITEXCOORD2DARBPROC MultiTexCoord2dARB;
        /*  925 */ PFNGLMULTITEXCOORD2DVARBPROC MultiTexCoord2dvARB;
        /*  926 */ PFNGLMULTITEXCOORD2FARBPROC MultiTexCoord2fARB;
        /*  927 */ PFNGLMULTITEXCOORD2FVARBPROC MultiTexCoord2fvARB;
        /*  928 */ PFNGLMULTITEXCOORD2IARBPROC MultiTexCoord2iARB;
        /*  929 */ PFNGLMULTITEXCOORD2IVARBPROC MultiTexCoord2ivARB;
        /*  930 */ PFNGLMULTITEXCOORD2SARBPROC MultiTexCoord2sARB;
        /*  931 */ PFNGLMULTITEXCOORD2SVARBPROC MultiTexCoord2svARB;
        /*  932 */ PFNGLMULTITEXCOORD3DARBPROC MultiTexCoord3dARB;
        /*  933 */ PFNGLMULTITEXCOORD3DVARBPROC MultiTexCoord3dvARB;
        /*  934 */ PFNGLMULTITEXCOORD3FARBPROC MultiTexCoord3fARB;
        /*  935 */ PFNGLMULTITEXCOORD3FVARBPROC MultiTexCoord3fvARB;
        /*  936 */ PFNGLMULTITEXCOORD3IARBPROC MultiTexCoord3iARB;
        /*  937 */ PFNGLMULTITEXCOORD3IVARBPROC MultiTexCoord3ivARB;
        /*  938 */ PFNGLMULTITEXCOORD3SARBPROC MultiTexCoord3sARB;
        /*  939 */ PFNGLMULTITEXCOORD3SVARBPROC MultiTexCoord3svARB;
        /*  940 */ PFNGLMULTITEXCOORD4DARBPROC MultiTexCoord4dARB;
        /*  941 */ PFNGLMULTITEXCOORD4DVARBPROC MultiTexCoord4dvARB;
        /*  942 */ PFNGLMULTITEXCOORD4FARBPROC MultiTexCoord4fARB;
        /*  943 */ PFNGLMULTITEXCOORD4FVARBPROC MultiTexCoord4fvARB;
        /*  944 */ PFNGLMULTITEXCOORD4IARBPROC MultiTexCoord4iARB;
        /*  945 */ PFNGLMULTITEXCOORD4IVARBPROC MultiTexCoord4ivARB;
        /*  946 */ PFNGLMULTITEXCOORD4SARBPROC MultiTexCoord4sARB;
        /*  947 */ PFNGLMULTITEXCOORD4SVARBPROC MultiTexCoord4svARB;
        /*  948 */ PFNGLBEGINQUERYARBPROC BeginQueryARB;
        /*  949 */ PFNGLDELETEQUERIESARBPROC DeleteQueriesARB;
        /*  950 */ PFNGLENDQUERYARBPROC EndQueryARB;
        /*  951 */ PFNGLGENQUERIESARBPROC GenQueriesARB;
        /*  952 */ PFNGLGETQUERYOBJECTIVARBPROC GetQueryObjectivARB;
        /*  953 */ PFNGLGETQUERYOBJECTUIVARBPROC GetQueryObjectuivARB;
        /*  954 */ PFNGLGETQUERYIVARBPROC GetQueryivARB;
        /*  955 */ PFNGLISQUERYARBPROC IsQueryARB;
        /*  956 */ PFNGLMAXSHADERCOMPILERTHREADSARBPROC MaxShaderCompilerThreadsARB;
        /*  957 */ PFNGLPOINTPARAMETERFARBPROC PointParameterfARB;
        /*  958 */ PFNGLPOINTPARAMETERFVARBPROC PointParameterfvARB;
        /*  959 */ PFNGLGETGRAPHICSRESETSTATUSARBPROC GetGraphicsResetStatusARB;
        /*  960 */ PFNGLGETNCOLORTABLEARBPROC GetnColorTableARB;
        /*  961 */ PFNGLGETNCOMPRESSEDTEXIMAGEARBPROC GetnCompressedTexImageARB;
        /*  962 */ PFNGLGETNCONVOLUTIONFILTERARBPROC GetnConvolutionFilterARB;
        /*  963 */ PFNGLGETNHISTOGRAMARBPROC GetnHistogramARB;
        /*  964 */ PFNGLGETNMAPDVARBPROC GetnMapdvARB;
        /*  965 */ PFNGLGETNMAPFVARBPROC GetnMapfvARB;
        /*  966 */ PFNGLGETNMAPIVARBPROC GetnMapivARB;
        /*  967 */ PFNGLGETNMINMAXARBPROC GetnMinmaxARB;
        /*  968 */ PFNGLGETNPIXELMAPFVARBPROC GetnPixelMapfvARB;
        /*  969 */ PFNGLGETNPIXELMAPUIVARBPROC GetnPixelMapuivARB;
        /*  970 */ PFNGLGETNPIXELMAPUSVARBPROC GetnPixelMapusvARB;
        /*  971 */ PFNGLGETNPOLYGONSTIPPLEARBPROC GetnPolygonStippleARB;
        /*  972 */ PFNGLGETNSEPARABLEFILTERARBPROC GetnSeparableFilterARB;
        /*  973 */ PFNGLGETNTEXIMAGEARBPROC GetnTexImageARB;
        /*  974 */ PFNGLGETNUNIFORMDVARBPROC GetnUniformdvARB;
        /*  975 */ PFNGLGETNUNIFORMFVARBPROC GetnUniformfvARB;
        /*  976 */ PFNGLGETNUNIFORMIVARBPROC GetnUniformivARB;
        /*  977 */ PFNGLGETNUNIFORMUIVARBPROC GetnUniformuivARB;
        /*  978 */ PFNGLREADNPIXELSARBPROC ReadnPixelsARB;
        /*  979 */ PFNGLEVALUATEDEPTHVALUESARBPROC EvaluateDepthValuesARB;
        /*  980 */ PFNGLFRAMEBUFFERSAMPLELOCATIONSFVARBPROC FramebufferSampleLocationsfvARB;
        /*  981 */ PFNGLNAMEDFRAMEBUFFERSAMPLELOCATIONSFVARBPROC NamedFramebufferSampleLocationsfvARB;
        /*  982 */ PFNGLMINSAMPLESHADINGARBPROC MinSampleShadingARB;
        /*  983 */ PFNGLATTACHOBJECTARBPROC AttachObjectARB;
        /*  984 */ PFNGLCOMPILESHADERARBPROC CompileShaderARB;
        /*  985 */ PFNGLCREATEPROGRAMOBJECTARBPROC CreateProgramObjectARB;
        /*  986 */ PFNGLCREATESHADEROBJECTARBPROC CreateShaderObjectARB;
        /*  987 */ PFNGLDELETEOBJECTARBPROC DeleteObjectARB;
        /*  988 */ PFNGLDETACHOBJECTARBPROC DetachObjectARB;
        /*  989 */ PFNGLGETACTIVEUNIFORMARBPROC GetActiveUniformARB;
        /*  990 */ PFNGLGETATTACHEDOBJECTSARBPROC GetAttachedObjectsARB;
        /*  991 */ PFNGLGETHANDLEARBPROC GetHandleARB;
        /*  992 */ PFNGLGETINFOLOGARBPROC GetInfoLogARB;
        /*  993 */ PFNGLGETOBJECTPARAMETERFVARBPROC GetObjectParameterfvARB;
        /*  994 */ PFNGLGETOBJECTPARAMETERIVARBPROC GetObjectParameterivARB;
        /*  995 */ PFNGLGETSHADERSOURCEARBPROC GetShaderSourceARB;
        /*  996 */ PFNGLGETUNIFORMLOCATIONARBPROC GetUniformLocationARB;
        /*  997 */ PFNGLGETUNIFORMFVARBPROC GetUniformfvARB;
        /*  998 */ PFNGLGETUNIFORMIVARBPROC GetUniformivARB;
        /*  999 */ PFNGLLINKPROGRAMARBPROC LinkProgramARB;
        /* 1000 */ PFNGLSHADERSOURCEARBPROC ShaderSourceARB;
        /* 1001 */ PFNGLUNIFORM1FARBPROC Uniform1fARB;
        /* 1002 */ PFNGLUNIFORM1FVARBPROC Uniform1fvARB;
        /* 1003 */ PFNGLUNIFORM1IARBPROC Uniform1iARB;
        /* 1004 */ PFNGLUNIFORM1IVARBPROC Uniform1ivARB;
        /* 1005 */ PFNGLUNIFORM2FARBPROC Uniform2fARB;
        /* 1006 */ PFNGLUNIFORM2FVARBPROC Uniform2fvARB;
        /* 1007 */ PFNGLUNIFORM2IARBPROC Uniform2iARB;
        /* 1008 */ PFNGLUNIFORM2IVARBPROC Uniform2ivARB;
        /* 1009 */ PFNGLUNIFORM3FARBPROC Uniform3fARB;
        /* 1010 */ PFNGLUNIFORM3FVARBPROC Uniform3fvARB;
        /* 1011 */ PFNGLUNIFORM3IARBPROC Uniform3iARB;
        /* 1012 */ PFNGLUNIFORM3IVARBPROC Uniform3ivARB;
        /* 1013 */ PFNGLUNIFORM4FARBPROC Uniform4fARB;
        /* 1014 */ PFNGLUNIFORM4FVARBPROC Uniform4fvARB;
        /* 1015 */ PFNGLUNIFORM4IARBPROC Uniform4iARB;
        /* 1016 */ PFNGLUNIFORM4IVARBPROC Uniform4ivARB;
        /* 1017 */ PFNGLUNIFORMMATRIX2FVARBPROC UniformMatrix2fvARB;
        /* 1018 */ PFNGLUNIFORMMATRIX3FVARBPROC UniformMatrix3fvARB;
        /* 1019 */ PFNGLUNIFORMMATRIX4FVARBPROC UniformMatrix4fvARB;
        /* 1020 */ PFNGLUSEPROGRAMOBJECTARBPROC UseProgramObjectARB;
        /* 1021 */ PFNGLVALIDATEPROGRAMARBPROC ValidateProgramARB;
        /* 1022 */ PFNGLCOMPILESHADERINCLUDEARBPROC CompileShaderIncludeARB;
        /* 1023 */ PFNGLDELETENAMEDSTRINGARBPROC DeleteNamedStringARB;
        /* 1024 */ PFNGLGETNAMEDSTRINGARBPROC GetNamedStringARB;
        /* 1025 */ PFNGLGETNAMEDSTRINGIVARBPROC GetNamedStringivARB;
        /* 1026 */ PFNGLISNAMEDSTRINGARBPROC IsNamedStringARB;
        /* 1027 */ PFNGLNAMEDSTRINGARBPROC NamedStringARB;
        /* 1028 */ PFNGLBUFFERPAGECOMMITMENTARBPROC BufferPageCommitmentARB;
        /* 1029 */ PFNGLNAMEDBUFFERPAGECOMMITMENTARBPROC NamedBufferPageCommitmentARB;
        /* 1030 */ PFNGLNAMEDBUFFERPAGECOMMITMENTEXTPROC NamedBufferPageCommitmentEXT;
        /* 1031 */ PFNGLTEXPAGECOMMITMENTARBPROC TexPageCommitmentARB;
        /* 1032 */ PFNGLTEXBUFFERARBPROC TexBufferARB;
        /* 1033 */ PFNGLCOMPRESSEDTEXIMAGE1DARBPROC CompressedTexImage1DARB;
        /* 1034 */ PFNGLCOMPRESSEDTEXIMAGE2DARBPROC CompressedTexImage2DARB;
        /* 1035 */ PFNGLCOMPRESSEDTEXIMAGE3DARBPROC CompressedTexImage3DARB;
        /* 1036 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DARBPROC CompressedTexSubImage1DARB;
        /* 1037 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DARBPROC CompressedTexSubImage2DARB;
        /* 1038 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DARBPROC CompressedTexSubImage3DARB;
        /* 1039 */ PFNGLGETCOMPRESSEDTEXIMAGEARBPROC GetCompressedTexImageARB;
        /* 1040 */ PFNGLLOADTRANSPOSEMATRIXDARBPROC LoadTransposeMatrixdARB;
        /* 1041 */ PFNGLLOADTRANSPOSEMATRIXFARBPROC LoadTransposeMatrixfARB;
        /* 1042 */ PFNGLMULTTRANSPOSEMATRIXDARBPROC MultTransposeMatrixdARB;
        /* 1043 */ PFNGLMULTTRANSPOSEMATRIXFARBPROC MultTransposeMatrixfARB;
        /* 1044 */ PFNGLVERTEXBLENDARBPROC VertexBlendARB;
        /* 1045 */ PFNGLWEIGHTPOINTERARBPROC WeightPointerARB;
        /* 1046 */ PFNGLWEIGHTBVARBPROC WeightbvARB;
        /* 1047 */ PFNGLWEIGHTDVARBPROC WeightdvARB;
        /* 1048 */ PFNGLWEIGHTFVARBPROC WeightfvARB;
        /* 1049 */ PFNGLWEIGHTIVARBPROC WeightivARB;
        /* 1050 */ PFNGLWEIGHTSVARBPROC WeightsvARB;
        /* 1051 */ PFNGLWEIGHTUBVARBPROC WeightubvARB;
        /* 1052 */ PFNGLWEIGHTUIVARBPROC WeightuivARB;
        /* 1053 */ PFNGLWEIGHTUSVARBPROC WeightusvARB;
        /* 1054 */ PFNGLBINDBUFFERARBPROC BindBufferARB;
        /* 1055 */ PFNGLBUFFERDATAARBPROC BufferDataARB;
        /* 1056 */ PFNGLBUFFERSUBDATAARBPROC BufferSubDataARB;
        /* 1057 */ PFNGLDELETEBUFFERSARBPROC DeleteBuffersARB;
        /* 1058 */ PFNGLGENBUFFERSARBPROC GenBuffersARB;
        /* 1059 */ PFNGLGETBUFFERPARAMETERIVARBPROC GetBufferParameterivARB;
        /* 1060 */ PFNGLGETBUFFERPOINTERVARBPROC GetBufferPointervARB;
        /* 1061 */ PFNGLGETBUFFERSUBDATAARBPROC GetBufferSubDataARB;
        /* 1062 */ PFNGLISBUFFERARBPROC IsBufferARB;
        /* 1063 */ PFNGLMAPBUFFERARBPROC MapBufferARB;
        /* 1064 */ PFNGLUNMAPBUFFERARBPROC UnmapBufferARB;
        /* 1065 */ PFNGLDISABLEVERTEXATTRIBARRAYARBPROC DisableVertexAttribArrayARB;
        /* 1066 */ PFNGLENABLEVERTEXATTRIBARRAYARBPROC EnableVertexAttribArrayARB;
        /* 1067 */ PFNGLGETVERTEXATTRIBPOINTERVARBPROC GetVertexAttribPointervARB;
        /* 1068 */ PFNGLGETVERTEXATTRIBDVARBPROC GetVertexAttribdvARB;
        /* 1069 */ PFNGLGETVERTEXATTRIBFVARBPROC GetVertexAttribfvARB;
        /* 1070 */ PFNGLGETVERTEXATTRIBIVARBPROC GetVertexAttribivARB;
        /* 1071 */ PFNGLVERTEXATTRIB1DARBPROC VertexAttrib1dARB;
        /* 1072 */ PFNGLVERTEXATTRIB1DVARBPROC VertexAttrib1dvARB;
        /* 1073 */ PFNGLVERTEXATTRIB1FARBPROC VertexAttrib1fARB;
        /* 1074 */ PFNGLVERTEXATTRIB1FVARBPROC VertexAttrib1fvARB;
        /* 1075 */ PFNGLVERTEXATTRIB1SARBPROC VertexAttrib1sARB;
        /* 1076 */ PFNGLVERTEXATTRIB1SVARBPROC VertexAttrib1svARB;
        /* 1077 */ PFNGLVERTEXATTRIB2DARBPROC VertexAttrib2dARB;
        /* 1078 */ PFNGLVERTEXATTRIB2DVARBPROC VertexAttrib2dvARB;
        /* 1079 */ PFNGLVERTEXATTRIB2FARBPROC VertexAttrib2fARB;
        /* 1080 */ PFNGLVERTEXATTRIB2FVARBPROC VertexAttrib2fvARB;
        /* 1081 */ PFNGLVERTEXATTRIB2SARBPROC VertexAttrib2sARB;
        /* 1082 */ PFNGLVERTEXATTRIB2SVARBPROC VertexAttrib2svARB;
        /* 1083 */ PFNGLVERTEXATTRIB3DARBPROC VertexAttrib3dARB;
        /* 1084 */ PFNGLVERTEXATTRIB3DVARBPROC VertexAttrib3dvARB;
        /* 1085 */ PFNGLVERTEXATTRIB3FARBPROC VertexAttrib3fARB;
        /* 1086 */ PFNGLVERTEXATTRIB3FVARBPROC VertexAttrib3fvARB;
        /* 1087 */ PFNGLVERTEXATTRIB3SARBPROC VertexAttrib3sARB;
        /* 1088 */ PFNGLVERTEXATTRIB3SVARBPROC VertexAttrib3svARB;
        /* 1089 */ PFNGLVERTEXATTRIB4NBVARBPROC VertexAttrib4NbvARB;
        /* 1090 */ PFNGLVERTEXATTRIB4NIVARBPROC VertexAttrib4NivARB;
        /* 1091 */ PFNGLVERTEXATTRIB4NSVARBPROC VertexAttrib4NsvARB;
        /* 1092 */ PFNGLVERTEXATTRIB4NUBARBPROC VertexAttrib4NubARB;
        /* 1093 */ PFNGLVERTEXATTRIB4NUBVARBPROC VertexAttrib4NubvARB;
        /* 1094 */ PFNGLVERTEXATTRIB4NUIVARBPROC VertexAttrib4NuivARB;
        /* 1095 */ PFNGLVERTEXATTRIB4NUSVARBPROC VertexAttrib4NusvARB;
        /* 1096 */ PFNGLVERTEXATTRIB4BVARBPROC VertexAttrib4bvARB;
        /* 1097 */ PFNGLVERTEXATTRIB4DARBPROC VertexAttrib4dARB;
        /* 1098 */ PFNGLVERTEXATTRIB4DVARBPROC VertexAttrib4dvARB;
        /* 1099 */ PFNGLVERTEXATTRIB4FARBPROC VertexAttrib4fARB;
        /* 1100 */ PFNGLVERTEXATTRIB4FVARBPROC VertexAttrib4fvARB;
        /* 1101 */ PFNGLVERTEXATTRIB4IVARBPROC VertexAttrib4ivARB;
        /* 1102 */ PFNGLVERTEXATTRIB4SARBPROC VertexAttrib4sARB;
        /* 1103 */ PFNGLVERTEXATTRIB4SVARBPROC VertexAttrib4svARB;
        /* 1104 */ PFNGLVERTEXATTRIB4UBVARBPROC VertexAttrib4ubvARB;
        /* 1105 */ PFNGLVERTEXATTRIB4UIVARBPROC VertexAttrib4uivARB;
        /* 1106 */ PFNGLVERTEXATTRIB4USVARBPROC VertexAttrib4usvARB;
        /* 1107 */ PFNGLVERTEXATTRIBPOINTERARBPROC VertexAttribPointerARB;
        /* 1108 */ PFNGLBINDATTRIBLOCATIONARBPROC BindAttribLocationARB;
        /* 1109 */ PFNGLGETACTIVEATTRIBARBPROC GetActiveAttribARB;
        /* 1110 */ PFNGLGETATTRIBLOCATIONARBPROC GetAttribLocationARB;
        /* 1111 */ PFNGLCOLORP3UIPROC ColorP3ui;
        /* 1112 */ PFNGLCOLORP3UIVPROC ColorP3uiv;
        /* 1113 */ PFNGLCOLORP4UIPROC ColorP4ui;
        /* 1114 */ PFNGLCOLORP4UIVPROC ColorP4uiv;
        /* 1115 */ PFNGLMULTITEXCOORDP1UIPROC MultiTexCoordP1ui;
        /* 1116 */ PFNGLMULTITEXCOORDP1UIVPROC MultiTexCoordP1uiv;
        /* 1117 */ PFNGLMULTITEXCOORDP2UIPROC MultiTexCoordP2ui;
        /* 1118 */ PFNGLMULTITEXCOORDP2UIVPROC MultiTexCoordP2uiv;
        /* 1119 */ PFNGLMULTITEXCOORDP3UIPROC MultiTexCoordP3ui;
        /* 1120 */ PFNGLMULTITEXCOORDP3UIVPROC MultiTexCoordP3uiv;
        /* 1121 */ PFNGLMULTITEXCOORDP4UIPROC MultiTexCoordP4ui;
        /* 1122 */ PFNGLMULTITEXCOORDP4UIVPROC MultiTexCoordP4uiv;
        /* 1123 */ PFNGLNORMALP3UIPROC NormalP3ui;
        /* 1124 */ PFNGLNORMALP3UIVPROC NormalP3uiv;
        /* 1125 */ PFNGLSECONDARYCOLORP3UIPROC SecondaryColorP3ui;
        /* 1126 */ PFNGLSECONDARYCOLORP3UIVPROC SecondaryColorP3uiv;
        /* 1127 */ PFNGLTEXCOORDP1UIPROC TexCoordP1ui;
        /* 1128 */ PFNGLTEXCOORDP1UIVPROC TexCoordP1uiv;
        /* 1129 */ PFNGLTEXCOORDP2UIPROC TexCoordP2ui;
        /* 1130 */ PFNGLTEXCOORDP2UIVPROC TexCoordP2uiv;
        /* 1131 */ PFNGLTEXCOORDP3UIPROC TexCoordP3ui;
        /* 1132 */ PFNGLTEXCOORDP3UIVPROC TexCoordP3uiv;
        /* 1133 */ PFNGLTEXCOORDP4UIPROC TexCoordP4ui;
        /* 1134 */ PFNGLTEXCOORDP4UIVPROC TexCoordP4uiv;
        /* 1135 */ PFNGLVERTEXP2UIPROC VertexP2ui;
        /* 1136 */ PFNGLVERTEXP2UIVPROC VertexP2uiv;
        /* 1137 */ PFNGLVERTEXP3UIPROC VertexP3ui;
        /* 1138 */ PFNGLVERTEXP3UIVPROC VertexP3uiv;
        /* 1139 */ PFNGLVERTEXP4UIPROC VertexP4ui;
        /* 1140 */ PFNGLVERTEXP4UIVPROC VertexP4uiv;
        /* 1141 */ PFNGLDEPTHRANGEARRAYDVNVPROC DepthRangeArraydvNV;
        /* 1142 */ PFNGLDEPTHRANGEINDEXEDDNVPROC DepthRangeIndexeddNV;
        /* 1143 */ PFNGLWINDOWPOS2DARBPROC WindowPos2dARB;
        /* 1144 */ PFNGLWINDOWPOS2DVARBPROC WindowPos2dvARB;
        /* 1145 */ PFNGLWINDOWPOS2FARBPROC WindowPos2fARB;
        /* 1146 */ PFNGLWINDOWPOS2FVARBPROC WindowPos2fvARB;
        /* 1147 */ PFNGLWINDOWPOS2IARBPROC WindowPos2iARB;
        /* 1148 */ PFNGLWINDOWPOS2IVARBPROC WindowPos2ivARB;
        /* 1149 */ PFNGLWINDOWPOS2SARBPROC WindowPos2sARB;
        /* 1150 */ PFNGLWINDOWPOS2SVARBPROC WindowPos2svARB;
        /* 1151 */ PFNGLWINDOWPOS3DARBPROC WindowPos3dARB;
        /* 1152 */ PFNGLWINDOWPOS3DVARBPROC WindowPos3dvARB;
        /* 1153 */ PFNGLWINDOWPOS3FARBPROC WindowPos3fARB;
        /* 1154 */ PFNGLWINDOWPOS3FVARBPROC WindowPos3fvARB;
        /* 1155 */ PFNGLWINDOWPOS3IARBPROC WindowPos3iARB;
        /* 1156 */ PFNGLWINDOWPOS3IVARBPROC WindowPos3ivARB;
        /* 1157 */ PFNGLWINDOWPOS3SARBPROC WindowPos3sARB;
        /* 1158 */ PFNGLWINDOWPOS3SVARBPROC WindowPos3svARB;
        /* 1159 */ PFNGLMAXACTIVESHADERCORESARMPROC MaxActiveShaderCoresARM;
        /* 1160 */ PFNGLDRAWBUFFERSATIPROC DrawBuffersATI;
        /* 1161 */ PFNGLDRAWELEMENTARRAYATIPROC DrawElementArrayATI;
        /* 1162 */ PFNGLDRAWRANGEELEMENTARRAYATIPROC DrawRangeElementArrayATI;
        /* 1163 */ PFNGLELEMENTPOINTERATIPROC ElementPointerATI;
        /* 1164 */ PFNGLGETTEXBUMPPARAMETERFVATIPROC GetTexBumpParameterfvATI;
        /* 1165 */ PFNGLGETTEXBUMPPARAMETERIVATIPROC GetTexBumpParameterivATI;
        /* 1166 */ PFNGLTEXBUMPPARAMETERFVATIPROC TexBumpParameterfvATI;
        /* 1167 */ PFNGLTEXBUMPPARAMETERIVATIPROC TexBumpParameterivATI;
        /* 1168 */ PFNGLALPHAFRAGMENTOP1ATIPROC AlphaFragmentOp1ATI;
        /* 1169 */ PFNGLALPHAFRAGMENTOP2ATIPROC AlphaFragmentOp2ATI;
        /* 1170 */ PFNGLALPHAFRAGMENTOP3ATIPROC AlphaFragmentOp3ATI;
        /* 1171 */ PFNGLBEGINFRAGMENTSHADERATIPROC BeginFragmentShaderATI;
        /* 1172 */ PFNGLBINDFRAGMENTSHADERATIPROC BindFragmentShaderATI;
        /* 1173 */ PFNGLCOLORFRAGMENTOP1ATIPROC ColorFragmentOp1ATI;
        /* 1174 */ PFNGLCOLORFRAGMENTOP2ATIPROC ColorFragmentOp2ATI;
        /* 1175 */ PFNGLCOLORFRAGMENTOP3ATIPROC ColorFragmentOp3ATI;
        /* 1176 */ PFNGLDELETEFRAGMENTSHADERATIPROC DeleteFragmentShaderATI;
        /* 1177 */ PFNGLENDFRAGMENTSHADERATIPROC EndFragmentShaderATI;
        /* 1178 */ PFNGLGENFRAGMENTSHADERSATIPROC GenFragmentShadersATI;
        /* 1179 */ PFNGLPASSTEXCOORDATIPROC PassTexCoordATI;
        /* 1180 */ PFNGLSAMPLEMAPATIPROC SampleMapATI;
        /* 1181 */ PFNGLSETFRAGMENTSHADERCONSTANTATIPROC SetFragmentShaderConstantATI;
        /* 1182 */ PFNGLMAPOBJECTBUFFERATIPROC MapObjectBufferATI;
        /* 1183 */ PFNGLUNMAPOBJECTBUFFERATIPROC UnmapObjectBufferATI;
        /* 1184 */ PFNGLPNTRIANGLESFATIPROC PNTrianglesfATI;
        /* 1185 */ PFNGLPNTRIANGLESIATIPROC PNTrianglesiATI;
        /* 1186 */ PFNGLSTENCILFUNCSEPARATEATIPROC StencilFuncSeparateATI;
        /* 1187 */ PFNGLSTENCILOPSEPARATEATIPROC StencilOpSeparateATI;
        /* 1188 */ PFNGLARRAYOBJECTATIPROC ArrayObjectATI;
        /* 1189 */ PFNGLFREEOBJECTBUFFERATIPROC FreeObjectBufferATI;
        /* 1190 */ PFNGLGETARRAYOBJECTFVATIPROC GetArrayObjectfvATI;
        /* 1191 */ PFNGLGETARRAYOBJECTIVATIPROC GetArrayObjectivATI;
        /* 1192 */ PFNGLGETOBJECTBUFFERFVATIPROC GetObjectBufferfvATI;
        /* 1193 */ PFNGLGETOBJECTBUFFERIVATIPROC GetObjectBufferivATI;
        /* 1194 */ PFNGLGETVARIANTARRAYOBJECTFVATIPROC GetVariantArrayObjectfvATI;
        /* 1195 */ PFNGLGETVARIANTARRAYOBJECTIVATIPROC GetVariantArrayObjectivATI;
        /* 1196 */ PFNGLISOBJECTBUFFERATIPROC IsObjectBufferATI;
        /* 1197 */ PFNGLNEWOBJECTBUFFERATIPROC NewObjectBufferATI;
        /* 1198 */ PFNGLUPDATEOBJECTBUFFERATIPROC UpdateObjectBufferATI;
        /* 1199 */ PFNGLVARIANTARRAYOBJECTATIPROC VariantArrayObjectATI;
        /* 1200 */ PFNGLGETVERTEXATTRIBARRAYOBJECTFVATIPROC GetVertexAttribArrayObjectfvATI;
        /* 1201 */ PFNGLGETVERTEXATTRIBARRAYOBJECTIVATIPROC GetVertexAttribArrayObjectivATI;
        /* 1202 */ PFNGLVERTEXATTRIBARRAYOBJECTATIPROC VertexAttribArrayObjectATI;
        /* 1203 */ PFNGLCLIENTACTIVEVERTEXSTREAMATIPROC ClientActiveVertexStreamATI;
        /* 1204 */ PFNGLNORMALSTREAM3BATIPROC NormalStream3bATI;
        /* 1205 */ PFNGLNORMALSTREAM3BVATIPROC NormalStream3bvATI;
        /* 1206 */ PFNGLNORMALSTREAM3DATIPROC NormalStream3dATI;
        /* 1207 */ PFNGLNORMALSTREAM3DVATIPROC NormalStream3dvATI;
        /* 1208 */ PFNGLNORMALSTREAM3FATIPROC NormalStream3fATI;
        /* 1209 */ PFNGLNORMALSTREAM3FVATIPROC NormalStream3fvATI;
        /* 1210 */ PFNGLNORMALSTREAM3IATIPROC NormalStream3iATI;
        /* 1211 */ PFNGLNORMALSTREAM3IVATIPROC NormalStream3ivATI;
        /* 1212 */ PFNGLNORMALSTREAM3SATIPROC NormalStream3sATI;
        /* 1213 */ PFNGLNORMALSTREAM3SVATIPROC NormalStream3svATI;
        /* 1214 */ PFNGLVERTEXBLENDENVFATIPROC VertexBlendEnvfATI;
        /* 1215 */ PFNGLVERTEXBLENDENVIATIPROC VertexBlendEnviATI;
        /* 1216 */ PFNGLVERTEXSTREAM1DATIPROC VertexStream1dATI;
        /* 1217 */ PFNGLVERTEXSTREAM1DVATIPROC VertexStream1dvATI;
        /* 1218 */ PFNGLVERTEXSTREAM1FATIPROC VertexStream1fATI;
        /* 1219 */ PFNGLVERTEXSTREAM1FVATIPROC VertexStream1fvATI;
        /* 1220 */ PFNGLVERTEXSTREAM1IATIPROC VertexStream1iATI;
        /* 1221 */ PFNGLVERTEXSTREAM1IVATIPROC VertexStream1ivATI;
        /* 1222 */ PFNGLVERTEXSTREAM1SATIPROC VertexStream1sATI;
        /* 1223 */ PFNGLVERTEXSTREAM1SVATIPROC VertexStream1svATI;
        /* 1224 */ PFNGLVERTEXSTREAM2DATIPROC VertexStream2dATI;
        /* 1225 */ PFNGLVERTEXSTREAM2DVATIPROC VertexStream2dvATI;
        /* 1226 */ PFNGLVERTEXSTREAM2FATIPROC VertexStream2fATI;
        /* 1227 */ PFNGLVERTEXSTREAM2FVATIPROC VertexStream2fvATI;
        /* 1228 */ PFNGLVERTEXSTREAM2IATIPROC VertexStream2iATI;
        /* 1229 */ PFNGLVERTEXSTREAM2IVATIPROC VertexStream2ivATI;
        /* 1230 */ PFNGLVERTEXSTREAM2SATIPROC VertexStream2sATI;
        /* 1231 */ PFNGLVERTEXSTREAM2SVATIPROC VertexStream2svATI;
        /* 1232 */ PFNGLVERTEXSTREAM3DATIPROC VertexStream3dATI;
        /* 1233 */ PFNGLVERTEXSTREAM3DVATIPROC VertexStream3dvATI;
        /* 1234 */ PFNGLVERTEXSTREAM3FATIPROC VertexStream3fATI;
        /* 1235 */ PFNGLVERTEXSTREAM3FVATIPROC VertexStream3fvATI;
        /* 1236 */ PFNGLVERTEXSTREAM3IATIPROC VertexStream3iATI;
        /* 1237 */ PFNGLVERTEXSTREAM3IVATIPROC VertexStream3ivATI;
        /* 1238 */ PFNGLVERTEXSTREAM3SATIPROC VertexStream3sATI;
        /* 1239 */ PFNGLVERTEXSTREAM3SVATIPROC VertexStream3svATI;
        /* 1240 */ PFNGLVERTEXSTREAM4DATIPROC VertexStream4dATI;
        /* 1241 */ PFNGLVERTEXSTREAM4DVATIPROC VertexStream4dvATI;
        /* 1242 */ PFNGLVERTEXSTREAM4FATIPROC VertexStream4fATI;
        /* 1243 */ PFNGLVERTEXSTREAM4FVATIPROC VertexStream4fvATI;
        /* 1244 */ PFNGLVERTEXSTREAM4IATIPROC VertexStream4iATI;
        /* 1245 */ PFNGLVERTEXSTREAM4IVATIPROC VertexStream4ivATI;
        /* 1246 */ PFNGLVERTEXSTREAM4SATIPROC VertexStream4sATI;
        /* 1247 */ PFNGLVERTEXSTREAM4SVATIPROC VertexStream4svATI;
        /* 1248 */ PFNGLEGLIMAGETARGETTEXSTORAGEEXTPROC EGLImageTargetTexStorageEXT;
        /* 1249 */ PFNGLEGLIMAGETARGETTEXTURESTORAGEEXTPROC EGLImageTargetTextureStorageEXT;
        /* 1250 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEEXTPROC DrawArraysInstancedBaseInstanceEXT;
        /* 1251 */ PFNGLDRAWELEMENTSINSTANCEDBASEINSTANCEEXTPROC DrawElementsInstancedBaseInstanceEXT;
        /* 1252 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEEXTPROC DrawElementsInstancedBaseVertexBaseInstanceEXT;
        /* 1253 */ PFNGLGETUNIFORMBUFFERSIZEEXTPROC GetUniformBufferSizeEXT;
        /* 1254 */ PFNGLGETUNIFORMOFFSETEXTPROC GetUniformOffsetEXT;
        /* 1255 */ PFNGLUNIFORMBUFFEREXTPROC UniformBufferEXT;
        /* 1256 */ PFNGLBLENDCOLOREXTPROC BlendColorEXT;
        /* 1257 */ PFNGLBLENDEQUATIONSEPARATEEXTPROC BlendEquationSeparateEXT;
        /* 1258 */ PFNGLBINDFRAGDATALOCATIONINDEXEDEXTPROC BindFragDataLocationIndexedEXT;
        /* 1259 */ PFNGLGETFRAGDATAINDEXEXTPROC GetFragDataIndexEXT;
        /* 1260 */ PFNGLGETPROGRAMRESOURCELOCATIONINDEXEXTPROC GetProgramResourceLocationIndexEXT;
        /* 1261 */ PFNGLBINDFRAGDATALOCATIONEXTPROC BindFragDataLocationEXT;
        /* 1262 */ PFNGLBLENDFUNCSEPARATEEXTPROC BlendFuncSeparateEXT;
        /* 1263 */ PFNGLBLENDEQUATIONEXTPROC BlendEquationEXT;
        /* 1264 */ PFNGLBUFFERSTORAGEEXTPROC BufferStorageEXT;
        /* 1265 */ PFNGLCLEARTEXIMAGEEXTPROC ClearTexImageEXT;
        /* 1266 */ PFNGLCLEARTEXSUBIMAGEEXTPROC ClearTexSubImageEXT;
        /* 1267 */ PFNGLCLIPCONTROLEXTPROC ClipControlEXT;
        /* 1268 */ PFNGLCOLORSUBTABLEEXTPROC ColorSubTableEXT;
        /* 1269 */ PFNGLCOPYCOLORSUBTABLEEXTPROC CopyColorSubTableEXT;
        /* 1270 */ PFNGLLOCKARRAYSEXTPROC LockArraysEXT;
        /* 1271 */ PFNGLUNLOCKARRAYSEXTPROC UnlockArraysEXT;
        /* 1272 */ PFNGLCONVOLUTIONFILTER1DEXTPROC ConvolutionFilter1DEXT;
        /* 1273 */ PFNGLCONVOLUTIONFILTER2DEXTPROC ConvolutionFilter2DEXT;
        /* 1274 */ PFNGLCONVOLUTIONPARAMETERFEXTPROC ConvolutionParameterfEXT;
        /* 1275 */ PFNGLCONVOLUTIONPARAMETERFVEXTPROC ConvolutionParameterfvEXT;
        /* 1276 */ PFNGLCONVOLUTIONPARAMETERIEXTPROC ConvolutionParameteriEXT;
        /* 1277 */ PFNGLCONVOLUTIONPARAMETERIVEXTPROC ConvolutionParameterivEXT;
        /* 1278 */ PFNGLCOPYCONVOLUTIONFILTER1DEXTPROC CopyConvolutionFilter1DEXT;
        /* 1279 */ PFNGLCOPYCONVOLUTIONFILTER2DEXTPROC CopyConvolutionFilter2DEXT;
        /* 1280 */ PFNGLGETCONVOLUTIONFILTEREXTPROC GetConvolutionFilterEXT;
        /* 1281 */ PFNGLGETCONVOLUTIONPARAMETERFVEXTPROC GetConvolutionParameterfvEXT;
        /* 1282 */ PFNGLGETCONVOLUTIONPARAMETERIVEXTPROC GetConvolutionParameterivEXT;
        /* 1283 */ PFNGLGETSEPARABLEFILTEREXTPROC GetSeparableFilterEXT;
        /* 1284 */ PFNGLSEPARABLEFILTER2DEXTPROC SeparableFilter2DEXT;
        /* 1285 */ PFNGLBINORMAL3BEXTPROC Binormal3bEXT;
        /* 1286 */ PFNGLBINORMAL3BVEXTPROC Binormal3bvEXT;
        /* 1287 */ PFNGLBINORMAL3DEXTPROC Binormal3dEXT;
        /* 1288 */ PFNGLBINORMAL3DVEXTPROC Binormal3dvEXT;
        /* 1289 */ PFNGLBINORMAL3FEXTPROC Binormal3fEXT;
        /* 1290 */ PFNGLBINORMAL3FVEXTPROC Binormal3fvEXT;
        /* 1291 */ PFNGLBINORMAL3IEXTPROC Binormal3iEXT;
        /* 1292 */ PFNGLBINORMAL3IVEXTPROC Binormal3ivEXT;
        /* 1293 */ PFNGLBINORMAL3SEXTPROC Binormal3sEXT;
        /* 1294 */ PFNGLBINORMAL3SVEXTPROC Binormal3svEXT;
        /* 1295 */ PFNGLBINORMALPOINTEREXTPROC BinormalPointerEXT;
        /* 1296 */ PFNGLTANGENT3BEXTPROC Tangent3bEXT;
        /* 1297 */ PFNGLTANGENT3BVEXTPROC Tangent3bvEXT;
        /* 1298 */ PFNGLTANGENT3DEXTPROC Tangent3dEXT;
        /* 1299 */ PFNGLTANGENT3DVEXTPROC Tangent3dvEXT;
        /* 1300 */ PFNGLTANGENT3FEXTPROC Tangent3fEXT;
        /* 1301 */ PFNGLTANGENT3FVEXTPROC Tangent3fvEXT;
        /* 1302 */ PFNGLTANGENT3IEXTPROC Tangent3iEXT;
        /* 1303 */ PFNGLTANGENT3IVEXTPROC Tangent3ivEXT;
        /* 1304 */ PFNGLTANGENT3SEXTPROC Tangent3sEXT;
        /* 1305 */ PFNGLTANGENT3SVEXTPROC Tangent3svEXT;
        /* 1306 */ PFNGLTANGENTPOINTEREXTPROC TangentPointerEXT;
        /* 1307 */ PFNGLCOPYIMAGESUBDATAEXTPROC CopyImageSubDataEXT;
        /* 1308 */ PFNGLCOPYTEXIMAGE1DEXTPROC CopyTexImage1DEXT;
        /* 1309 */ PFNGLCOPYTEXIMAGE2DEXTPROC CopyTexImage2DEXT;
        /* 1310 */ PFNGLCOPYTEXSUBIMAGE1DEXTPROC CopyTexSubImage1DEXT;
        /* 1311 */ PFNGLCOPYTEXSUBIMAGE2DEXTPROC CopyTexSubImage2DEXT;
        /* 1312 */ PFNGLCOPYTEXSUBIMAGE3DEXTPROC CopyTexSubImage3DEXT;
        /* 1313 */ PFNGLCULLPARAMETERDVEXTPROC CullParameterdvEXT;
        /* 1314 */ PFNGLCULLPARAMETERFVEXTPROC CullParameterfvEXT;
        /* 1315 */ PFNGLGETOBJECTLABELEXTPROC GetObjectLabelEXT;
        /* 1316 */ PFNGLLABELOBJECTEXTPROC LabelObjectEXT;
        /* 1317 */ PFNGLINSERTEVENTMARKEREXTPROC InsertEventMarkerEXT;
        /* 1318 */ PFNGLPOPGROUPMARKEREXTPROC PopGroupMarkerEXT;
        /* 1319 */ PFNGLPUSHGROUPMARKEREXTPROC PushGroupMarkerEXT;
        /* 1320 */ PFNGLDEPTHBOUNDSEXTPROC DepthBoundsEXT;
        /* 1321 */ PFNGLBINDMULTITEXTUREEXTPROC BindMultiTextureEXT;
        /* 1322 */ PFNGLCHECKNAMEDFRAMEBUFFERSTATUSEXTPROC CheckNamedFramebufferStatusEXT;
        /* 1323 */ PFNGLCLEARNAMEDBUFFERDATAEXTPROC ClearNamedBufferDataEXT;
        /* 1324 */ PFNGLCLEARNAMEDBUFFERSUBDATAEXTPROC ClearNamedBufferSubDataEXT;
        /* 1325 */ PFNGLCLIENTATTRIBDEFAULTEXTPROC ClientAttribDefaultEXT;
        /* 1326 */ PFNGLCOMPRESSEDMULTITEXIMAGE1DEXTPROC CompressedMultiTexImage1DEXT;
        /* 1327 */ PFNGLCOMPRESSEDMULTITEXIMAGE2DEXTPROC CompressedMultiTexImage2DEXT;
        /* 1328 */ PFNGLCOMPRESSEDMULTITEXIMAGE3DEXTPROC CompressedMultiTexImage3DEXT;
        /* 1329 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE1DEXTPROC CompressedMultiTexSubImage1DEXT;
        /* 1330 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE2DEXTPROC CompressedMultiTexSubImage2DEXT;
        /* 1331 */ PFNGLCOMPRESSEDMULTITEXSUBIMAGE3DEXTPROC CompressedMultiTexSubImage3DEXT;
        /* 1332 */ PFNGLCOMPRESSEDTEXTUREIMAGE1DEXTPROC CompressedTextureImage1DEXT;
        /* 1333 */ PFNGLCOMPRESSEDTEXTUREIMAGE2DEXTPROC CompressedTextureImage2DEXT;
        /* 1334 */ PFNGLCOMPRESSEDTEXTUREIMAGE3DEXTPROC CompressedTextureImage3DEXT;
        /* 1335 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE1DEXTPROC CompressedTextureSubImage1DEXT;
        /* 1336 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE2DEXTPROC CompressedTextureSubImage2DEXT;
        /* 1337 */ PFNGLCOMPRESSEDTEXTURESUBIMAGE3DEXTPROC CompressedTextureSubImage3DEXT;
        /* 1338 */ PFNGLCOPYMULTITEXIMAGE1DEXTPROC CopyMultiTexImage1DEXT;
        /* 1339 */ PFNGLCOPYMULTITEXIMAGE2DEXTPROC CopyMultiTexImage2DEXT;
        /* 1340 */ PFNGLCOPYMULTITEXSUBIMAGE1DEXTPROC CopyMultiTexSubImage1DEXT;
        /* 1341 */ PFNGLCOPYMULTITEXSUBIMAGE2DEXTPROC CopyMultiTexSubImage2DEXT;
        /* 1342 */ PFNGLCOPYMULTITEXSUBIMAGE3DEXTPROC CopyMultiTexSubImage3DEXT;
        /* 1343 */ PFNGLCOPYTEXTUREIMAGE1DEXTPROC CopyTextureImage1DEXT;
        /* 1344 */ PFNGLCOPYTEXTUREIMAGE2DEXTPROC CopyTextureImage2DEXT;
        /* 1345 */ PFNGLCOPYTEXTURESUBIMAGE1DEXTPROC CopyTextureSubImage1DEXT;
        /* 1346 */ PFNGLCOPYTEXTURESUBIMAGE2DEXTPROC CopyTextureSubImage2DEXT;
        /* 1347 */ PFNGLCOPYTEXTURESUBIMAGE3DEXTPROC CopyTextureSubImage3DEXT;
        /* 1348 */ PFNGLDISABLECLIENTSTATEINDEXEDEXTPROC DisableClientStateIndexedEXT;
        /* 1349 */ PFNGLDISABLECLIENTSTATEIEXTPROC DisableClientStateiEXT;
        /* 1350 */ PFNGLDISABLEVERTEXARRAYATTRIBEXTPROC DisableVertexArrayAttribEXT;
        /* 1351 */ PFNGLDISABLEVERTEXARRAYEXTPROC DisableVertexArrayEXT;
        /* 1352 */ PFNGLENABLECLIENTSTATEINDEXEDEXTPROC EnableClientStateIndexedEXT;
        /* 1353 */ PFNGLENABLECLIENTSTATEIEXTPROC EnableClientStateiEXT;
        /* 1354 */ PFNGLENABLEVERTEXARRAYATTRIBEXTPROC EnableVertexArrayAttribEXT;
        /* 1355 */ PFNGLENABLEVERTEXARRAYEXTPROC EnableVertexArrayEXT;
        /* 1356 */ PFNGLFLUSHMAPPEDNAMEDBUFFERRANGEEXTPROC FlushMappedNamedBufferRangeEXT;
        /* 1357 */ PFNGLFRAMEBUFFERDRAWBUFFEREXTPROC FramebufferDrawBufferEXT;
        /* 1358 */ PFNGLFRAMEBUFFERDRAWBUFFERSEXTPROC FramebufferDrawBuffersEXT;
        /* 1359 */ PFNGLFRAMEBUFFERREADBUFFEREXTPROC FramebufferReadBufferEXT;
        /* 1360 */ PFNGLGENERATEMULTITEXMIPMAPEXTPROC GenerateMultiTexMipmapEXT;
        /* 1361 */ PFNGLGENERATETEXTUREMIPMAPEXTPROC GenerateTextureMipmapEXT;
        /* 1362 */ PFNGLGETCOMPRESSEDMULTITEXIMAGEEXTPROC GetCompressedMultiTexImageEXT;
        /* 1363 */ PFNGLGETCOMPRESSEDTEXTUREIMAGEEXTPROC GetCompressedTextureImageEXT;
        /* 1364 */ PFNGLGETDOUBLEINDEXEDVEXTPROC GetDoubleIndexedvEXT;
        /* 1365 */ PFNGLGETDOUBLEI_VEXTPROC GetDoublei_vEXT;
        /* 1366 */ PFNGLGETFLOATINDEXEDVEXTPROC GetFloatIndexedvEXT;
        /* 1367 */ PFNGLGETFLOATI_VEXTPROC GetFloati_vEXT;
        /* 1368 */ PFNGLGETFRAMEBUFFERPARAMETERIVEXTPROC GetFramebufferParameterivEXT;
        /* 1369 */ PFNGLGETMULTITEXENVFVEXTPROC GetMultiTexEnvfvEXT;
        /* 1370 */ PFNGLGETMULTITEXENVIVEXTPROC GetMultiTexEnvivEXT;
        /* 1371 */ PFNGLGETMULTITEXGENDVEXTPROC GetMultiTexGendvEXT;
        /* 1372 */ PFNGLGETMULTITEXGENFVEXTPROC GetMultiTexGenfvEXT;
        /* 1373 */ PFNGLGETMULTITEXGENIVEXTPROC GetMultiTexGenivEXT;
        /* 1374 */ PFNGLGETMULTITEXIMAGEEXTPROC GetMultiTexImageEXT;
        /* 1375 */ PFNGLGETMULTITEXLEVELPARAMETERFVEXTPROC GetMultiTexLevelParameterfvEXT;
        /* 1376 */ PFNGLGETMULTITEXLEVELPARAMETERIVEXTPROC GetMultiTexLevelParameterivEXT;
        /* 1377 */ PFNGLGETMULTITEXPARAMETERIIVEXTPROC GetMultiTexParameterIivEXT;
        /* 1378 */ PFNGLGETMULTITEXPARAMETERIUIVEXTPROC GetMultiTexParameterIuivEXT;
        /* 1379 */ PFNGLGETMULTITEXPARAMETERFVEXTPROC GetMultiTexParameterfvEXT;
        /* 1380 */ PFNGLGETMULTITEXPARAMETERIVEXTPROC GetMultiTexParameterivEXT;
        /* 1381 */ PFNGLGETNAMEDBUFFERPARAMETERIVEXTPROC GetNamedBufferParameterivEXT;
        /* 1382 */ PFNGLGETNAMEDBUFFERPOINTERVEXTPROC GetNamedBufferPointervEXT;
        /* 1383 */ PFNGLGETNAMEDBUFFERSUBDATAEXTPROC GetNamedBufferSubDataEXT;
        /* 1384 */ PFNGLGETNAMEDFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetNamedFramebufferAttachmentParameterivEXT;
        /* 1385 */ PFNGLGETNAMEDFRAMEBUFFERPARAMETERIVEXTPROC GetNamedFramebufferParameterivEXT;
        /* 1386 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIIVEXTPROC GetNamedProgramLocalParameterIivEXT;
        /* 1387 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERIUIVEXTPROC GetNamedProgramLocalParameterIuivEXT;
        /* 1388 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERDVEXTPROC GetNamedProgramLocalParameterdvEXT;
        /* 1389 */ PFNGLGETNAMEDPROGRAMLOCALPARAMETERFVEXTPROC GetNamedProgramLocalParameterfvEXT;
        /* 1390 */ PFNGLGETNAMEDPROGRAMSTRINGEXTPROC GetNamedProgramStringEXT;
        /* 1391 */ PFNGLGETNAMEDPROGRAMIVEXTPROC GetNamedProgramivEXT;
        /* 1392 */ PFNGLGETNAMEDRENDERBUFFERPARAMETERIVEXTPROC GetNamedRenderbufferParameterivEXT;
        /* 1393 */ PFNGLGETPOINTERINDEXEDVEXTPROC GetPointerIndexedvEXT;
        /* 1394 */ PFNGLGETPOINTERI_VEXTPROC GetPointeri_vEXT;
        /* 1395 */ PFNGLGETTEXTUREIMAGEEXTPROC GetTextureImageEXT;
        /* 1396 */ PFNGLGETTEXTURELEVELPARAMETERFVEXTPROC GetTextureLevelParameterfvEXT;
        /* 1397 */ PFNGLGETTEXTURELEVELPARAMETERIVEXTPROC GetTextureLevelParameterivEXT;
        /* 1398 */ PFNGLGETTEXTUREPARAMETERIIVEXTPROC GetTextureParameterIivEXT;
        /* 1399 */ PFNGLGETTEXTUREPARAMETERIUIVEXTPROC GetTextureParameterIuivEXT;
        /* 1400 */ PFNGLGETTEXTUREPARAMETERFVEXTPROC GetTextureParameterfvEXT;
        /* 1401 */ PFNGLGETTEXTUREPARAMETERIVEXTPROC GetTextureParameterivEXT;
        /* 1402 */ PFNGLGETVERTEXARRAYINTEGERI_VEXTPROC GetVertexArrayIntegeri_vEXT;
        /* 1403 */ PFNGLGETVERTEXARRAYINTEGERVEXTPROC GetVertexArrayIntegervEXT;
        /* 1404 */ PFNGLGETVERTEXARRAYPOINTERI_VEXTPROC GetVertexArrayPointeri_vEXT;
        /* 1405 */ PFNGLGETVERTEXARRAYPOINTERVEXTPROC GetVertexArrayPointervEXT;
        /* 1406 */ PFNGLMAPNAMEDBUFFEREXTPROC MapNamedBufferEXT;
        /* 1407 */ PFNGLMAPNAMEDBUFFERRANGEEXTPROC MapNamedBufferRangeEXT;
        /* 1408 */ PFNGLMULTITEXBUFFEREXTPROC MultiTexBufferEXT;
        /* 1409 */ PFNGLMULTITEXCOORDPOINTEREXTPROC MultiTexCoordPointerEXT;
        /* 1410 */ PFNGLMULTITEXENVFEXTPROC MultiTexEnvfEXT;
        /* 1411 */ PFNGLMULTITEXENVFVEXTPROC MultiTexEnvfvEXT;
        /* 1412 */ PFNGLMULTITEXENVIEXTPROC MultiTexEnviEXT;
        /* 1413 */ PFNGLMULTITEXENVIVEXTPROC MultiTexEnvivEXT;
        /* 1414 */ PFNGLMULTITEXGENDEXTPROC MultiTexGendEXT;
        /* 1415 */ PFNGLMULTITEXGENDVEXTPROC MultiTexGendvEXT;
        /* 1416 */ PFNGLMULTITEXGENFEXTPROC MultiTexGenfEXT;
        /* 1417 */ PFNGLMULTITEXGENFVEXTPROC MultiTexGenfvEXT;
        /* 1418 */ PFNGLMULTITEXGENIEXTPROC MultiTexGeniEXT;
        /* 1419 */ PFNGLMULTITEXGENIVEXTPROC MultiTexGenivEXT;
        /* 1420 */ PFNGLMULTITEXIMAGE1DEXTPROC MultiTexImage1DEXT;
        /* 1421 */ PFNGLMULTITEXIMAGE2DEXTPROC MultiTexImage2DEXT;
        /* 1422 */ PFNGLMULTITEXIMAGE3DEXTPROC MultiTexImage3DEXT;
        /* 1423 */ PFNGLMULTITEXPARAMETERIIVEXTPROC MultiTexParameterIivEXT;
        /* 1424 */ PFNGLMULTITEXPARAMETERIUIVEXTPROC MultiTexParameterIuivEXT;
        /* 1425 */ PFNGLMULTITEXPARAMETERFEXTPROC MultiTexParameterfEXT;
        /* 1426 */ PFNGLMULTITEXPARAMETERFVEXTPROC MultiTexParameterfvEXT;
        /* 1427 */ PFNGLMULTITEXPARAMETERIEXTPROC MultiTexParameteriEXT;
        /* 1428 */ PFNGLMULTITEXPARAMETERIVEXTPROC MultiTexParameterivEXT;
        /* 1429 */ PFNGLMULTITEXRENDERBUFFEREXTPROC MultiTexRenderbufferEXT;
        /* 1430 */ PFNGLMULTITEXSUBIMAGE1DEXTPROC MultiTexSubImage1DEXT;
        /* 1431 */ PFNGLMULTITEXSUBIMAGE2DEXTPROC MultiTexSubImage2DEXT;
        /* 1432 */ PFNGLMULTITEXSUBIMAGE3DEXTPROC MultiTexSubImage3DEXT;
        /* 1433 */ PFNGLNAMEDBUFFERDATAEXTPROC NamedBufferDataEXT;
        /* 1434 */ PFNGLNAMEDBUFFERSTORAGEEXTPROC NamedBufferStorageEXT;
        /* 1435 */ PFNGLNAMEDBUFFERSUBDATAEXTPROC NamedBufferSubDataEXT;
        /* 1436 */ PFNGLNAMEDCOPYBUFFERSUBDATAEXTPROC NamedCopyBufferSubDataEXT;
        /* 1437 */ PFNGLNAMEDFRAMEBUFFERPARAMETERIEXTPROC NamedFramebufferParameteriEXT;
        /* 1438 */ PFNGLNAMEDFRAMEBUFFERRENDERBUFFEREXTPROC NamedFramebufferRenderbufferEXT;
        /* 1439 */ PFNGLNAMEDFRAMEBUFFERTEXTURE1DEXTPROC NamedFramebufferTexture1DEXT;
        /* 1440 */ PFNGLNAMEDFRAMEBUFFERTEXTURE2DEXTPROC NamedFramebufferTexture2DEXT;
        /* 1441 */ PFNGLNAMEDFRAMEBUFFERTEXTURE3DEXTPROC NamedFramebufferTexture3DEXT;
        /* 1442 */ PFNGLNAMEDFRAMEBUFFERTEXTUREEXTPROC NamedFramebufferTextureEXT;
        /* 1443 */ PFNGLNAMEDFRAMEBUFFERTEXTUREFACEEXTPROC NamedFramebufferTextureFaceEXT;
        /* 1444 */ PFNGLNAMEDFRAMEBUFFERTEXTURELAYEREXTPROC NamedFramebufferTextureLayerEXT;
        /* 1445 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DEXTPROC NamedProgramLocalParameter4dEXT;
        /* 1446 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4DVEXTPROC NamedProgramLocalParameter4dvEXT;
        /* 1447 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FEXTPROC NamedProgramLocalParameter4fEXT;
        /* 1448 */ PFNGLNAMEDPROGRAMLOCALPARAMETER4FVEXTPROC NamedProgramLocalParameter4fvEXT;
        /* 1449 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IEXTPROC NamedProgramLocalParameterI4iEXT;
        /* 1450 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4IVEXTPROC NamedProgramLocalParameterI4ivEXT;
        /* 1451 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIEXTPROC NamedProgramLocalParameterI4uiEXT;
        /* 1452 */ PFNGLNAMEDPROGRAMLOCALPARAMETERI4UIVEXTPROC NamedProgramLocalParameterI4uivEXT;
        /* 1453 */ PFNGLNAMEDPROGRAMLOCALPARAMETERS4FVEXTPROC NamedProgramLocalParameters4fvEXT;
        /* 1454 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4IVEXTPROC NamedProgramLocalParametersI4ivEXT;
        /* 1455 */ PFNGLNAMEDPROGRAMLOCALPARAMETERSI4UIVEXTPROC NamedProgramLocalParametersI4uivEXT;
        /* 1456 */ PFNGLNAMEDPROGRAMSTRINGEXTPROC NamedProgramStringEXT;
        /* 1457 */ PFNGLNAMEDRENDERBUFFERSTORAGEEXTPROC NamedRenderbufferStorageEXT;
        /* 1458 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLECOVERAGEEXTPROC NamedRenderbufferStorageMultisampleCoverageEXT;
        /* 1459 */ PFNGLNAMEDRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC NamedRenderbufferStorageMultisampleEXT;
        /* 1460 */ PFNGLPROGRAMUNIFORM1DEXTPROC ProgramUniform1dEXT;
        /* 1461 */ PFNGLPROGRAMUNIFORM1DVEXTPROC ProgramUniform1dvEXT;
        /* 1462 */ PFNGLPROGRAMUNIFORM2DEXTPROC ProgramUniform2dEXT;
        /* 1463 */ PFNGLPROGRAMUNIFORM2DVEXTPROC ProgramUniform2dvEXT;
        /* 1464 */ PFNGLPROGRAMUNIFORM3DEXTPROC ProgramUniform3dEXT;
        /* 1465 */ PFNGLPROGRAMUNIFORM3DVEXTPROC ProgramUniform3dvEXT;
        /* 1466 */ PFNGLPROGRAMUNIFORM4DEXTPROC ProgramUniform4dEXT;
        /* 1467 */ PFNGLPROGRAMUNIFORM4DVEXTPROC ProgramUniform4dvEXT;
        /* 1468 */ PFNGLPROGRAMUNIFORMMATRIX2DVEXTPROC ProgramUniformMatrix2dvEXT;
        /* 1469 */ PFNGLPROGRAMUNIFORMMATRIX2X3DVEXTPROC ProgramUniformMatrix2x3dvEXT;
        /* 1470 */ PFNGLPROGRAMUNIFORMMATRIX2X4DVEXTPROC ProgramUniformMatrix2x4dvEXT;
        /* 1471 */ PFNGLPROGRAMUNIFORMMATRIX3DVEXTPROC ProgramUniformMatrix3dvEXT;
        /* 1472 */ PFNGLPROGRAMUNIFORMMATRIX3X2DVEXTPROC ProgramUniformMatrix3x2dvEXT;
        /* 1473 */ PFNGLPROGRAMUNIFORMMATRIX3X4DVEXTPROC ProgramUniformMatrix3x4dvEXT;
        /* 1474 */ PFNGLPROGRAMUNIFORMMATRIX4DVEXTPROC ProgramUniformMatrix4dvEXT;
        /* 1475 */ PFNGLPROGRAMUNIFORMMATRIX4X2DVEXTPROC ProgramUniformMatrix4x2dvEXT;
        /* 1476 */ PFNGLPROGRAMUNIFORMMATRIX4X3DVEXTPROC ProgramUniformMatrix4x3dvEXT;
        /* 1477 */ PFNGLPUSHCLIENTATTRIBDEFAULTEXTPROC PushClientAttribDefaultEXT;
        /* 1478 */ PFNGLTEXTUREBUFFEREXTPROC TextureBufferEXT;
        /* 1479 */ PFNGLTEXTUREBUFFERRANGEEXTPROC TextureBufferRangeEXT;
        /* 1480 */ PFNGLTEXTUREIMAGE1DEXTPROC TextureImage1DEXT;
        /* 1481 */ PFNGLTEXTUREIMAGE2DEXTPROC TextureImage2DEXT;
        /* 1482 */ PFNGLTEXTUREIMAGE3DEXTPROC TextureImage3DEXT;
        /* 1483 */ PFNGLTEXTUREPAGECOMMITMENTEXTPROC TexturePageCommitmentEXT;
        /* 1484 */ PFNGLTEXTUREPARAMETERIIVEXTPROC TextureParameterIivEXT;
        /* 1485 */ PFNGLTEXTUREPARAMETERIUIVEXTPROC TextureParameterIuivEXT;
        /* 1486 */ PFNGLTEXTUREPARAMETERFEXTPROC TextureParameterfEXT;
        /* 1487 */ PFNGLTEXTUREPARAMETERFVEXTPROC TextureParameterfvEXT;
        /* 1488 */ PFNGLTEXTUREPARAMETERIEXTPROC TextureParameteriEXT;
        /* 1489 */ PFNGLTEXTUREPARAMETERIVEXTPROC TextureParameterivEXT;
        /* 1490 */ PFNGLTEXTURERENDERBUFFEREXTPROC TextureRenderbufferEXT;
        /* 1491 */ PFNGLTEXTURESTORAGE2DMULTISAMPLEEXTPROC TextureStorage2DMultisampleEXT;
        /* 1492 */ PFNGLTEXTURESTORAGE3DMULTISAMPLEEXTPROC TextureStorage3DMultisampleEXT;
        /* 1493 */ PFNGLTEXTURESUBIMAGE1DEXTPROC TextureSubImage1DEXT;
        /* 1494 */ PFNGLTEXTURESUBIMAGE2DEXTPROC TextureSubImage2DEXT;
        /* 1495 */ PFNGLTEXTURESUBIMAGE3DEXTPROC TextureSubImage3DEXT;
        /* 1496 */ PFNGLUNMAPNAMEDBUFFEREXTPROC UnmapNamedBufferEXT;
        /* 1497 */ PFNGLVERTEXARRAYBINDVERTEXBUFFEREXTPROC VertexArrayBindVertexBufferEXT;
        /* 1498 */ PFNGLVERTEXARRAYCOLOROFFSETEXTPROC VertexArrayColorOffsetEXT;
        /* 1499 */ PFNGLVERTEXARRAYEDGEFLAGOFFSETEXTPROC VertexArrayEdgeFlagOffsetEXT;
        /* 1500 */ PFNGLVERTEXARRAYFOGCOORDOFFSETEXTPROC VertexArrayFogCoordOffsetEXT;
        /* 1501 */ PFNGLVERTEXARRAYINDEXOFFSETEXTPROC VertexArrayIndexOffsetEXT;
        /* 1502 */ PFNGLVERTEXARRAYMULTITEXCOORDOFFSETEXTPROC VertexArrayMultiTexCoordOffsetEXT;
        /* 1503 */ PFNGLVERTEXARRAYNORMALOFFSETEXTPROC VertexArrayNormalOffsetEXT;
        /* 1504 */ PFNGLVERTEXARRAYSECONDARYCOLOROFFSETEXTPROC VertexArraySecondaryColorOffsetEXT;
        /* 1505 */ PFNGLVERTEXARRAYTEXCOORDOFFSETEXTPROC VertexArrayTexCoordOffsetEXT;
        /* 1506 */ PFNGLVERTEXARRAYVERTEXATTRIBBINDINGEXTPROC VertexArrayVertexAttribBindingEXT;
        /* 1507 */ PFNGLVERTEXARRAYVERTEXATTRIBDIVISOREXTPROC VertexArrayVertexAttribDivisorEXT;
        /* 1508 */ PFNGLVERTEXARRAYVERTEXATTRIBFORMATEXTPROC VertexArrayVertexAttribFormatEXT;
        /* 1509 */ PFNGLVERTEXARRAYVERTEXATTRIBIFORMATEXTPROC VertexArrayVertexAttribIFormatEXT;
        /* 1510 */ PFNGLVERTEXARRAYVERTEXATTRIBIOFFSETEXTPROC VertexArrayVertexAttribIOffsetEXT;
        /* 1511 */ PFNGLVERTEXARRAYVERTEXATTRIBLFORMATEXTPROC VertexArrayVertexAttribLFormatEXT;
        /* 1512 */ PFNGLVERTEXARRAYVERTEXATTRIBLOFFSETEXTPROC VertexArrayVertexAttribLOffsetEXT;
        /* 1513 */ PFNGLVERTEXARRAYVERTEXATTRIBOFFSETEXTPROC VertexArrayVertexAttribOffsetEXT;
        /* 1514 */ PFNGLVERTEXARRAYVERTEXBINDINGDIVISOREXTPROC VertexArrayVertexBindingDivisorEXT;
        /* 1515 */ PFNGLVERTEXARRAYVERTEXOFFSETEXTPROC VertexArrayVertexOffsetEXT;
        /* 1516 */ PFNGLDISABLEINDEXEDEXTPROC DisableIndexedEXT;
        /* 1517 */ PFNGLENABLEINDEXEDEXTPROC EnableIndexedEXT;
        /* 1518 */ PFNGLGETBOOLEANINDEXEDVEXTPROC GetBooleanIndexedvEXT;
        /* 1519 */ PFNGLGETINTEGERINDEXEDVEXTPROC GetIntegerIndexedvEXT;
        /* 1520 */ PFNGLISENABLEDINDEXEDEXTPROC IsEnabledIndexedEXT;
        /* 1521 */ PFNGLPROGRAMUNIFORM1FEXTPROC ProgramUniform1fEXT;
        /* 1522 */ PFNGLPROGRAMUNIFORM1FVEXTPROC ProgramUniform1fvEXT;
        /* 1523 */ PFNGLPROGRAMUNIFORM1IEXTPROC ProgramUniform1iEXT;
        /* 1524 */ PFNGLPROGRAMUNIFORM1IVEXTPROC ProgramUniform1ivEXT;
        /* 1525 */ PFNGLPROGRAMUNIFORM1UIEXTPROC ProgramUniform1uiEXT;
        /* 1526 */ PFNGLPROGRAMUNIFORM1UIVEXTPROC ProgramUniform1uivEXT;
        /* 1527 */ PFNGLPROGRAMUNIFORM2FEXTPROC ProgramUniform2fEXT;
        /* 1528 */ PFNGLPROGRAMUNIFORM2FVEXTPROC ProgramUniform2fvEXT;
        /* 1529 */ PFNGLPROGRAMUNIFORM2IEXTPROC ProgramUniform2iEXT;
        /* 1530 */ PFNGLPROGRAMUNIFORM2IVEXTPROC ProgramUniform2ivEXT;
        /* 1531 */ PFNGLPROGRAMUNIFORM2UIEXTPROC ProgramUniform2uiEXT;
        /* 1532 */ PFNGLPROGRAMUNIFORM2UIVEXTPROC ProgramUniform2uivEXT;
        /* 1533 */ PFNGLPROGRAMUNIFORM3FEXTPROC ProgramUniform3fEXT;
        /* 1534 */ PFNGLPROGRAMUNIFORM3FVEXTPROC ProgramUniform3fvEXT;
        /* 1535 */ PFNGLPROGRAMUNIFORM3IEXTPROC ProgramUniform3iEXT;
        /* 1536 */ PFNGLPROGRAMUNIFORM3IVEXTPROC ProgramUniform3ivEXT;
        /* 1537 */ PFNGLPROGRAMUNIFORM3UIEXTPROC ProgramUniform3uiEXT;
        /* 1538 */ PFNGLPROGRAMUNIFORM3UIVEXTPROC ProgramUniform3uivEXT;
        /* 1539 */ PFNGLPROGRAMUNIFORM4FEXTPROC ProgramUniform4fEXT;
        /* 1540 */ PFNGLPROGRAMUNIFORM4FVEXTPROC ProgramUniform4fvEXT;
        /* 1541 */ PFNGLPROGRAMUNIFORM4IEXTPROC ProgramUniform4iEXT;
        /* 1542 */ PFNGLPROGRAMUNIFORM4IVEXTPROC ProgramUniform4ivEXT;
        /* 1543 */ PFNGLPROGRAMUNIFORM4UIEXTPROC ProgramUniform4uiEXT;
        /* 1544 */ PFNGLPROGRAMUNIFORM4UIVEXTPROC ProgramUniform4uivEXT;
        /* 1545 */ PFNGLPROGRAMUNIFORMMATRIX2FVEXTPROC ProgramUniformMatrix2fvEXT;
        /* 1546 */ PFNGLPROGRAMUNIFORMMATRIX2X3FVEXTPROC ProgramUniformMatrix2x3fvEXT;
        /* 1547 */ PFNGLPROGRAMUNIFORMMATRIX2X4FVEXTPROC ProgramUniformMatrix2x4fvEXT;
        /* 1548 */ PFNGLPROGRAMUNIFORMMATRIX3FVEXTPROC ProgramUniformMatrix3fvEXT;
        /* 1549 */ PFNGLPROGRAMUNIFORMMATRIX3X2FVEXTPROC ProgramUniformMatrix3x2fvEXT;
        /* 1550 */ PFNGLPROGRAMUNIFORMMATRIX3X4FVEXTPROC ProgramUniformMatrix3x4fvEXT;
        /* 1551 */ PFNGLPROGRAMUNIFORMMATRIX4FVEXTPROC ProgramUniformMatrix4fvEXT;
        /* 1552 */ PFNGLPROGRAMUNIFORMMATRIX4X2FVEXTPROC ProgramUniformMatrix4x2fvEXT;
        /* 1553 */ PFNGLPROGRAMUNIFORMMATRIX4X3FVEXTPROC ProgramUniformMatrix4x3fvEXT;
        /* 1554 */ PFNGLTEXTURESTORAGE1DEXTPROC TextureStorage1DEXT;
        /* 1555 */ PFNGLTEXTURESTORAGE2DEXTPROC TextureStorage2DEXT;
        /* 1556 */ PFNGLTEXTURESTORAGE3DEXTPROC TextureStorage3DEXT;
        /* 1557 */ PFNGLMATRIXFRUSTUMEXTPROC MatrixFrustumEXT;
        /* 1558 */ PFNGLMATRIXLOADIDENTITYEXTPROC MatrixLoadIdentityEXT;
        /* 1559 */ PFNGLMATRIXLOADTRANSPOSEDEXTPROC MatrixLoadTransposedEXT;
        /* 1560 */ PFNGLMATRIXLOADTRANSPOSEFEXTPROC MatrixLoadTransposefEXT;
        /* 1561 */ PFNGLMATRIXLOADDEXTPROC MatrixLoaddEXT;
        /* 1562 */ PFNGLMATRIXLOADFEXTPROC MatrixLoadfEXT;
        /* 1563 */ PFNGLMATRIXMULTTRANSPOSEDEXTPROC MatrixMultTransposedEXT;
        /* 1564 */ PFNGLMATRIXMULTTRANSPOSEFEXTPROC MatrixMultTransposefEXT;
        /* 1565 */ PFNGLMATRIXMULTDEXTPROC MatrixMultdEXT;
        /* 1566 */ PFNGLMATRIXMULTFEXTPROC MatrixMultfEXT;
        /* 1567 */ PFNGLMATRIXORTHOEXTPROC MatrixOrthoEXT;
        /* 1568 */ PFNGLMATRIXPOPEXTPROC MatrixPopEXT;
        /* 1569 */ PFNGLMATRIXPUSHEXTPROC MatrixPushEXT;
        /* 1570 */ PFNGLMATRIXROTATEDEXTPROC MatrixRotatedEXT;
        /* 1571 */ PFNGLMATRIXROTATEFEXTPROC MatrixRotatefEXT;
        /* 1572 */ PFNGLMATRIXSCALEDEXTPROC MatrixScaledEXT;
        /* 1573 */ PFNGLMATRIXSCALEFEXTPROC MatrixScalefEXT;
        /* 1574 */ PFNGLMATRIXTRANSLATEDEXTPROC MatrixTranslatedEXT;
        /* 1575 */ PFNGLMATRIXTRANSLATEFEXTPROC MatrixTranslatefEXT;
        /* 1576 */ PFNGLDISCARDFRAMEBUFFEREXTPROC DiscardFramebufferEXT;
        /* 1577 */ PFNGLGETINTEGER64VEXTPROC GetInteger64vEXT;
        /* 1578 */ PFNGLGETQUERYOBJECTIVEXTPROC GetQueryObjectivEXT;
        /* 1579 */ PFNGLQUERYCOUNTEREXTPROC QueryCounterEXT;
        /* 1580 */ PFNGLBEGINQUERYEXTPROC BeginQueryEXT;
        /* 1581 */ PFNGLDELETEQUERIESEXTPROC DeleteQueriesEXT;
        /* 1582 */ PFNGLENDQUERYEXTPROC EndQueryEXT;
        /* 1583 */ PFNGLGENQUERIESEXTPROC GenQueriesEXT;
        /* 1584 */ PFNGLGETQUERYOBJECTUIVEXTPROC GetQueryObjectuivEXT;
        /* 1585 */ PFNGLGETQUERYIVEXTPROC GetQueryivEXT;
        /* 1586 */ PFNGLISQUERYEXTPROC IsQueryEXT;
        /* 1587 */ PFNGLGETQUERYOBJECTI64VEXTPROC GetQueryObjecti64vEXT;
        /* 1588 */ PFNGLGETQUERYOBJECTUI64VEXTPROC GetQueryObjectui64vEXT;
        /* 1589 */ PFNGLDRAWBUFFERSEXTPROC DrawBuffersEXT;
        /* 1590 */ PFNGLCOLORMASKINDEXEDEXTPROC ColorMaskIndexedEXT;
        /* 1591 */ PFNGLBLENDEQUATIONSEPARATEIEXTPROC BlendEquationSeparateiEXT;
        /* 1592 */ PFNGLBLENDEQUATIONIEXTPROC BlendEquationiEXT;
        /* 1593 */ PFNGLBLENDFUNCSEPARATEIEXTPROC BlendFuncSeparateiEXT;
        /* 1594 */ PFNGLBLENDFUNCIEXTPROC BlendFunciEXT;
        /* 1595 */ PFNGLCOLORMASKIEXTPROC ColorMaskiEXT;
        /* 1596 */ PFNGLDISABLEIEXTPROC DisableiEXT;
        /* 1597 */ PFNGLENABLEIEXTPROC EnableiEXT;
        /* 1598 */ PFNGLISENABLEDIEXTPROC IsEnablediEXT;
        /* 1599 */ PFNGLDRAWELEMENTSBASEVERTEXEXTPROC DrawElementsBaseVertexEXT;
        /* 1600 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXEXTPROC DrawElementsInstancedBaseVertexEXT;
        /* 1601 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXEXTPROC DrawRangeElementsBaseVertexEXT;
        /* 1602 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXEXTPROC MultiDrawElementsBaseVertexEXT;
        /* 1603 */ PFNGLDRAWARRAYSINSTANCEDEXTPROC DrawArraysInstancedEXT;
        /* 1604 */ PFNGLDRAWELEMENTSINSTANCEDEXTPROC DrawElementsInstancedEXT;
        /* 1605 */ PFNGLDRAWRANGEELEMENTSEXTPROC DrawRangeElementsEXT;
        /* 1606 */ PFNGLDRAWTRANSFORMFEEDBACKEXTPROC DrawTransformFeedbackEXT;
        /* 1607 */ PFNGLDRAWTRANSFORMFEEDBACKINSTANCEDEXTPROC DrawTransformFeedbackInstancedEXT;
        /* 1608 */ PFNGLBUFFERSTORAGEEXTERNALEXTPROC BufferStorageExternalEXT;
        /* 1609 */ PFNGLNAMEDBUFFERSTORAGEEXTERNALEXTPROC NamedBufferStorageExternalEXT;
        /* 1610 */ PFNGLFOGCOORDPOINTEREXTPROC FogCoordPointerEXT;
        /* 1611 */ PFNGLFOGCOORDDEXTPROC FogCoorddEXT;
        /* 1612 */ PFNGLFOGCOORDDVEXTPROC FogCoorddvEXT;
        /* 1613 */ PFNGLFOGCOORDFEXTPROC FogCoordfEXT;
        /* 1614 */ PFNGLFOGCOORDFVEXTPROC FogCoordfvEXT;
        /* 1615 */ PFNGLFRAMEBUFFERSHADINGRATEEXTPROC FramebufferShadingRateEXT;
        /* 1616 */ PFNGLGETFRAGMENTSHADINGRATESEXTPROC GetFragmentShadingRatesEXT;
        /* 1617 */ PFNGLSHADINGRATECOMBINEROPSEXTPROC ShadingRateCombinerOpsEXT;
        /* 1618 */ PFNGLSHADINGRATEEXTPROC ShadingRateEXT;
        /* 1619 */ PFNGLBLITFRAMEBUFFEREXTPROC BlitFramebufferEXT;
        /* 1620 */ PFNGLBLITFRAMEBUFFERLAYEREXTPROC BlitFramebufferLayerEXT;
        /* 1621 */ PFNGLBLITFRAMEBUFFERLAYERSEXTPROC BlitFramebufferLayersEXT;
        /* 1622 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEEXTPROC RenderbufferStorageMultisampleEXT;
        /* 1623 */ PFNGLBINDFRAMEBUFFEREXTPROC BindFramebufferEXT;
        /* 1624 */ PFNGLBINDRENDERBUFFEREXTPROC BindRenderbufferEXT;
        /* 1625 */ PFNGLCHECKFRAMEBUFFERSTATUSEXTPROC CheckFramebufferStatusEXT;
        /* 1626 */ PFNGLDELETEFRAMEBUFFERSEXTPROC DeleteFramebuffersEXT;
        /* 1627 */ PFNGLDELETERENDERBUFFERSEXTPROC DeleteRenderbuffersEXT;
        /* 1628 */ PFNGLFRAMEBUFFERRENDERBUFFEREXTPROC FramebufferRenderbufferEXT;
        /* 1629 */ PFNGLFRAMEBUFFERTEXTURE1DEXTPROC FramebufferTexture1DEXT;
        /* 1630 */ PFNGLFRAMEBUFFERTEXTURE2DEXTPROC FramebufferTexture2DEXT;
        /* 1631 */ PFNGLFRAMEBUFFERTEXTURE3DEXTPROC FramebufferTexture3DEXT;
        /* 1632 */ PFNGLGENFRAMEBUFFERSEXTPROC GenFramebuffersEXT;
        /* 1633 */ PFNGLGENRENDERBUFFERSEXTPROC GenRenderbuffersEXT;
        /* 1634 */ PFNGLGENERATEMIPMAPEXTPROC GenerateMipmapEXT;
        /* 1635 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVEXTPROC GetFramebufferAttachmentParameterivEXT;
        /* 1636 */ PFNGLGETRENDERBUFFERPARAMETERIVEXTPROC GetRenderbufferParameterivEXT;
        /* 1637 */ PFNGLISFRAMEBUFFEREXTPROC IsFramebufferEXT;
        /* 1638 */ PFNGLISRENDERBUFFEREXTPROC IsRenderbufferEXT;
        /* 1639 */ PFNGLRENDERBUFFERSTORAGEEXTPROC RenderbufferStorageEXT;
        /* 1640 */ PFNGLFRAMEBUFFERTEXTUREEXTPROC FramebufferTextureEXT;
        /* 1641 */ PFNGLPROGRAMPARAMETERIEXTPROC ProgramParameteriEXT;
        /* 1642 */ PFNGLPROGRAMENVPARAMETERS4FVEXTPROC ProgramEnvParameters4fvEXT;
        /* 1643 */ PFNGLPROGRAMLOCALPARAMETERS4FVEXTPROC ProgramLocalParameters4fvEXT;
        /* 1644 */ PFNGLGETFRAGDATALOCATIONEXTPROC GetFragDataLocationEXT;
        /* 1645 */ PFNGLGETUNIFORMUIVEXTPROC GetUniformuivEXT;
        /* 1646 */ PFNGLUNIFORM1UIEXTPROC Uniform1uiEXT;
        /* 1647 */ PFNGLUNIFORM1UIVEXTPROC Uniform1uivEXT;
        /* 1648 */ PFNGLUNIFORM2UIEXTPROC Uniform2uiEXT;
        /* 1649 */ PFNGLUNIFORM2UIVEXTPROC Uniform2uivEXT;
        /* 1650 */ PFNGLUNIFORM3UIEXTPROC Uniform3uiEXT;
        /* 1651 */ PFNGLUNIFORM3UIVEXTPROC Uniform3uivEXT;
        /* 1652 */ PFNGLUNIFORM4UIEXTPROC Uniform4uiEXT;
        /* 1653 */ PFNGLUNIFORM4UIVEXTPROC Uniform4uivEXT;
        /* 1654 */ PFNGLGETVERTEXATTRIBIIVEXTPROC GetVertexAttribIivEXT;
        /* 1655 */ PFNGLGETVERTEXATTRIBIUIVEXTPROC GetVertexAttribIuivEXT;
        /* 1656 */ PFNGLVERTEXATTRIBI1IEXTPROC VertexAttribI1iEXT;
        /* 1657 */ PFNGLVERTEXATTRIBI1IVEXTPROC VertexAttribI1ivEXT;
        /* 1658 */ PFNGLVERTEXATTRIBI1UIEXTPROC VertexAttribI1uiEXT;
        /* 1659 */ PFNGLVERTEXATTRIBI1UIVEXTPROC VertexAttribI1uivEXT;
        /* 1660 */ PFNGLVERTEXATTRIBI2IEXTPROC VertexAttribI2iEXT;
        /* 1661 */ PFNGLVERTEXATTRIBI2IVEXTPROC VertexAttribI2ivEXT;
        /* 1662 */ PFNGLVERTEXATTRIBI2UIEXTPROC VertexAttribI2uiEXT;
        /* 1663 */ PFNGLVERTEXATTRIBI2UIVEXTPROC VertexAttribI2uivEXT;
        /* 1664 */ PFNGLVERTEXATTRIBI3IEXTPROC VertexAttribI3iEXT;
        /* 1665 */ PFNGLVERTEXATTRIBI3IVEXTPROC VertexAttribI3ivEXT;
        /* 1666 */ PFNGLVERTEXATTRIBI3UIEXTPROC VertexAttribI3uiEXT;
        /* 1667 */ PFNGLVERTEXATTRIBI3UIVEXTPROC VertexAttribI3uivEXT;
        /* 1668 */ PFNGLVERTEXATTRIBI4BVEXTPROC VertexAttribI4bvEXT;
        /* 1669 */ PFNGLVERTEXATTRIBI4IEXTPROC VertexAttribI4iEXT;
        /* 1670 */ PFNGLVERTEXATTRIBI4IVEXTPROC VertexAttribI4ivEXT;
        /* 1671 */ PFNGLVERTEXATTRIBI4SVEXTPROC VertexAttribI4svEXT;
        /* 1672 */ PFNGLVERTEXATTRIBI4UBVEXTPROC VertexAttribI4ubvEXT;
        /* 1673 */ PFNGLVERTEXATTRIBI4UIEXTPROC VertexAttribI4uiEXT;
        /* 1674 */ PFNGLVERTEXATTRIBI4UIVEXTPROC VertexAttribI4uivEXT;
        /* 1675 */ PFNGLVERTEXATTRIBI4USVEXTPROC VertexAttribI4usvEXT;
        /* 1676 */ PFNGLVERTEXATTRIBIPOINTEREXTPROC VertexAttribIPointerEXT;
        /* 1677 */ PFNGLGETHISTOGRAMEXTPROC GetHistogramEXT;
        /* 1678 */ PFNGLGETHISTOGRAMPARAMETERFVEXTPROC GetHistogramParameterfvEXT;
        /* 1679 */ PFNGLGETHISTOGRAMPARAMETERIVEXTPROC GetHistogramParameterivEXT;
        /* 1680 */ PFNGLGETMINMAXEXTPROC GetMinmaxEXT;
        /* 1681 */ PFNGLGETMINMAXPARAMETERFVEXTPROC GetMinmaxParameterfvEXT;
        /* 1682 */ PFNGLGETMINMAXPARAMETERIVEXTPROC GetMinmaxParameterivEXT;
        /* 1683 */ PFNGLHISTOGRAMEXTPROC HistogramEXT;
        /* 1684 */ PFNGLMINMAXEXTPROC MinmaxEXT;
        /* 1685 */ PFNGLRESETHISTOGRAMEXTPROC ResetHistogramEXT;
        /* 1686 */ PFNGLRESETMINMAXEXTPROC ResetMinmaxEXT;
        /* 1687 */ PFNGLINDEXFUNCEXTPROC IndexFuncEXT;
        /* 1688 */ PFNGLINDEXMATERIALEXTPROC IndexMaterialEXT;
        /* 1689 */ PFNGLVERTEXATTRIBDIVISOREXTPROC VertexAttribDivisorEXT;
        /* 1690 */ PFNGLAPPLYTEXTUREEXTPROC ApplyTextureEXT;
        /* 1691 */ PFNGLTEXTURELIGHTEXTPROC TextureLightEXT;
        /* 1692 */ PFNGLTEXTUREMATERIALEXTPROC TextureMaterialEXT;
        /* 1693 */ PFNGLFLUSHMAPPEDBUFFERRANGEEXTPROC FlushMappedBufferRangeEXT;
        /* 1694 */ PFNGLMAPBUFFERRANGEEXTPROC MapBufferRangeEXT;
        /* 1695 */ PFNGLBUFFERSTORAGEMEMEXTPROC BufferStorageMemEXT;
        /* 1696 */ PFNGLCREATEMEMORYOBJECTSEXTPROC CreateMemoryObjectsEXT;
        /* 1697 */ PFNGLDELETEMEMORYOBJECTSEXTPROC DeleteMemoryObjectsEXT;
        /* 1698 */ PFNGLGETMEMORYOBJECTPARAMETERIVEXTPROC GetMemoryObjectParameterivEXT;
        /* 1699 */ PFNGLISMEMORYOBJECTEXTPROC IsMemoryObjectEXT;
        /* 1700 */ PFNGLMEMORYOBJECTPARAMETERIVEXTPROC MemoryObjectParameterivEXT;
        /* 1701 */ PFNGLNAMEDBUFFERSTORAGEMEMEXTPROC NamedBufferStorageMemEXT;
        /* 1702 */ PFNGLTEXSTORAGEMEM1DEXTPROC TexStorageMem1DEXT;
        /* 1703 */ PFNGLTEXSTORAGEMEM2DEXTPROC TexStorageMem2DEXT;
        /* 1704 */ PFNGLTEXSTORAGEMEM2DMULTISAMPLEEXTPROC TexStorageMem2DMultisampleEXT;
        /* 1705 */ PFNGLTEXSTORAGEMEM3DEXTPROC TexStorageMem3DEXT;
        /* 1706 */ PFNGLTEXSTORAGEMEM3DMULTISAMPLEEXTPROC TexStorageMem3DMultisampleEXT;
        /* 1707 */ PFNGLTEXTURESTORAGEMEM1DEXTPROC TextureStorageMem1DEXT;
        /* 1708 */ PFNGLTEXTURESTORAGEMEM2DEXTPROC TextureStorageMem2DEXT;
        /* 1709 */ PFNGLTEXTURESTORAGEMEM2DMULTISAMPLEEXTPROC TextureStorageMem2DMultisampleEXT;
        /* 1710 */ PFNGLTEXTURESTORAGEMEM3DEXTPROC TextureStorageMem3DEXT;
        /* 1711 */ PFNGLTEXTURESTORAGEMEM3DMULTISAMPLEEXTPROC TextureStorageMem3DMultisampleEXT;
        /* 1712 */ PFNGLGETUNSIGNEDBYTEI_VEXTPROC GetUnsignedBytei_vEXT;
        /* 1713 */ PFNGLGETUNSIGNEDBYTEVEXTPROC GetUnsignedBytevEXT;
        /* 1714 */ PFNGLIMPORTMEMORYFDEXTPROC ImportMemoryFdEXT;
        /* 1715 */ PFNGLIMPORTMEMORYWIN32HANDLEEXTPROC ImportMemoryWin32HandleEXT;
        /* 1716 */ PFNGLIMPORTMEMORYWIN32NAMEEXTPROC ImportMemoryWin32NameEXT;
        /* 1717 */ PFNGLDRAWMESHTASKSEXTPROC DrawMeshTasksEXT;
        /* 1718 */ PFNGLDRAWMESHTASKSINDIRECTEXTPROC DrawMeshTasksIndirectEXT;
        /* 1719 */ PFNGLMULTIDRAWMESHTASKSINDIRECTCOUNTEXTPROC MultiDrawMeshTasksIndirectCountEXT;
        /* 1720 */ PFNGLMULTIDRAWMESHTASKSINDIRECTEXTPROC MultiDrawMeshTasksIndirectEXT;
        /* 1721 */ PFNGLMULTIDRAWARRAYSEXTPROC MultiDrawArraysEXT;
        /* 1722 */ PFNGLMULTIDRAWELEMENTSEXTPROC MultiDrawElementsEXT;
        /* 1723 */ PFNGLMULTIDRAWARRAYSINDIRECTEXTPROC MultiDrawArraysIndirectEXT;
        /* 1724 */ PFNGLMULTIDRAWELEMENTSINDIRECTEXTPROC MultiDrawElementsIndirectEXT;
        /* 1725 */ PFNGLSAMPLEMASKEXTPROC SampleMaskEXT;
        /* 1726 */ PFNGLSAMPLEPATTERNEXTPROC SamplePatternEXT;
        /* 1727 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEEXTPROC FramebufferTexture2DMultisampleEXT;
        /* 1728 */ PFNGLDRAWBUFFERSINDEXEDEXTPROC DrawBuffersIndexedEXT;
        /* 1729 */ PFNGLGETINTEGERI_VEXTPROC GetIntegeri_vEXT;
        /* 1730 */ PFNGLREADBUFFERINDEXEDEXTPROC ReadBufferIndexedEXT;
        /* 1731 */ PFNGLCOLORTABLEEXTPROC ColorTableEXT;
        /* 1732 */ PFNGLGETCOLORTABLEEXTPROC GetColorTableEXT;
        /* 1733 */ PFNGLGETCOLORTABLEPARAMETERFVEXTPROC GetColorTableParameterfvEXT;
        /* 1734 */ PFNGLGETCOLORTABLEPARAMETERIVEXTPROC GetColorTableParameterivEXT;
        /* 1735 */ PFNGLGETPIXELTRANSFORMPARAMETERFVEXTPROC GetPixelTransformParameterfvEXT;
        /* 1736 */ PFNGLGETPIXELTRANSFORMPARAMETERIVEXTPROC GetPixelTransformParameterivEXT;
        /* 1737 */ PFNGLPIXELTRANSFORMPARAMETERFEXTPROC PixelTransformParameterfEXT;
        /* 1738 */ PFNGLPIXELTRANSFORMPARAMETERFVEXTPROC PixelTransformParameterfvEXT;
        /* 1739 */ PFNGLPIXELTRANSFORMPARAMETERIEXTPROC PixelTransformParameteriEXT;
        /* 1740 */ PFNGLPIXELTRANSFORMPARAMETERIVEXTPROC PixelTransformParameterivEXT;
        /* 1741 */ PFNGLPOINTPARAMETERFEXTPROC PointParameterfEXT;
        /* 1742 */ PFNGLPOINTPARAMETERFVEXTPROC PointParameterfvEXT;
        /* 1743 */ PFNGLPOLYGONOFFSETEXTPROC PolygonOffsetEXT;
        /* 1744 */ PFNGLPOLYGONOFFSETCLAMPEXTPROC PolygonOffsetClampEXT;
        /* 1745 */ PFNGLPRIMITIVEBOUNDINGBOXEXTPROC PrimitiveBoundingBoxEXT;
        /* 1746 */ PFNGLPROVOKINGVERTEXEXTPROC ProvokingVertexEXT;
        /* 1747 */ PFNGLRASTERSAMPLESEXTPROC RasterSamplesEXT;
        /* 1748 */ PFNGLGETGRAPHICSRESETSTATUSEXTPROC GetGraphicsResetStatusEXT;
        /* 1749 */ PFNGLGETNUNIFORMFVEXTPROC GetnUniformfvEXT;
        /* 1750 */ PFNGLGETNUNIFORMIVEXTPROC GetnUniformivEXT;
        /* 1751 */ PFNGLREADNPIXELSEXTPROC ReadnPixelsEXT;
        /* 1752 */ PFNGLDELETESEMAPHORESEXTPROC DeleteSemaphoresEXT;
        /* 1753 */ PFNGLGENSEMAPHORESEXTPROC GenSemaphoresEXT;
        /* 1754 */ PFNGLGETSEMAPHOREPARAMETERUI64VEXTPROC GetSemaphoreParameterui64vEXT;
        /* 1755 */ PFNGLISSEMAPHOREEXTPROC IsSemaphoreEXT;
        /* 1756 */ PFNGLSEMAPHOREPARAMETERUI64VEXTPROC SemaphoreParameterui64vEXT;
        /* 1757 */ PFNGLSIGNALSEMAPHOREEXTPROC SignalSemaphoreEXT;
        /* 1758 */ PFNGLWAITSEMAPHOREEXTPROC WaitSemaphoreEXT;
        /* 1759 */ PFNGLIMPORTSEMAPHOREFDEXTPROC ImportSemaphoreFdEXT;
        /* 1760 */ PFNGLIMPORTSEMAPHOREWIN32HANDLEEXTPROC ImportSemaphoreWin32HandleEXT;
        /* 1761 */ PFNGLIMPORTSEMAPHOREWIN32NAMEEXTPROC ImportSemaphoreWin32NameEXT;
        /* 1762 */ PFNGLSECONDARYCOLOR3BEXTPROC SecondaryColor3bEXT;
        /* 1763 */ PFNGLSECONDARYCOLOR3BVEXTPROC SecondaryColor3bvEXT;
        /* 1764 */ PFNGLSECONDARYCOLOR3DEXTPROC SecondaryColor3dEXT;
        /* 1765 */ PFNGLSECONDARYCOLOR3DVEXTPROC SecondaryColor3dvEXT;
        /* 1766 */ PFNGLSECONDARYCOLOR3FEXTPROC SecondaryColor3fEXT;
        /* 1767 */ PFNGLSECONDARYCOLOR3FVEXTPROC SecondaryColor3fvEXT;
        /* 1768 */ PFNGLSECONDARYCOLOR3IEXTPROC SecondaryColor3iEXT;
        /* 1769 */ PFNGLSECONDARYCOLOR3IVEXTPROC SecondaryColor3ivEXT;
        /* 1770 */ PFNGLSECONDARYCOLOR3SEXTPROC SecondaryColor3sEXT;
        /* 1771 */ PFNGLSECONDARYCOLOR3SVEXTPROC SecondaryColor3svEXT;
        /* 1772 */ PFNGLSECONDARYCOLOR3UBEXTPROC SecondaryColor3ubEXT;
        /* 1773 */ PFNGLSECONDARYCOLOR3UBVEXTPROC SecondaryColor3ubvEXT;
        /* 1774 */ PFNGLSECONDARYCOLOR3UIEXTPROC SecondaryColor3uiEXT;
        /* 1775 */ PFNGLSECONDARYCOLOR3UIVEXTPROC SecondaryColor3uivEXT;
        /* 1776 */ PFNGLSECONDARYCOLOR3USEXTPROC SecondaryColor3usEXT;
        /* 1777 */ PFNGLSECONDARYCOLOR3USVEXTPROC SecondaryColor3usvEXT;
        /* 1778 */ PFNGLSECONDARYCOLORPOINTEREXTPROC SecondaryColorPointerEXT;
        /* 1779 */ PFNGLACTIVEPROGRAMEXTPROC ActiveProgramEXT;
        /* 1780 */ PFNGLACTIVESHADERPROGRAMEXTPROC ActiveShaderProgramEXT;
        /* 1781 */ PFNGLBINDPROGRAMPIPELINEEXTPROC BindProgramPipelineEXT;
        /* 1782 */ PFNGLCREATESHADERPROGRAMEXTPROC CreateShaderProgramEXT;
        /* 1783 */ PFNGLCREATESHADERPROGRAMVEXTPROC CreateShaderProgramvEXT;
        /* 1784 */ PFNGLDELETEPROGRAMPIPELINESEXTPROC DeleteProgramPipelinesEXT;
        /* 1785 */ PFNGLGENPROGRAMPIPELINESEXTPROC GenProgramPipelinesEXT;
        /* 1786 */ PFNGLGETPROGRAMPIPELINEINFOLOGEXTPROC GetProgramPipelineInfoLogEXT;
        /* 1787 */ PFNGLGETPROGRAMPIPELINEIVEXTPROC GetProgramPipelineivEXT;
        /* 1788 */ PFNGLISPROGRAMPIPELINEEXTPROC IsProgramPipelineEXT;
        /* 1789 */ PFNGLUSEPROGRAMSTAGESEXTPROC UseProgramStagesEXT;
        /* 1790 */ PFNGLUSESHADERPROGRAMEXTPROC UseShaderProgramEXT;
        /* 1791 */ PFNGLVALIDATEPROGRAMPIPELINEEXTPROC ValidateProgramPipelineEXT;
        /* 1792 */ PFNGLFRAMEBUFFERFETCHBARRIEREXTPROC FramebufferFetchBarrierEXT;
        /* 1793 */ PFNGLBINDIMAGETEXTUREEXTPROC BindImageTextureEXT;
        /* 1794 */ PFNGLMEMORYBARRIEREXTPROC MemoryBarrierEXT;
        /* 1795 */ PFNGLCLEARPIXELLOCALSTORAGEUIEXTPROC ClearPixelLocalStorageuiEXT;
        /* 1796 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGESIZEEXTPROC FramebufferPixelLocalStorageSizeEXT;
        /* 1797 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGESIZEEXTPROC GetFramebufferPixelLocalStorageSizeEXT;
        /* 1798 */ PFNGLTEXPAGECOMMITMENTEXTPROC TexPageCommitmentEXT;
        /* 1799 */ PFNGLSTENCILCLEARTAGEXTPROC StencilClearTagEXT;
        /* 1800 */ PFNGLACTIVESTENCILFACEEXTPROC ActiveStencilFaceEXT;
        /* 1801 */ PFNGLTEXSUBIMAGE1DEXTPROC TexSubImage1DEXT;
        /* 1802 */ PFNGLTEXSUBIMAGE2DEXTPROC TexSubImage2DEXT;
        /* 1803 */ PFNGLPATCHPARAMETERIEXTPROC PatchParameteriEXT;
        /* 1804 */ PFNGLTEXIMAGE3DEXTPROC TexImage3DEXT;
        /* 1805 */ PFNGLTEXSUBIMAGE3DEXTPROC TexSubImage3DEXT;
        /* 1806 */ PFNGLFRAMEBUFFERTEXTURELAYEREXTPROC FramebufferTextureLayerEXT;
        /* 1807 */ PFNGLGETSAMPLERPARAMETERIIVEXTPROC GetSamplerParameterIivEXT;
        /* 1808 */ PFNGLGETSAMPLERPARAMETERIUIVEXTPROC GetSamplerParameterIuivEXT;
        /* 1809 */ PFNGLSAMPLERPARAMETERIIVEXTPROC SamplerParameterIivEXT;
        /* 1810 */ PFNGLSAMPLERPARAMETERIUIVEXTPROC SamplerParameterIuivEXT;
        /* 1811 */ PFNGLGETTEXPARAMETERIIVEXTPROC GetTexParameterIivEXT;
        /* 1812 */ PFNGLGETTEXPARAMETERIUIVEXTPROC GetTexParameterIuivEXT;
        /* 1813 */ PFNGLTEXPARAMETERIIVEXTPROC TexParameterIivEXT;
        /* 1814 */ PFNGLTEXPARAMETERIUIVEXTPROC TexParameterIuivEXT;
        /* 1815 */ PFNGLTEXBUFFERRANGEEXTPROC TexBufferRangeEXT;
        /* 1816 */ PFNGLTEXBUFFEREXTPROC TexBufferEXT;
        /* 1817 */ PFNGLCLEARCOLORIIEXTPROC ClearColorIiEXT;
        /* 1818 */ PFNGLCLEARCOLORIUIEXTPROC ClearColorIuiEXT;
        /* 1819 */ PFNGLARETEXTURESRESIDENTEXTPROC AreTexturesResidentEXT;
        /* 1820 */ PFNGLBINDTEXTUREEXTPROC BindTextureEXT;
        /* 1821 */ PFNGLDELETETEXTURESEXTPROC DeleteTexturesEXT;
        /* 1822 */ PFNGLGENTEXTURESEXTPROC GenTexturesEXT;
        /* 1823 */ PFNGLISTEXTUREEXTPROC IsTextureEXT;
        /* 1824 */ PFNGLPRIORITIZETEXTURESEXTPROC PrioritizeTexturesEXT;
        /* 1825 */ PFNGLTEXTURENORMALEXTPROC TextureNormalEXT;
        /* 1826 */ PFNGLTEXSTORAGE1DEXTPROC TexStorage1DEXT;
        /* 1827 */ PFNGLTEXSTORAGE2DEXTPROC TexStorage2DEXT;
        /* 1828 */ PFNGLTEXSTORAGE3DEXTPROC TexStorage3DEXT;
        /* 1829 */ PFNGLTEXSTORAGEATTRIBS2DEXTPROC TexStorageAttribs2DEXT;
        /* 1830 */ PFNGLTEXSTORAGEATTRIBS3DEXTPROC TexStorageAttribs3DEXT;
        /* 1831 */ PFNGLTEXTUREVIEWEXTPROC TextureViewEXT;
        /* 1832 */ PFNGLCREATESEMAPHORESNVPROC CreateSemaphoresNV;
        /* 1833 */ PFNGLGETSEMAPHOREPARAMETERIVNVPROC GetSemaphoreParameterivNV;
        /* 1834 */ PFNGLSEMAPHOREPARAMETERIVNVPROC SemaphoreParameterivNV;
        /* 1835 */ PFNGLBEGINTRANSFORMFEEDBACKEXTPROC BeginTransformFeedbackEXT;
        /* 1836 */ PFNGLBINDBUFFERBASEEXTPROC BindBufferBaseEXT;
        /* 1837 */ PFNGLBINDBUFFEROFFSETEXTPROC BindBufferOffsetEXT;
        /* 1838 */ PFNGLBINDBUFFERRANGEEXTPROC BindBufferRangeEXT;
        /* 1839 */ PFNGLENDTRANSFORMFEEDBACKEXTPROC EndTransformFeedbackEXT;
        /* 1840 */ PFNGLGETTRANSFORMFEEDBACKVARYINGEXTPROC GetTransformFeedbackVaryingEXT;
        /* 1841 */ PFNGLTRANSFORMFEEDBACKVARYINGSEXTPROC TransformFeedbackVaryingsEXT;
        /* 1842 */ PFNGLARRAYELEMENTEXTPROC ArrayElementEXT;
        /* 1843 */ PFNGLCOLORPOINTEREXTPROC ColorPointerEXT;
        /* 1844 */ PFNGLDRAWARRAYSEXTPROC DrawArraysEXT;
        /* 1845 */ PFNGLEDGEFLAGPOINTEREXTPROC EdgeFlagPointerEXT;
        /* 1846 */ PFNGLGETPOINTERVEXTPROC GetPointervEXT;
        /* 1847 */ PFNGLINDEXPOINTEREXTPROC IndexPointerEXT;
        /* 1848 */ PFNGLNORMALPOINTEREXTPROC NormalPointerEXT;
        /* 1849 */ PFNGLTEXCOORDPOINTEREXTPROC TexCoordPointerEXT;
        /* 1850 */ PFNGLVERTEXPOINTEREXTPROC VertexPointerEXT;
        /* 1851 */ PFNGLGETVERTEXATTRIBLDVEXTPROC GetVertexAttribLdvEXT;
        /* 1852 */ PFNGLVERTEXATTRIBL1DEXTPROC VertexAttribL1dEXT;
        /* 1853 */ PFNGLVERTEXATTRIBL1DVEXTPROC VertexAttribL1dvEXT;
        /* 1854 */ PFNGLVERTEXATTRIBL2DEXTPROC VertexAttribL2dEXT;
        /* 1855 */ PFNGLVERTEXATTRIBL2DVEXTPROC VertexAttribL2dvEXT;
        /* 1856 */ PFNGLVERTEXATTRIBL3DEXTPROC VertexAttribL3dEXT;
        /* 1857 */ PFNGLVERTEXATTRIBL3DVEXTPROC VertexAttribL3dvEXT;
        /* 1858 */ PFNGLVERTEXATTRIBL4DEXTPROC VertexAttribL4dEXT;
        /* 1859 */ PFNGLVERTEXATTRIBL4DVEXTPROC VertexAttribL4dvEXT;
        /* 1860 */ PFNGLVERTEXATTRIBLPOINTEREXTPROC VertexAttribLPointerEXT;
        /* 1861 */ PFNGLBEGINVERTEXSHADEREXTPROC BeginVertexShaderEXT;
        /* 1862 */ PFNGLBINDLIGHTPARAMETEREXTPROC BindLightParameterEXT;
        /* 1863 */ PFNGLBINDMATERIALPARAMETEREXTPROC BindMaterialParameterEXT;
        /* 1864 */ PFNGLBINDPARAMETEREXTPROC BindParameterEXT;
        /* 1865 */ PFNGLBINDTEXGENPARAMETEREXTPROC BindTexGenParameterEXT;
        /* 1866 */ PFNGLBINDTEXTUREUNITPARAMETEREXTPROC BindTextureUnitParameterEXT;
        /* 1867 */ PFNGLBINDVERTEXSHADEREXTPROC BindVertexShaderEXT;
        /* 1868 */ PFNGLDELETEVERTEXSHADEREXTPROC DeleteVertexShaderEXT;
        /* 1869 */ PFNGLDISABLEVARIANTCLIENTSTATEEXTPROC DisableVariantClientStateEXT;
        /* 1870 */ PFNGLENABLEVARIANTCLIENTSTATEEXTPROC EnableVariantClientStateEXT;
        /* 1871 */ PFNGLENDVERTEXSHADEREXTPROC EndVertexShaderEXT;
        /* 1872 */ PFNGLEXTRACTCOMPONENTEXTPROC ExtractComponentEXT;
        /* 1873 */ PFNGLGENSYMBOLSEXTPROC GenSymbolsEXT;
        /* 1874 */ PFNGLGENVERTEXSHADERSEXTPROC GenVertexShadersEXT;
        /* 1875 */ PFNGLGETINVARIANTBOOLEANVEXTPROC GetInvariantBooleanvEXT;
        /* 1876 */ PFNGLGETINVARIANTFLOATVEXTPROC GetInvariantFloatvEXT;
        /* 1877 */ PFNGLGETINVARIANTINTEGERVEXTPROC GetInvariantIntegervEXT;
        /* 1878 */ PFNGLGETLOCALCONSTANTBOOLEANVEXTPROC GetLocalConstantBooleanvEXT;
        /* 1879 */ PFNGLGETLOCALCONSTANTFLOATVEXTPROC GetLocalConstantFloatvEXT;
        /* 1880 */ PFNGLGETLOCALCONSTANTINTEGERVEXTPROC GetLocalConstantIntegervEXT;
        /* 1881 */ PFNGLGETVARIANTBOOLEANVEXTPROC GetVariantBooleanvEXT;
        /* 1882 */ PFNGLGETVARIANTFLOATVEXTPROC GetVariantFloatvEXT;
        /* 1883 */ PFNGLGETVARIANTINTEGERVEXTPROC GetVariantIntegervEXT;
        /* 1884 */ PFNGLGETVARIANTPOINTERVEXTPROC GetVariantPointervEXT;
        /* 1885 */ PFNGLINSERTCOMPONENTEXTPROC InsertComponentEXT;
        /* 1886 */ PFNGLISVARIANTENABLEDEXTPROC IsVariantEnabledEXT;
        /* 1887 */ PFNGLSETINVARIANTEXTPROC SetInvariantEXT;
        /* 1888 */ PFNGLSETLOCALCONSTANTEXTPROC SetLocalConstantEXT;
        /* 1889 */ PFNGLSHADEROP1EXTPROC ShaderOp1EXT;
        /* 1890 */ PFNGLSHADEROP2EXTPROC ShaderOp2EXT;
        /* 1891 */ PFNGLSHADEROP3EXTPROC ShaderOp3EXT;
        /* 1892 */ PFNGLSWIZZLEEXTPROC SwizzleEXT;
        /* 1893 */ PFNGLVARIANTPOINTEREXTPROC VariantPointerEXT;
        /* 1894 */ PFNGLVARIANTBVEXTPROC VariantbvEXT;
        /* 1895 */ PFNGLVARIANTDVEXTPROC VariantdvEXT;
        /* 1896 */ PFNGLVARIANTFVEXTPROC VariantfvEXT;
        /* 1897 */ PFNGLVARIANTIVEXTPROC VariantivEXT;
        /* 1898 */ PFNGLVARIANTSVEXTPROC VariantsvEXT;
        /* 1899 */ PFNGLVARIANTUBVEXTPROC VariantubvEXT;
        /* 1900 */ PFNGLVARIANTUIVEXTPROC VariantuivEXT;
        /* 1901 */ PFNGLVARIANTUSVEXTPROC VariantusvEXT;
        /* 1902 */ PFNGLWRITEMASKEXTPROC WriteMaskEXT;
        /* 1903 */ PFNGLVERTEXWEIGHTPOINTEREXTPROC VertexWeightPointerEXT;
        /* 1904 */ PFNGLVERTEXWEIGHTFEXTPROC VertexWeightfEXT;
        /* 1905 */ PFNGLVERTEXWEIGHTFVEXTPROC VertexWeightfvEXT;
        /* 1906 */ PFNGLACQUIREKEYEDMUTEXWIN32EXTPROC AcquireKeyedMutexWin32EXT;
        /* 1907 */ PFNGLRELEASEKEYEDMUTEXWIN32EXTPROC ReleaseKeyedMutexWin32EXT;
        /* 1908 */ PFNGLWINDOWRECTANGLESEXTPROC WindowRectanglesEXT;
        /* 1909 */ PFNGLIMPORTSYNCEXTPROC ImportSyncEXT;
        /* 1910 */ PFNGLFRAMETERMINATORGREMEDYPROC FrameTerminatorGREMEDY;
        /* 1911 */ PFNGLSTRINGMARKERGREMEDYPROC StringMarkerGREMEDY;
        /* 1912 */ PFNGLGETIMAGETRANSFORMPARAMETERFVHPPROC GetImageTransformParameterfvHP;
        /* 1913 */ PFNGLGETIMAGETRANSFORMPARAMETERIVHPPROC GetImageTransformParameterivHP;
        /* 1914 */ PFNGLIMAGETRANSFORMPARAMETERFHPPROC ImageTransformParameterfHP;
        /* 1915 */ PFNGLIMAGETRANSFORMPARAMETERFVHPPROC ImageTransformParameterfvHP;
        /* 1916 */ PFNGLIMAGETRANSFORMPARAMETERIHPPROC ImageTransformParameteriHP;
        /* 1917 */ PFNGLIMAGETRANSFORMPARAMETERIVHPPROC ImageTransformParameterivHP;
        /* 1918 */ PFNGLMULTIMODEDRAWARRAYSIBMPROC MultiModeDrawArraysIBM;
        /* 1919 */ PFNGLMULTIMODEDRAWELEMENTSIBMPROC MultiModeDrawElementsIBM;
        /* 1920 */ PFNGLFLUSHSTATICDATAIBMPROC FlushStaticDataIBM;
        /* 1921 */ PFNGLCOLORPOINTERLISTIBMPROC ColorPointerListIBM;
        /* 1922 */ PFNGLEDGEFLAGPOINTERLISTIBMPROC EdgeFlagPointerListIBM;
        /* 1923 */ PFNGLFOGCOORDPOINTERLISTIBMPROC FogCoordPointerListIBM;
        /* 1924 */ PFNGLINDEXPOINTERLISTIBMPROC IndexPointerListIBM;
        /* 1925 */ PFNGLNORMALPOINTERLISTIBMPROC NormalPointerListIBM;
        /* 1926 */ PFNGLSECONDARYCOLORPOINTERLISTIBMPROC SecondaryColorPointerListIBM;
        /* 1927 */ PFNGLTEXCOORDPOINTERLISTIBMPROC TexCoordPointerListIBM;
        /* 1928 */ PFNGLVERTEXPOINTERLISTIBMPROC VertexPointerListIBM;
        /* 1929 */ PFNGLGETTEXTUREHANDLEIMGPROC GetTextureHandleIMG;
        /* 1930 */ PFNGLGETTEXTURESAMPLERHANDLEIMGPROC GetTextureSamplerHandleIMG;
        /* 1931 */ PFNGLPROGRAMUNIFORMHANDLEUI64IMGPROC ProgramUniformHandleui64IMG;
        /* 1932 */ PFNGLPROGRAMUNIFORMHANDLEUI64VIMGPROC ProgramUniformHandleui64vIMG;
        /* 1933 */ PFNGLUNIFORMHANDLEUI64IMGPROC UniformHandleui64IMG;
        /* 1934 */ PFNGLUNIFORMHANDLEUI64VIMGPROC UniformHandleui64vIMG;
        /* 1935 */ PFNGLFRAMEBUFFERTEXTURE2DDOWNSAMPLEIMGPROC FramebufferTexture2DDownsampleIMG;
        /* 1936 */ PFNGLFRAMEBUFFERTEXTURELAYERDOWNSAMPLEIMGPROC FramebufferTextureLayerDownsampleIMG;
        /* 1937 */ PFNGLFRAMEBUFFERTEXTURE2DMULTISAMPLEIMGPROC FramebufferTexture2DMultisampleIMG;
        /* 1938 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEIMGPROC RenderbufferStorageMultisampleIMG;
        /* 1939 */ PFNGLBLENDFUNCSEPARATEINGRPROC BlendFuncSeparateINGR;
        /* 1940 */ PFNGLAPPLYFRAMEBUFFERATTACHMENTCMAAINTELPROC ApplyFramebufferAttachmentCMAAINTEL;
        /* 1941 */ PFNGLMAPTEXTURE2DINTELPROC MapTexture2DINTEL;
        /* 1942 */ PFNGLSYNCTEXTUREINTELPROC SyncTextureINTEL;
        /* 1943 */ PFNGLUNMAPTEXTURE2DINTELPROC UnmapTexture2DINTEL;
        /* 1944 */ PFNGLCOLORPOINTERVINTELPROC ColorPointervINTEL;
        /* 1945 */ PFNGLNORMALPOINTERVINTELPROC NormalPointervINTEL;
        /* 1946 */ PFNGLTEXCOORDPOINTERVINTELPROC TexCoordPointervINTEL;
        /* 1947 */ PFNGLVERTEXPOINTERVINTELPROC VertexPointervINTEL;
        /* 1948 */ PFNGLBEGINPERFQUERYINTELPROC BeginPerfQueryINTEL;
        /* 1949 */ PFNGLCREATEPERFQUERYINTELPROC CreatePerfQueryINTEL;
        /* 1950 */ PFNGLDELETEPERFQUERYINTELPROC DeletePerfQueryINTEL;
        /* 1951 */ PFNGLENDPERFQUERYINTELPROC EndPerfQueryINTEL;
        /* 1952 */ PFNGLGETFIRSTPERFQUERYIDINTELPROC GetFirstPerfQueryIdINTEL;
        /* 1953 */ PFNGLGETNEXTPERFQUERYIDINTELPROC GetNextPerfQueryIdINTEL;
        /* 1954 */ PFNGLGETPERFCOUNTERINFOINTELPROC GetPerfCounterInfoINTEL;
        /* 1955 */ PFNGLGETPERFQUERYDATAINTELPROC GetPerfQueryDataINTEL;
        /* 1956 */ PFNGLGETPERFQUERYIDBYNAMEINTELPROC GetPerfQueryIdByNameINTEL;
        /* 1957 */ PFNGLGETPERFQUERYINFOINTELPROC GetPerfQueryInfoINTEL;
        /* 1958 */ PFNGLBLENDBARRIERKHRPROC BlendBarrierKHR;
        /* 1959 */ PFNGLDEBUGMESSAGECALLBACKKHRPROC DebugMessageCallbackKHR;
        /* 1960 */ PFNGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /* 1961 */ PFNGLDEBUGMESSAGEINSERTKHRPROC DebugMessageInsertKHR;
        /* 1962 */ PFNGLGETDEBUGMESSAGELOGKHRPROC GetDebugMessageLogKHR;
        /* 1963 */ PFNGLGETOBJECTLABELKHRPROC GetObjectLabelKHR;
        /* 1964 */ PFNGLGETOBJECTPTRLABELKHRPROC GetObjectPtrLabelKHR;
        /* 1965 */ PFNGLGETPOINTERVKHRPROC GetPointervKHR;
        /* 1966 */ PFNGLOBJECTLABELKHRPROC ObjectLabelKHR;
        /* 1967 */ PFNGLOBJECTPTRLABELKHRPROC ObjectPtrLabelKHR;
        /* 1968 */ PFNGLPOPDEBUGGROUPKHRPROC PopDebugGroupKHR;
        /* 1969 */ PFNGLPUSHDEBUGGROUPKHRPROC PushDebugGroupKHR;
        /* 1970 */ PFNGLGETGRAPHICSRESETSTATUSKHRPROC GetGraphicsResetStatusKHR;
        /* 1971 */ PFNGLGETNUNIFORMFVKHRPROC GetnUniformfvKHR;
        /* 1972 */ PFNGLGETNUNIFORMIVKHRPROC GetnUniformivKHR;
        /* 1973 */ PFNGLGETNUNIFORMUIVKHRPROC GetnUniformuivKHR;
        /* 1974 */ PFNGLREADNPIXELSKHRPROC ReadnPixelsKHR;
        /* 1975 */ PFNGLMAXSHADERCOMPILERTHREADSKHRPROC MaxShaderCompilerThreadsKHR;
        /* 1976 */ PFNGLFRAMEBUFFERPARAMETERIMESAPROC FramebufferParameteriMESA;
        /* 1977 */ PFNGLGETFRAMEBUFFERPARAMETERIVMESAPROC GetFramebufferParameterivMESA;
        /* 1978 */ PFNGLADDCLIENTPOINTERRANGEMESAPROC AddClientPointerRangeMESA;
        /* 1979 */ PFNGLRELEASECLIENTPOINTERRANGEMESAPROC ReleaseClientPointerRangeMESA;
        /* 1980 */ PFNGLRESIZEBUFFERSMESAPROC ResizeBuffersMESA;
        /* 1981 */ PFNGLWINDOWPOS2DMESAPROC WindowPos2dMESA;
        /* 1982 */ PFNGLWINDOWPOS2DVMESAPROC WindowPos2dvMESA;
        /* 1983 */ PFNGLWINDOWPOS2FMESAPROC WindowPos2fMESA;
        /* 1984 */ PFNGLWINDOWPOS2FVMESAPROC WindowPos2fvMESA;
        /* 1985 */ PFNGLWINDOWPOS2IMESAPROC WindowPos2iMESA;
        /* 1986 */ PFNGLWINDOWPOS2IVMESAPROC WindowPos2ivMESA;
        /* 1987 */ PFNGLWINDOWPOS2SMESAPROC WindowPos2sMESA;
        /* 1988 */ PFNGLWINDOWPOS2SVMESAPROC WindowPos2svMESA;
        /* 1989 */ PFNGLWINDOWPOS3DMESAPROC WindowPos3dMESA;
        /* 1990 */ PFNGLWINDOWPOS3DVMESAPROC WindowPos3dvMESA;
        /* 1991 */ PFNGLWINDOWPOS3FMESAPROC WindowPos3fMESA;
        /* 1992 */ PFNGLWINDOWPOS3FVMESAPROC WindowPos3fvMESA;
        /* 1993 */ PFNGLWINDOWPOS3IMESAPROC WindowPos3iMESA;
        /* 1994 */ PFNGLWINDOWPOS3IVMESAPROC WindowPos3ivMESA;
        /* 1995 */ PFNGLWINDOWPOS3SMESAPROC WindowPos3sMESA;
        /* 1996 */ PFNGLWINDOWPOS3SVMESAPROC WindowPos3svMESA;
        /* 1997 */ PFNGLWINDOWPOS4DMESAPROC WindowPos4dMESA;
        /* 1998 */ PFNGLWINDOWPOS4DVMESAPROC WindowPos4dvMESA;
        /* 1999 */ PFNGLWINDOWPOS4FMESAPROC WindowPos4fMESA;
        /* 2000 */ PFNGLWINDOWPOS4FVMESAPROC WindowPos4fvMESA;
        /* 2001 */ PFNGLWINDOWPOS4IMESAPROC WindowPos4iMESA;
        /* 2002 */ PFNGLWINDOWPOS4IVMESAPROC WindowPos4ivMESA;
        /* 2003 */ PFNGLWINDOWPOS4SMESAPROC WindowPos4sMESA;
        /* 2004 */ PFNGLWINDOWPOS4SVMESAPROC WindowPos4svMESA;
        /* 2005 */ PFNGLBEGINCONDITIONALRENDERNVXPROC BeginConditionalRenderNVX;
        /* 2006 */ PFNGLENDCONDITIONALRENDERNVXPROC EndConditionalRenderNVX;
        /* 2007 */ PFNGLLGPUCOPYIMAGESUBDATANVXPROC LGPUCopyImageSubDataNVX;
        /* 2008 */ PFNGLLGPUINTERLOCKNVXPROC LGPUInterlockNVX;
        /* 2009 */ PFNGLLGPUNAMEDBUFFERSUBDATANVXPROC LGPUNamedBufferSubDataNVX;
        /* 2010 */ PFNGLALPHATOCOVERAGEDITHERCONTROLNVPROC AlphaToCoverageDitherControlNV;
        /* 2011 */ PFNGLMULTIDRAWARRAYSINDIRECTBINDLESSNVPROC MultiDrawArraysIndirectBindlessNV;
        /* 2012 */ PFNGLMULTIDRAWELEMENTSINDIRECTBINDLESSNVPROC MultiDrawElementsIndirectBindlessNV;
        /* 2013 */ PFNGLMULTIDRAWARRAYSINDIRECTBINDLESSCOUNTNVPROC MultiDrawArraysIndirectBindlessCountNV;
        /* 2014 */ PFNGLMULTIDRAWELEMENTSINDIRECTBINDLESSCOUNTNVPROC MultiDrawElementsIndirectBindlessCountNV;
        /* 2015 */ PFNGLGETIMAGEHANDLENVPROC GetImageHandleNV;
        /* 2016 */ PFNGLGETTEXTUREHANDLENVPROC GetTextureHandleNV;
        /* 2017 */ PFNGLGETTEXTURESAMPLERHANDLENVPROC GetTextureSamplerHandleNV;
        /* 2018 */ PFNGLISIMAGEHANDLERESIDENTNVPROC IsImageHandleResidentNV;
        /* 2019 */ PFNGLISTEXTUREHANDLERESIDENTNVPROC IsTextureHandleResidentNV;
        /* 2020 */ PFNGLMAKEIMAGEHANDLENONRESIDENTNVPROC MakeImageHandleNonResidentNV;
        /* 2021 */ PFNGLMAKEIMAGEHANDLERESIDENTNVPROC MakeImageHandleResidentNV;
        /* 2022 */ PFNGLMAKETEXTUREHANDLENONRESIDENTNVPROC MakeTextureHandleNonResidentNV;
        /* 2023 */ PFNGLMAKETEXTUREHANDLERESIDENTNVPROC MakeTextureHandleResidentNV;
        /* 2024 */ PFNGLPROGRAMUNIFORMHANDLEUI64NVPROC ProgramUniformHandleui64NV;
        /* 2025 */ PFNGLPROGRAMUNIFORMHANDLEUI64VNVPROC ProgramUniformHandleui64vNV;
        /* 2026 */ PFNGLUNIFORMHANDLEUI64NVPROC UniformHandleui64NV;
        /* 2027 */ PFNGLUNIFORMHANDLEUI64VNVPROC UniformHandleui64vNV;
        /* 2028 */ PFNGLBLENDBARRIERNVPROC BlendBarrierNV;
        /* 2029 */ PFNGLBLENDPARAMETERINVPROC BlendParameteriNV;
        /* 2030 */ PFNGLVIEWPORTPOSITIONWSCALENVPROC ViewportPositionWScaleNV;
        /* 2031 */ PFNGLCALLCOMMANDLISTNVPROC CallCommandListNV;
        /* 2032 */ PFNGLCOMMANDLISTSEGMENTSNVPROC CommandListSegmentsNV;
        /* 2033 */ PFNGLCOMPILECOMMANDLISTNVPROC CompileCommandListNV;
        /* 2034 */ PFNGLCREATECOMMANDLISTSNVPROC CreateCommandListsNV;
        /* 2035 */ PFNGLCREATESTATESNVPROC CreateStatesNV;
        /* 2036 */ PFNGLDELETECOMMANDLISTSNVPROC DeleteCommandListsNV;
        /* 2037 */ PFNGLDELETESTATESNVPROC DeleteStatesNV;
        /* 2038 */ PFNGLDRAWCOMMANDSADDRESSNVPROC DrawCommandsAddressNV;
        /* 2039 */ PFNGLDRAWCOMMANDSNVPROC DrawCommandsNV;
        /* 2040 */ PFNGLDRAWCOMMANDSSTATESADDRESSNVPROC DrawCommandsStatesAddressNV;
        /* 2041 */ PFNGLDRAWCOMMANDSSTATESNVPROC DrawCommandsStatesNV;
        /* 2042 */ PFNGLGETCOMMANDHEADERNVPROC GetCommandHeaderNV;
        /* 2043 */ PFNGLGETSTAGEINDEXNVPROC GetStageIndexNV;
        /* 2044 */ PFNGLISCOMMANDLISTNVPROC IsCommandListNV;
        /* 2045 */ PFNGLISSTATENVPROC IsStateNV;
        /* 2046 */ PFNGLLISTDRAWCOMMANDSSTATESCLIENTNVPROC ListDrawCommandsStatesClientNV;
        /* 2047 */ PFNGLSTATECAPTURENVPROC StateCaptureNV;
        /* 2048 */ PFNGLBEGINCONDITIONALRENDERNVPROC BeginConditionalRenderNV;
        /* 2049 */ PFNGLENDCONDITIONALRENDERNVPROC EndConditionalRenderNV;
        /* 2050 */ PFNGLSUBPIXELPRECISIONBIASNVPROC SubpixelPrecisionBiasNV;
        /* 2051 */ PFNGLCONSERVATIVERASTERPARAMETERFNVPROC ConservativeRasterParameterfNV;
        /* 2052 */ PFNGLCONSERVATIVERASTERPARAMETERINVPROC ConservativeRasterParameteriNV;
        /* 2053 */ PFNGLCOPYBUFFERSUBDATANVPROC CopyBufferSubDataNV;
        /* 2054 */ PFNGLCOPYIMAGESUBDATANVPROC CopyImageSubDataNV;
        /* 2055 */ PFNGLCOVERAGEMASKNVPROC CoverageMaskNV;
        /* 2056 */ PFNGLCOVERAGEOPERATIONNVPROC CoverageOperationNV;
        /* 2057 */ PFNGLCLEARDEPTHDNVPROC ClearDepthdNV;
        /* 2058 */ PFNGLDEPTHBOUNDSDNVPROC DepthBoundsdNV;
        /* 2059 */ PFNGLDEPTHRANGEDNVPROC DepthRangedNV;
        /* 2060 */ PFNGLDRAWBUFFERSNVPROC DrawBuffersNV;
        /* 2061 */ PFNGLDRAWARRAYSINSTANCEDNVPROC DrawArraysInstancedNV;
        /* 2062 */ PFNGLDRAWELEMENTSINSTANCEDNVPROC DrawElementsInstancedNV;
        /* 2063 */ PFNGLDRAWTEXTURENVPROC DrawTextureNV;
        /* 2064 */ PFNGLDRAWVKIMAGENVPROC DrawVkImageNV;
        /* 2065 */ PFNGLGETVKPROCADDRNVPROC GetVkProcAddrNV;
        /* 2066 */ PFNGLSIGNALVKFENCENVPROC SignalVkFenceNV;
        /* 2067 */ PFNGLSIGNALVKSEMAPHORENVPROC SignalVkSemaphoreNV;
        /* 2068 */ PFNGLWAITVKSEMAPHORENVPROC WaitVkSemaphoreNV;
        /* 2069 */ PFNGLEVALMAPSNVPROC EvalMapsNV;
        /* 2070 */ PFNGLGETMAPATTRIBPARAMETERFVNVPROC GetMapAttribParameterfvNV;
        /* 2071 */ PFNGLGETMAPATTRIBPARAMETERIVNVPROC GetMapAttribParameterivNV;
        /* 2072 */ PFNGLGETMAPCONTROLPOINTSNVPROC GetMapControlPointsNV;
        /* 2073 */ PFNGLGETMAPPARAMETERFVNVPROC GetMapParameterfvNV;
        /* 2074 */ PFNGLGETMAPPARAMETERIVNVPROC GetMapParameterivNV;
        /* 2075 */ PFNGLMAPCONTROLPOINTSNVPROC MapControlPointsNV;
        /* 2076 */ PFNGLMAPPARAMETERFVNVPROC MapParameterfvNV;
        /* 2077 */ PFNGLMAPPARAMETERIVNVPROC MapParameterivNV;
        /* 2078 */ PFNGLGETMULTISAMPLEFVNVPROC GetMultisamplefvNV;
        /* 2079 */ PFNGLSAMPLEMASKINDEXEDNVPROC SampleMaskIndexedNV;
        /* 2080 */ PFNGLTEXRENDERBUFFERNVPROC TexRenderbufferNV;
        /* 2081 */ PFNGLDELETEFENCESNVPROC DeleteFencesNV;
        /* 2082 */ PFNGLFINISHFENCENVPROC FinishFenceNV;
        /* 2083 */ PFNGLGENFENCESNVPROC GenFencesNV;
        /* 2084 */ PFNGLGETFENCEIVNVPROC GetFenceivNV;
        /* 2085 */ PFNGLISFENCENVPROC IsFenceNV;
        /* 2086 */ PFNGLSETFENCENVPROC SetFenceNV;
        /* 2087 */ PFNGLTESTFENCENVPROC TestFenceNV;
        /* 2088 */ PFNGLFRAGMENTCOVERAGECOLORNVPROC FragmentCoverageColorNV;
        /* 2089 */ PFNGLGETPROGRAMNAMEDPARAMETERDVNVPROC GetProgramNamedParameterdvNV;
        /* 2090 */ PFNGLGETPROGRAMNAMEDPARAMETERFVNVPROC GetProgramNamedParameterfvNV;
        /* 2091 */ PFNGLPROGRAMNAMEDPARAMETER4DNVPROC ProgramNamedParameter4dNV;
        /* 2092 */ PFNGLPROGRAMNAMEDPARAMETER4DVNVPROC ProgramNamedParameter4dvNV;
        /* 2093 */ PFNGLPROGRAMNAMEDPARAMETER4FNVPROC ProgramNamedParameter4fNV;
        /* 2094 */ PFNGLPROGRAMNAMEDPARAMETER4FVNVPROC ProgramNamedParameter4fvNV;
        /* 2095 */ PFNGLBLITFRAMEBUFFERNVPROC BlitFramebufferNV;
        /* 2096 */ PFNGLCOVERAGEMODULATIONNVPROC CoverageModulationNV;
        /* 2097 */ PFNGLCOVERAGEMODULATIONTABLENVPROC CoverageModulationTableNV;
        /* 2098 */ PFNGLGETCOVERAGEMODULATIONTABLENVPROC GetCoverageModulationTableNV;
        /* 2099 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLENVPROC RenderbufferStorageMultisampleNV;
        /* 2100 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLECOVERAGENVPROC RenderbufferStorageMultisampleCoverageNV;
        /* 2101 */ PFNGLFRAMEBUFFERTEXTUREFACEEXTPROC FramebufferTextureFaceEXT;
        /* 2102 */ PFNGLPROGRAMVERTEXLIMITNVPROC ProgramVertexLimitNV;
        /* 2103 */ PFNGLGETPROGRAMENVPARAMETERIIVNVPROC GetProgramEnvParameterIivNV;
        /* 2104 */ PFNGLGETPROGRAMENVPARAMETERIUIVNVPROC GetProgramEnvParameterIuivNV;
        /* 2105 */ PFNGLGETPROGRAMLOCALPARAMETERIIVNVPROC GetProgramLocalParameterIivNV;
        /* 2106 */ PFNGLGETPROGRAMLOCALPARAMETERIUIVNVPROC GetProgramLocalParameterIuivNV;
        /* 2107 */ PFNGLPROGRAMENVPARAMETERI4INVPROC ProgramEnvParameterI4iNV;
        /* 2108 */ PFNGLPROGRAMENVPARAMETERI4IVNVPROC ProgramEnvParameterI4ivNV;
        /* 2109 */ PFNGLPROGRAMENVPARAMETERI4UINVPROC ProgramEnvParameterI4uiNV;
        /* 2110 */ PFNGLPROGRAMENVPARAMETERI4UIVNVPROC ProgramEnvParameterI4uivNV;
        /* 2111 */ PFNGLPROGRAMENVPARAMETERSI4IVNVPROC ProgramEnvParametersI4ivNV;
        /* 2112 */ PFNGLPROGRAMENVPARAMETERSI4UIVNVPROC ProgramEnvParametersI4uivNV;
        /* 2113 */ PFNGLPROGRAMLOCALPARAMETERI4INVPROC ProgramLocalParameterI4iNV;
        /* 2114 */ PFNGLPROGRAMLOCALPARAMETERI4IVNVPROC ProgramLocalParameterI4ivNV;
        /* 2115 */ PFNGLPROGRAMLOCALPARAMETERI4UINVPROC ProgramLocalParameterI4uiNV;
        /* 2116 */ PFNGLPROGRAMLOCALPARAMETERI4UIVNVPROC ProgramLocalParameterI4uivNV;
        /* 2117 */ PFNGLPROGRAMLOCALPARAMETERSI4IVNVPROC ProgramLocalParametersI4ivNV;
        /* 2118 */ PFNGLPROGRAMLOCALPARAMETERSI4UIVNVPROC ProgramLocalParametersI4uivNV;
        /* 2119 */ PFNGLGETPROGRAMSUBROUTINEPARAMETERUIVNVPROC GetProgramSubroutineParameteruivNV;
        /* 2120 */ PFNGLPROGRAMSUBROUTINEPARAMETERSUIVNVPROC ProgramSubroutineParametersuivNV;
        /* 2121 */ PFNGLCOLOR3HNVPROC Color3hNV;
        /* 2122 */ PFNGLCOLOR3HVNVPROC Color3hvNV;
        /* 2123 */ PFNGLCOLOR4HNVPROC Color4hNV;
        /* 2124 */ PFNGLCOLOR4HVNVPROC Color4hvNV;
        /* 2125 */ PFNGLFOGCOORDHNVPROC FogCoordhNV;
        /* 2126 */ PFNGLFOGCOORDHVNVPROC FogCoordhvNV;
        /* 2127 */ PFNGLMULTITEXCOORD1HNVPROC MultiTexCoord1hNV;
        /* 2128 */ PFNGLMULTITEXCOORD1HVNVPROC MultiTexCoord1hvNV;
        /* 2129 */ PFNGLMULTITEXCOORD2HNVPROC MultiTexCoord2hNV;
        /* 2130 */ PFNGLMULTITEXCOORD2HVNVPROC MultiTexCoord2hvNV;
        /* 2131 */ PFNGLMULTITEXCOORD3HNVPROC MultiTexCoord3hNV;
        /* 2132 */ PFNGLMULTITEXCOORD3HVNVPROC MultiTexCoord3hvNV;
        /* 2133 */ PFNGLMULTITEXCOORD4HNVPROC MultiTexCoord4hNV;
        /* 2134 */ PFNGLMULTITEXCOORD4HVNVPROC MultiTexCoord4hvNV;
        /* 2135 */ PFNGLNORMAL3HNVPROC Normal3hNV;
        /* 2136 */ PFNGLNORMAL3HVNVPROC Normal3hvNV;
        /* 2137 */ PFNGLSECONDARYCOLOR3HNVPROC SecondaryColor3hNV;
        /* 2138 */ PFNGLSECONDARYCOLOR3HVNVPROC SecondaryColor3hvNV;
        /* 2139 */ PFNGLTEXCOORD1HNVPROC TexCoord1hNV;
        /* 2140 */ PFNGLTEXCOORD1HVNVPROC TexCoord1hvNV;
        /* 2141 */ PFNGLTEXCOORD2HNVPROC TexCoord2hNV;
        /* 2142 */ PFNGLTEXCOORD2HVNVPROC TexCoord2hvNV;
        /* 2143 */ PFNGLTEXCOORD3HNVPROC TexCoord3hNV;
        /* 2144 */ PFNGLTEXCOORD3HVNVPROC TexCoord3hvNV;
        /* 2145 */ PFNGLTEXCOORD4HNVPROC TexCoord4hNV;
        /* 2146 */ PFNGLTEXCOORD4HVNVPROC TexCoord4hvNV;
        /* 2147 */ PFNGLVERTEX2HNVPROC Vertex2hNV;
        /* 2148 */ PFNGLVERTEX2HVNVPROC Vertex2hvNV;
        /* 2149 */ PFNGLVERTEX3HNVPROC Vertex3hNV;
        /* 2150 */ PFNGLVERTEX3HVNVPROC Vertex3hvNV;
        /* 2151 */ PFNGLVERTEX4HNVPROC Vertex4hNV;
        /* 2152 */ PFNGLVERTEX4HVNVPROC Vertex4hvNV;
        /* 2153 */ PFNGLVERTEXATTRIB1HNVPROC VertexAttrib1hNV;
        /* 2154 */ PFNGLVERTEXATTRIB1HVNVPROC VertexAttrib1hvNV;
        /* 2155 */ PFNGLVERTEXATTRIB2HNVPROC VertexAttrib2hNV;
        /* 2156 */ PFNGLVERTEXATTRIB2HVNVPROC VertexAttrib2hvNV;
        /* 2157 */ PFNGLVERTEXATTRIB3HNVPROC VertexAttrib3hNV;
        /* 2158 */ PFNGLVERTEXATTRIB3HVNVPROC VertexAttrib3hvNV;
        /* 2159 */ PFNGLVERTEXATTRIB4HNVPROC VertexAttrib4hNV;
        /* 2160 */ PFNGLVERTEXATTRIB4HVNVPROC VertexAttrib4hvNV;
        /* 2161 */ PFNGLVERTEXATTRIBS1HVNVPROC VertexAttribs1hvNV;
        /* 2162 */ PFNGLVERTEXATTRIBS2HVNVPROC VertexAttribs2hvNV;
        /* 2163 */ PFNGLVERTEXATTRIBS3HVNVPROC VertexAttribs3hvNV;
        /* 2164 */ PFNGLVERTEXATTRIBS4HVNVPROC VertexAttribs4hvNV;
        /* 2165 */ PFNGLVERTEXWEIGHTHNVPROC VertexWeighthNV;
        /* 2166 */ PFNGLVERTEXWEIGHTHVNVPROC VertexWeighthvNV;
        /* 2167 */ PFNGLVERTEXATTRIBDIVISORNVPROC VertexAttribDivisorNV;
        /* 2168 */ PFNGLGETINTERNALFORMATSAMPLEIVNVPROC GetInternalformatSampleivNV;
        /* 2169 */ PFNGLMULTICASTBARRIERNVPROC MulticastBarrierNV;
        /* 2170 */ PFNGLMULTICASTBLITFRAMEBUFFERNVPROC MulticastBlitFramebufferNV;
        /* 2171 */ PFNGLMULTICASTBUFFERSUBDATANVPROC MulticastBufferSubDataNV;
        /* 2172 */ PFNGLMULTICASTCOPYBUFFERSUBDATANVPROC MulticastCopyBufferSubDataNV;
        /* 2173 */ PFNGLMULTICASTCOPYIMAGESUBDATANVPROC MulticastCopyImageSubDataNV;
        /* 2174 */ PFNGLMULTICASTFRAMEBUFFERSAMPLELOCATIONSFVNVPROC MulticastFramebufferSampleLocationsfvNV;
        /* 2175 */ PFNGLMULTICASTGETQUERYOBJECTI64VNVPROC MulticastGetQueryObjecti64vNV;
        /* 2176 */ PFNGLMULTICASTGETQUERYOBJECTIVNVPROC MulticastGetQueryObjectivNV;
        /* 2177 */ PFNGLMULTICASTGETQUERYOBJECTUI64VNVPROC MulticastGetQueryObjectui64vNV;
        /* 2178 */ PFNGLMULTICASTGETQUERYOBJECTUIVNVPROC MulticastGetQueryObjectuivNV;
        /* 2179 */ PFNGLMULTICASTWAITSYNCNVPROC MulticastWaitSyncNV;
        /* 2180 */ PFNGLRENDERGPUMASKNVPROC RenderGpuMaskNV;
        /* 2181 */ PFNGLASYNCCOPYBUFFERSUBDATANVXPROC AsyncCopyBufferSubDataNVX;
        /* 2182 */ PFNGLASYNCCOPYIMAGESUBDATANVXPROC AsyncCopyImageSubDataNVX;
        /* 2183 */ PFNGLMULTICASTSCISSORARRAYVNVXPROC MulticastScissorArrayvNVX;
        /* 2184 */ PFNGLMULTICASTVIEWPORTARRAYVNVXPROC MulticastViewportArrayvNVX;
        /* 2185 */ PFNGLMULTICASTVIEWPORTPOSITIONWSCALENVXPROC MulticastViewportPositionWScaleNVX;
        /* 2186 */ PFNGLUPLOADGPUMASKNVXPROC UploadGpuMaskNVX;
        /* 2187 */ PFNGLCLIENTWAITSEMAPHOREUI64NVXPROC ClientWaitSemaphoreui64NVX;
        /* 2188 */ PFNGLCREATEPROGRESSFENCENVXPROC CreateProgressFenceNVX;
        /* 2189 */ PFNGLSIGNALSEMAPHOREUI64NVXPROC SignalSemaphoreui64NVX;
        /* 2190 */ PFNGLWAITSEMAPHOREUI64NVXPROC WaitSemaphoreui64NVX;
        /* 2191 */ PFNGLBUFFERATTACHMEMORYNVPROC BufferAttachMemoryNV;
        /* 2192 */ PFNGLGETMEMORYOBJECTDETACHEDRESOURCESUIVNVPROC GetMemoryObjectDetachedResourcesuivNV;
        /* 2193 */ PFNGLNAMEDBUFFERATTACHMEMORYNVPROC NamedBufferAttachMemoryNV;
        /* 2194 */ PFNGLRESETMEMORYOBJECTPARAMETERNVPROC ResetMemoryObjectParameterNV;
        /* 2195 */ PFNGLTEXATTACHMEMORYNVPROC TexAttachMemoryNV;
        /* 2196 */ PFNGLTEXTUREATTACHMEMORYNVPROC TextureAttachMemoryNV;
        /* 2197 */ PFNGLBUFFERPAGECOMMITMENTMEMNVPROC BufferPageCommitmentMemNV;
        /* 2198 */ PFNGLNAMEDBUFFERPAGECOMMITMENTMEMNVPROC NamedBufferPageCommitmentMemNV;
        /* 2199 */ PFNGLTEXPAGECOMMITMENTMEMNVPROC TexPageCommitmentMemNV;
        /* 2200 */ PFNGLTEXTUREPAGECOMMITMENTMEMNVPROC TexturePageCommitmentMemNV;
        /* 2201 */ PFNGLDRAWMESHTASKSINDIRECTNVPROC DrawMeshTasksIndirectNV;
        /* 2202 */ PFNGLDRAWMESHTASKSNVPROC DrawMeshTasksNV;
        /* 2203 */ PFNGLMULTIDRAWMESHTASKSINDIRECTCOUNTNVPROC MultiDrawMeshTasksIndirectCountNV;
        /* 2204 */ PFNGLMULTIDRAWMESHTASKSINDIRECTNVPROC MultiDrawMeshTasksIndirectNV;
        /* 2205 */ PFNGLUNIFORMMATRIX2X3FVNVPROC UniformMatrix2x3fvNV;
        /* 2206 */ PFNGLUNIFORMMATRIX2X4FVNVPROC UniformMatrix2x4fvNV;
        /* 2207 */ PFNGLUNIFORMMATRIX3X2FVNVPROC UniformMatrix3x2fvNV;
        /* 2208 */ PFNGLUNIFORMMATRIX3X4FVNVPROC UniformMatrix3x4fvNV;
        /* 2209 */ PFNGLUNIFORMMATRIX4X2FVNVPROC UniformMatrix4x2fvNV;
        /* 2210 */ PFNGLUNIFORMMATRIX4X3FVNVPROC UniformMatrix4x3fvNV;
        /* 2211 */ PFNGLBEGINOCCLUSIONQUERYNVPROC BeginOcclusionQueryNV;
        /* 2212 */ PFNGLDELETEOCCLUSIONQUERIESNVPROC DeleteOcclusionQueriesNV;
        /* 2213 */ PFNGLENDOCCLUSIONQUERYNVPROC EndOcclusionQueryNV;
        /* 2214 */ PFNGLGENOCCLUSIONQUERIESNVPROC GenOcclusionQueriesNV;
        /* 2215 */ PFNGLGETOCCLUSIONQUERYIVNVPROC GetOcclusionQueryivNV;
        /* 2216 */ PFNGLGETOCCLUSIONQUERYUIVNVPROC GetOcclusionQueryuivNV;
        /* 2217 */ PFNGLISOCCLUSIONQUERYNVPROC IsOcclusionQueryNV;
        /* 2218 */ PFNGLPROGRAMBUFFERPARAMETERSIIVNVPROC ProgramBufferParametersIivNV;
        /* 2219 */ PFNGLPROGRAMBUFFERPARAMETERSIUIVNVPROC ProgramBufferParametersIuivNV;
        /* 2220 */ PFNGLPROGRAMBUFFERPARAMETERSFVNVPROC ProgramBufferParametersfvNV;
        /* 2221 */ PFNGLCOPYPATHNVPROC CopyPathNV;
        /* 2222 */ PFNGLCOVERFILLPATHINSTANCEDNVPROC CoverFillPathInstancedNV;
        /* 2223 */ PFNGLCOVERFILLPATHNVPROC CoverFillPathNV;
        /* 2224 */ PFNGLCOVERSTROKEPATHINSTANCEDNVPROC CoverStrokePathInstancedNV;
        /* 2225 */ PFNGLCOVERSTROKEPATHNVPROC CoverStrokePathNV;
        /* 2226 */ PFNGLDELETEPATHSNVPROC DeletePathsNV;
        /* 2227 */ PFNGLGENPATHSNVPROC GenPathsNV;
        /* 2228 */ PFNGLGETPATHCOLORGENFVNVPROC GetPathColorGenfvNV;
        /* 2229 */ PFNGLGETPATHCOLORGENIVNVPROC GetPathColorGenivNV;
        /* 2230 */ PFNGLGETPATHCOMMANDSNVPROC GetPathCommandsNV;
        /* 2231 */ PFNGLGETPATHCOORDSNVPROC GetPathCoordsNV;
        /* 2232 */ PFNGLGETPATHDASHARRAYNVPROC GetPathDashArrayNV;
        /* 2233 */ PFNGLGETPATHLENGTHNVPROC GetPathLengthNV;
        /* 2234 */ PFNGLGETPATHMETRICRANGENVPROC GetPathMetricRangeNV;
        /* 2235 */ PFNGLGETPATHMETRICSNVPROC GetPathMetricsNV;
        /* 2236 */ PFNGLGETPATHPARAMETERFVNVPROC GetPathParameterfvNV;
        /* 2237 */ PFNGLGETPATHPARAMETERIVNVPROC GetPathParameterivNV;
        /* 2238 */ PFNGLGETPATHSPACINGNVPROC GetPathSpacingNV;
        /* 2239 */ PFNGLGETPATHTEXGENFVNVPROC GetPathTexGenfvNV;
        /* 2240 */ PFNGLGETPATHTEXGENIVNVPROC GetPathTexGenivNV;
        /* 2241 */ PFNGLGETPROGRAMRESOURCEFVNVPROC GetProgramResourcefvNV;
        /* 2242 */ PFNGLINTERPOLATEPATHSNVPROC InterpolatePathsNV;
        /* 2243 */ PFNGLISPATHNVPROC IsPathNV;
        /* 2244 */ PFNGLISPOINTINFILLPATHNVPROC IsPointInFillPathNV;
        /* 2245 */ PFNGLISPOINTINSTROKEPATHNVPROC IsPointInStrokePathNV;
        /* 2246 */ PFNGLMATRIXLOAD3X2FNVPROC MatrixLoad3x2fNV;
        /* 2247 */ PFNGLMATRIXLOAD3X3FNVPROC MatrixLoad3x3fNV;
        /* 2248 */ PFNGLMATRIXLOADTRANSPOSE3X3FNVPROC MatrixLoadTranspose3x3fNV;
        /* 2249 */ PFNGLMATRIXMULT3X2FNVPROC MatrixMult3x2fNV;
        /* 2250 */ PFNGLMATRIXMULT3X3FNVPROC MatrixMult3x3fNV;
        /* 2251 */ PFNGLMATRIXMULTTRANSPOSE3X3FNVPROC MatrixMultTranspose3x3fNV;
        /* 2252 */ PFNGLPATHCOLORGENNVPROC PathColorGenNV;
        /* 2253 */ PFNGLPATHCOMMANDSNVPROC PathCommandsNV;
        /* 2254 */ PFNGLPATHCOORDSNVPROC PathCoordsNV;
        /* 2255 */ PFNGLPATHCOVERDEPTHFUNCNVPROC PathCoverDepthFuncNV;
        /* 2256 */ PFNGLPATHDASHARRAYNVPROC PathDashArrayNV;
        /* 2257 */ PFNGLPATHFOGGENNVPROC PathFogGenNV;
        /* 2258 */ PFNGLPATHGLYPHINDEXARRAYNVPROC PathGlyphIndexArrayNV;
        /* 2259 */ PFNGLPATHGLYPHINDEXRANGENVPROC PathGlyphIndexRangeNV;
        /* 2260 */ PFNGLPATHGLYPHRANGENVPROC PathGlyphRangeNV;
        /* 2261 */ PFNGLPATHGLYPHSNVPROC PathGlyphsNV;
        /* 2262 */ PFNGLPATHMEMORYGLYPHINDEXARRAYNVPROC PathMemoryGlyphIndexArrayNV;
        /* 2263 */ PFNGLPATHPARAMETERFNVPROC PathParameterfNV;
        /* 2264 */ PFNGLPATHPARAMETERFVNVPROC PathParameterfvNV;
        /* 2265 */ PFNGLPATHPARAMETERINVPROC PathParameteriNV;
        /* 2266 */ PFNGLPATHPARAMETERIVNVPROC PathParameterivNV;
        /* 2267 */ PFNGLPATHSTENCILDEPTHOFFSETNVPROC PathStencilDepthOffsetNV;
        /* 2268 */ PFNGLPATHSTENCILFUNCNVPROC PathStencilFuncNV;
        /* 2269 */ PFNGLPATHSTRINGNVPROC PathStringNV;
        /* 2270 */ PFNGLPATHSUBCOMMANDSNVPROC PathSubCommandsNV;
        /* 2271 */ PFNGLPATHSUBCOORDSNVPROC PathSubCoordsNV;
        /* 2272 */ PFNGLPATHTEXGENNVPROC PathTexGenNV;
        /* 2273 */ PFNGLPOINTALONGPATHNVPROC PointAlongPathNV;
        /* 2274 */ PFNGLPROGRAMPATHFRAGMENTINPUTGENNVPROC ProgramPathFragmentInputGenNV;
        /* 2275 */ PFNGLSTENCILFILLPATHINSTANCEDNVPROC StencilFillPathInstancedNV;
        /* 2276 */ PFNGLSTENCILFILLPATHNVPROC StencilFillPathNV;
        /* 2277 */ PFNGLSTENCILSTROKEPATHINSTANCEDNVPROC StencilStrokePathInstancedNV;
        /* 2278 */ PFNGLSTENCILSTROKEPATHNVPROC StencilStrokePathNV;
        /* 2279 */ PFNGLSTENCILTHENCOVERFILLPATHINSTANCEDNVPROC StencilThenCoverFillPathInstancedNV;
        /* 2280 */ PFNGLSTENCILTHENCOVERFILLPATHNVPROC StencilThenCoverFillPathNV;
        /* 2281 */ PFNGLSTENCILTHENCOVERSTROKEPATHINSTANCEDNVPROC StencilThenCoverStrokePathInstancedNV;
        /* 2282 */ PFNGLSTENCILTHENCOVERSTROKEPATHNVPROC StencilThenCoverStrokePathNV;
        /* 2283 */ PFNGLTRANSFORMPATHNVPROC TransformPathNV;
        /* 2284 */ PFNGLWEIGHTPATHSNVPROC WeightPathsNV;
        /* 2285 */ PFNGLFLUSHPIXELDATARANGENVPROC FlushPixelDataRangeNV;
        /* 2286 */ PFNGLPIXELDATARANGENVPROC PixelDataRangeNV;
        /* 2287 */ PFNGLPOINTPARAMETERINVPROC PointParameteriNV;
        /* 2288 */ PFNGLPOINTPARAMETERIVNVPROC PointParameterivNV;
        /* 2289 */ PFNGLPOLYGONMODENVPROC PolygonModeNV;
        /* 2290 */ PFNGLGETVIDEOI64VNVPROC GetVideoi64vNV;
        /* 2291 */ PFNGLGETVIDEOIVNVPROC GetVideoivNV;
        /* 2292 */ PFNGLGETVIDEOUI64VNVPROC GetVideoui64vNV;
        /* 2293 */ PFNGLGETVIDEOUIVNVPROC GetVideouivNV;
        /* 2294 */ PFNGLPRESENTFRAMEDUALFILLNVPROC PresentFrameDualFillNV;
        /* 2295 */ PFNGLPRESENTFRAMEKEYEDNVPROC PresentFrameKeyedNV;
        /* 2296 */ PFNGLPRIMITIVERESTARTINDEXNVPROC PrimitiveRestartIndexNV;
        /* 2297 */ PFNGLPRIMITIVERESTARTNVPROC PrimitiveRestartNV;
        /* 2298 */ PFNGLQUERYRESOURCENVPROC QueryResourceNV;
        /* 2299 */ PFNGLDELETEQUERYRESOURCETAGNVPROC DeleteQueryResourceTagNV;
        /* 2300 */ PFNGLGENQUERYRESOURCETAGNVPROC GenQueryResourceTagNV;
        /* 2301 */ PFNGLQUERYRESOURCETAGNVPROC QueryResourceTagNV;
        /* 2302 */ PFNGLREADBUFFERNVPROC ReadBufferNV;
        /* 2303 */ PFNGLCOMBINERINPUTNVPROC CombinerInputNV;
        /* 2304 */ PFNGLCOMBINEROUTPUTNVPROC CombinerOutputNV;
        /* 2305 */ PFNGLCOMBINERPARAMETERFNVPROC CombinerParameterfNV;
        /* 2306 */ PFNGLCOMBINERPARAMETERFVNVPROC CombinerParameterfvNV;
        /* 2307 */ PFNGLCOMBINERPARAMETERINVPROC CombinerParameteriNV;
        /* 2308 */ PFNGLCOMBINERPARAMETERIVNVPROC CombinerParameterivNV;
        /* 2309 */ PFNGLFINALCOMBINERINPUTNVPROC FinalCombinerInputNV;
        /* 2310 */ PFNGLGETCOMBINERINPUTPARAMETERFVNVPROC GetCombinerInputParameterfvNV;
        /* 2311 */ PFNGLGETCOMBINERINPUTPARAMETERIVNVPROC GetCombinerInputParameterivNV;
        /* 2312 */ PFNGLGETCOMBINEROUTPUTPARAMETERFVNVPROC GetCombinerOutputParameterfvNV;
        /* 2313 */ PFNGLGETCOMBINEROUTPUTPARAMETERIVNVPROC GetCombinerOutputParameterivNV;
        /* 2314 */ PFNGLGETFINALCOMBINERINPUTPARAMETERFVNVPROC GetFinalCombinerInputParameterfvNV;
        /* 2315 */ PFNGLGETFINALCOMBINERINPUTPARAMETERIVNVPROC GetFinalCombinerInputParameterivNV;
        /* 2316 */ PFNGLCOMBINERSTAGEPARAMETERFVNVPROC CombinerStageParameterfvNV;
        /* 2317 */ PFNGLGETCOMBINERSTAGEPARAMETERFVNVPROC GetCombinerStageParameterfvNV;
        /* 2318 */ PFNGLFRAMEBUFFERSAMPLELOCATIONSFVNVPROC FramebufferSampleLocationsfvNV;
        /* 2319 */ PFNGLNAMEDFRAMEBUFFERSAMPLELOCATIONSFVNVPROC NamedFramebufferSampleLocationsfvNV;
        /* 2320 */ PFNGLRESOLVEDEPTHVALUESNVPROC ResolveDepthValuesNV;
        /* 2321 */ PFNGLSCISSOREXCLUSIVEARRAYVNVPROC ScissorExclusiveArrayvNV;
        /* 2322 */ PFNGLSCISSOREXCLUSIVENVPROC ScissorExclusiveNV;
        /* 2323 */ PFNGLGETBUFFERPARAMETERUI64VNVPROC GetBufferParameterui64vNV;
        /* 2324 */ PFNGLGETINTEGERUI64VNVPROC GetIntegerui64vNV;
        /* 2325 */ PFNGLGETNAMEDBUFFERPARAMETERUI64VNVPROC GetNamedBufferParameterui64vNV;
        /* 2326 */ PFNGLISBUFFERRESIDENTNVPROC IsBufferResidentNV;
        /* 2327 */ PFNGLISNAMEDBUFFERRESIDENTNVPROC IsNamedBufferResidentNV;
        /* 2328 */ PFNGLMAKEBUFFERNONRESIDENTNVPROC MakeBufferNonResidentNV;
        /* 2329 */ PFNGLMAKEBUFFERRESIDENTNVPROC MakeBufferResidentNV;
        /* 2330 */ PFNGLMAKENAMEDBUFFERNONRESIDENTNVPROC MakeNamedBufferNonResidentNV;
        /* 2331 */ PFNGLMAKENAMEDBUFFERRESIDENTNVPROC MakeNamedBufferResidentNV;
        /* 2332 */ PFNGLPROGRAMUNIFORMUI64NVPROC ProgramUniformui64NV;
        /* 2333 */ PFNGLPROGRAMUNIFORMUI64VNVPROC ProgramUniformui64vNV;
        /* 2334 */ PFNGLUNIFORMUI64NVPROC Uniformui64NV;
        /* 2335 */ PFNGLUNIFORMUI64VNVPROC Uniformui64vNV;
        /* 2336 */ PFNGLBINDSHADINGRATEIMAGENVPROC BindShadingRateImageNV;
        /* 2337 */ PFNGLGETSHADINGRATEIMAGEPALETTENVPROC GetShadingRateImagePaletteNV;
        /* 2338 */ PFNGLGETSHADINGRATESAMPLELOCATIONIVNVPROC GetShadingRateSampleLocationivNV;
        /* 2339 */ PFNGLSHADINGRATEIMAGEBARRIERNVPROC ShadingRateImageBarrierNV;
        /* 2340 */ PFNGLSHADINGRATEIMAGEPALETTENVPROC ShadingRateImagePaletteNV;
        /* 2341 */ PFNGLSHADINGRATESAMPLEORDERCUSTOMNVPROC ShadingRateSampleOrderCustomNV;
        /* 2342 */ PFNGLSHADINGRATESAMPLEORDERNVPROC ShadingRateSampleOrderNV;
        /* 2343 */ PFNGLTEXTUREBARRIERNVPROC TextureBarrierNV;
        /* 2344 */ PFNGLTEXIMAGE2DMULTISAMPLECOVERAGENVPROC TexImage2DMultisampleCoverageNV;
        /* 2345 */ PFNGLTEXIMAGE3DMULTISAMPLECOVERAGENVPROC TexImage3DMultisampleCoverageNV;
        /* 2346 */ PFNGLTEXTUREIMAGE2DMULTISAMPLECOVERAGENVPROC TextureImage2DMultisampleCoverageNV;
        /* 2347 */ PFNGLTEXTUREIMAGE2DMULTISAMPLENVPROC TextureImage2DMultisampleNV;
        /* 2348 */ PFNGLTEXTUREIMAGE3DMULTISAMPLECOVERAGENVPROC TextureImage3DMultisampleCoverageNV;
        /* 2349 */ PFNGLTEXTUREIMAGE3DMULTISAMPLENVPROC TextureImage3DMultisampleNV;
        /* 2350 */ PFNGLACTIVEVARYINGNVPROC ActiveVaryingNV;
        /* 2351 */ PFNGLBEGINTRANSFORMFEEDBACKNVPROC BeginTransformFeedbackNV;
        /* 2352 */ PFNGLBINDBUFFERBASENVPROC BindBufferBaseNV;
        /* 2353 */ PFNGLBINDBUFFEROFFSETNVPROC BindBufferOffsetNV;
        /* 2354 */ PFNGLBINDBUFFERRANGENVPROC BindBufferRangeNV;
        /* 2355 */ PFNGLENDTRANSFORMFEEDBACKNVPROC EndTransformFeedbackNV;
        /* 2356 */ PFNGLGETACTIVEVARYINGNVPROC GetActiveVaryingNV;
        /* 2357 */ PFNGLGETTRANSFORMFEEDBACKVARYINGNVPROC GetTransformFeedbackVaryingNV;
        /* 2358 */ PFNGLGETVARYINGLOCATIONNVPROC GetVaryingLocationNV;
        /* 2359 */ PFNGLTRANSFORMFEEDBACKATTRIBSNVPROC TransformFeedbackAttribsNV;
        /* 2360 */ PFNGLTRANSFORMFEEDBACKSTREAMATTRIBSNVPROC TransformFeedbackStreamAttribsNV;
        /* 2361 */ PFNGLTRANSFORMFEEDBACKVARYINGSNVPROC TransformFeedbackVaryingsNV;
        /* 2362 */ PFNGLBINDTRANSFORMFEEDBACKNVPROC BindTransformFeedbackNV;
        /* 2363 */ PFNGLDELETETRANSFORMFEEDBACKSNVPROC DeleteTransformFeedbacksNV;
        /* 2364 */ PFNGLDRAWTRANSFORMFEEDBACKNVPROC DrawTransformFeedbackNV;
        /* 2365 */ PFNGLGENTRANSFORMFEEDBACKSNVPROC GenTransformFeedbacksNV;
        /* 2366 */ PFNGLISTRANSFORMFEEDBACKNVPROC IsTransformFeedbackNV;
        /* 2367 */ PFNGLPAUSETRANSFORMFEEDBACKNVPROC PauseTransformFeedbackNV;
        /* 2368 */ PFNGLRESUMETRANSFORMFEEDBACKNVPROC ResumeTransformFeedbackNV;
        /* 2369 */ PFNGLVDPAUFININVPROC VDPAUFiniNV;
        /* 2370 */ PFNGLVDPAUGETSURFACEIVNVPROC VDPAUGetSurfaceivNV;
        /* 2371 */ PFNGLVDPAUINITNVPROC VDPAUInitNV;
        /* 2372 */ PFNGLVDPAUISSURFACENVPROC VDPAUIsSurfaceNV;
        /* 2373 */ PFNGLVDPAUMAPSURFACESNVPROC VDPAUMapSurfacesNV;
        /* 2374 */ PFNGLVDPAUREGISTEROUTPUTSURFACENVPROC VDPAURegisterOutputSurfaceNV;
        /* 2375 */ PFNGLVDPAUREGISTERVIDEOSURFACENVPROC VDPAURegisterVideoSurfaceNV;
        /* 2376 */ PFNGLVDPAUSURFACEACCESSNVPROC VDPAUSurfaceAccessNV;
        /* 2377 */ PFNGLVDPAUUNMAPSURFACESNVPROC VDPAUUnmapSurfacesNV;
        /* 2378 */ PFNGLVDPAUUNREGISTERSURFACENVPROC VDPAUUnregisterSurfaceNV;
        /* 2379 */ PFNGLVDPAUREGISTERVIDEOSURFACEWITHPICTURESTRUCTURENVPROC VDPAURegisterVideoSurfaceWithPictureStructureNV;
        /* 2380 */ PFNGLFLUSHVERTEXARRAYRANGENVPROC FlushVertexArrayRangeNV;
        /* 2381 */ PFNGLVERTEXARRAYRANGENVPROC VertexArrayRangeNV;
        /* 2382 */ PFNGLGETVERTEXATTRIBLI64VNVPROC GetVertexAttribLi64vNV;
        /* 2383 */ PFNGLGETVERTEXATTRIBLUI64VNVPROC GetVertexAttribLui64vNV;
        /* 2384 */ PFNGLVERTEXATTRIBL1I64NVPROC VertexAttribL1i64NV;
        /* 2385 */ PFNGLVERTEXATTRIBL1I64VNVPROC VertexAttribL1i64vNV;
        /* 2386 */ PFNGLVERTEXATTRIBL1UI64NVPROC VertexAttribL1ui64NV;
        /* 2387 */ PFNGLVERTEXATTRIBL1UI64VNVPROC VertexAttribL1ui64vNV;
        /* 2388 */ PFNGLVERTEXATTRIBL2I64NVPROC VertexAttribL2i64NV;
        /* 2389 */ PFNGLVERTEXATTRIBL2I64VNVPROC VertexAttribL2i64vNV;
        /* 2390 */ PFNGLVERTEXATTRIBL2UI64NVPROC VertexAttribL2ui64NV;
        /* 2391 */ PFNGLVERTEXATTRIBL2UI64VNVPROC VertexAttribL2ui64vNV;
        /* 2392 */ PFNGLVERTEXATTRIBL3I64NVPROC VertexAttribL3i64NV;
        /* 2393 */ PFNGLVERTEXATTRIBL3I64VNVPROC VertexAttribL3i64vNV;
        /* 2394 */ PFNGLVERTEXATTRIBL3UI64NVPROC VertexAttribL3ui64NV;
        /* 2395 */ PFNGLVERTEXATTRIBL3UI64VNVPROC VertexAttribL3ui64vNV;
        /* 2396 */ PFNGLVERTEXATTRIBL4I64NVPROC VertexAttribL4i64NV;
        /* 2397 */ PFNGLVERTEXATTRIBL4I64VNVPROC VertexAttribL4i64vNV;
        /* 2398 */ PFNGLVERTEXATTRIBL4UI64NVPROC VertexAttribL4ui64NV;
        /* 2399 */ PFNGLVERTEXATTRIBL4UI64VNVPROC VertexAttribL4ui64vNV;
        /* 2400 */ PFNGLVERTEXATTRIBLFORMATNVPROC VertexAttribLFormatNV;
        /* 2401 */ PFNGLBUFFERADDRESSRANGENVPROC BufferAddressRangeNV;
        /* 2402 */ PFNGLCOLORFORMATNVPROC ColorFormatNV;
        /* 2403 */ PFNGLEDGEFLAGFORMATNVPROC EdgeFlagFormatNV;
        /* 2404 */ PFNGLFOGCOORDFORMATNVPROC FogCoordFormatNV;
        /* 2405 */ PFNGLGETINTEGERUI64I_VNVPROC GetIntegerui64i_vNV;
        /* 2406 */ PFNGLINDEXFORMATNVPROC IndexFormatNV;
        /* 2407 */ PFNGLNORMALFORMATNVPROC NormalFormatNV;
        /* 2408 */ PFNGLSECONDARYCOLORFORMATNVPROC SecondaryColorFormatNV;
        /* 2409 */ PFNGLTEXCOORDFORMATNVPROC TexCoordFormatNV;
        /* 2410 */ PFNGLVERTEXATTRIBFORMATNVPROC VertexAttribFormatNV;
        /* 2411 */ PFNGLVERTEXATTRIBIFORMATNVPROC VertexAttribIFormatNV;
        /* 2412 */ PFNGLVERTEXFORMATNVPROC VertexFormatNV;
        /* 2413 */ PFNGLAREPROGRAMSRESIDENTNVPROC AreProgramsResidentNV;
        /* 2414 */ PFNGLBINDPROGRAMNVPROC BindProgramNV;
        /* 2415 */ PFNGLDELETEPROGRAMSNVPROC DeleteProgramsNV;
        /* 2416 */ PFNGLEXECUTEPROGRAMNVPROC ExecuteProgramNV;
        /* 2417 */ PFNGLGENPROGRAMSNVPROC GenProgramsNV;
        /* 2418 */ PFNGLGETPROGRAMPARAMETERDVNVPROC GetProgramParameterdvNV;
        /* 2419 */ PFNGLGETPROGRAMPARAMETERFVNVPROC GetProgramParameterfvNV;
        /* 2420 */ PFNGLGETPROGRAMSTRINGNVPROC GetProgramStringNV;
        /* 2421 */ PFNGLGETPROGRAMIVNVPROC GetProgramivNV;
        /* 2422 */ PFNGLGETTRACKMATRIXIVNVPROC GetTrackMatrixivNV;
        /* 2423 */ PFNGLGETVERTEXATTRIBPOINTERVNVPROC GetVertexAttribPointervNV;
        /* 2424 */ PFNGLGETVERTEXATTRIBDVNVPROC GetVertexAttribdvNV;
        /* 2425 */ PFNGLGETVERTEXATTRIBFVNVPROC GetVertexAttribfvNV;
        /* 2426 */ PFNGLGETVERTEXATTRIBIVNVPROC GetVertexAttribivNV;
        /* 2427 */ PFNGLISPROGRAMNVPROC IsProgramNV;
        /* 2428 */ PFNGLLOADPROGRAMNVPROC LoadProgramNV;
        /* 2429 */ PFNGLPROGRAMPARAMETER4DNVPROC ProgramParameter4dNV;
        /* 2430 */ PFNGLPROGRAMPARAMETER4DVNVPROC ProgramParameter4dvNV;
        /* 2431 */ PFNGLPROGRAMPARAMETER4FNVPROC ProgramParameter4fNV;
        /* 2432 */ PFNGLPROGRAMPARAMETER4FVNVPROC ProgramParameter4fvNV;
        /* 2433 */ PFNGLPROGRAMPARAMETERS4DVNVPROC ProgramParameters4dvNV;
        /* 2434 */ PFNGLPROGRAMPARAMETERS4FVNVPROC ProgramParameters4fvNV;
        /* 2435 */ PFNGLREQUESTRESIDENTPROGRAMSNVPROC RequestResidentProgramsNV;
        /* 2436 */ PFNGLTRACKMATRIXNVPROC TrackMatrixNV;
        /* 2437 */ PFNGLVERTEXATTRIB1DNVPROC VertexAttrib1dNV;
        /* 2438 */ PFNGLVERTEXATTRIB1DVNVPROC VertexAttrib1dvNV;
        /* 2439 */ PFNGLVERTEXATTRIB1FNVPROC VertexAttrib1fNV;
        /* 2440 */ PFNGLVERTEXATTRIB1FVNVPROC VertexAttrib1fvNV;
        /* 2441 */ PFNGLVERTEXATTRIB1SNVPROC VertexAttrib1sNV;
        /* 2442 */ PFNGLVERTEXATTRIB1SVNVPROC VertexAttrib1svNV;
        /* 2443 */ PFNGLVERTEXATTRIB2DNVPROC VertexAttrib2dNV;
        /* 2444 */ PFNGLVERTEXATTRIB2DVNVPROC VertexAttrib2dvNV;
        /* 2445 */ PFNGLVERTEXATTRIB2FNVPROC VertexAttrib2fNV;
        /* 2446 */ PFNGLVERTEXATTRIB2FVNVPROC VertexAttrib2fvNV;
        /* 2447 */ PFNGLVERTEXATTRIB2SNVPROC VertexAttrib2sNV;
        /* 2448 */ PFNGLVERTEXATTRIB2SVNVPROC VertexAttrib2svNV;
        /* 2449 */ PFNGLVERTEXATTRIB3DNVPROC VertexAttrib3dNV;
        /* 2450 */ PFNGLVERTEXATTRIB3DVNVPROC VertexAttrib3dvNV;
        /* 2451 */ PFNGLVERTEXATTRIB3FNVPROC VertexAttrib3fNV;
        /* 2452 */ PFNGLVERTEXATTRIB3FVNVPROC VertexAttrib3fvNV;
        /* 2453 */ PFNGLVERTEXATTRIB3SNVPROC VertexAttrib3sNV;
        /* 2454 */ PFNGLVERTEXATTRIB3SVNVPROC VertexAttrib3svNV;
        /* 2455 */ PFNGLVERTEXATTRIB4DNVPROC VertexAttrib4dNV;
        /* 2456 */ PFNGLVERTEXATTRIB4DVNVPROC VertexAttrib4dvNV;
        /* 2457 */ PFNGLVERTEXATTRIB4FNVPROC VertexAttrib4fNV;
        /* 2458 */ PFNGLVERTEXATTRIB4FVNVPROC VertexAttrib4fvNV;
        /* 2459 */ PFNGLVERTEXATTRIB4SNVPROC VertexAttrib4sNV;
        /* 2460 */ PFNGLVERTEXATTRIB4SVNVPROC VertexAttrib4svNV;
        /* 2461 */ PFNGLVERTEXATTRIB4UBNVPROC VertexAttrib4ubNV;
        /* 2462 */ PFNGLVERTEXATTRIB4UBVNVPROC VertexAttrib4ubvNV;
        /* 2463 */ PFNGLVERTEXATTRIBPOINTERNVPROC VertexAttribPointerNV;
        /* 2464 */ PFNGLVERTEXATTRIBS1DVNVPROC VertexAttribs1dvNV;
        /* 2465 */ PFNGLVERTEXATTRIBS1FVNVPROC VertexAttribs1fvNV;
        /* 2466 */ PFNGLVERTEXATTRIBS1SVNVPROC VertexAttribs1svNV;
        /* 2467 */ PFNGLVERTEXATTRIBS2DVNVPROC VertexAttribs2dvNV;
        /* 2468 */ PFNGLVERTEXATTRIBS2FVNVPROC VertexAttribs2fvNV;
        /* 2469 */ PFNGLVERTEXATTRIBS2SVNVPROC VertexAttribs2svNV;
        /* 2470 */ PFNGLVERTEXATTRIBS3DVNVPROC VertexAttribs3dvNV;
        /* 2471 */ PFNGLVERTEXATTRIBS3FVNVPROC VertexAttribs3fvNV;
        /* 2472 */ PFNGLVERTEXATTRIBS3SVNVPROC VertexAttribs3svNV;
        /* 2473 */ PFNGLVERTEXATTRIBS4DVNVPROC VertexAttribs4dvNV;
        /* 2474 */ PFNGLVERTEXATTRIBS4FVNVPROC VertexAttribs4fvNV;
        /* 2475 */ PFNGLVERTEXATTRIBS4SVNVPROC VertexAttribs4svNV;
        /* 2476 */ PFNGLVERTEXATTRIBS4UBVNVPROC VertexAttribs4ubvNV;
        /* 2477 */ PFNGLBEGINVIDEOCAPTURENVPROC BeginVideoCaptureNV;
        /* 2478 */ PFNGLBINDVIDEOCAPTURESTREAMBUFFERNVPROC BindVideoCaptureStreamBufferNV;
        /* 2479 */ PFNGLBINDVIDEOCAPTURESTREAMTEXTURENVPROC BindVideoCaptureStreamTextureNV;
        /* 2480 */ PFNGLENDVIDEOCAPTURENVPROC EndVideoCaptureNV;
        /* 2481 */ PFNGLGETVIDEOCAPTURESTREAMDVNVPROC GetVideoCaptureStreamdvNV;
        /* 2482 */ PFNGLGETVIDEOCAPTURESTREAMFVNVPROC GetVideoCaptureStreamfvNV;
        /* 2483 */ PFNGLGETVIDEOCAPTURESTREAMIVNVPROC GetVideoCaptureStreamivNV;
        /* 2484 */ PFNGLGETVIDEOCAPTUREIVNVPROC GetVideoCaptureivNV;
        /* 2485 */ PFNGLVIDEOCAPTURENVPROC VideoCaptureNV;
        /* 2486 */ PFNGLVIDEOCAPTURESTREAMPARAMETERDVNVPROC VideoCaptureStreamParameterdvNV;
        /* 2487 */ PFNGLVIDEOCAPTURESTREAMPARAMETERFVNVPROC VideoCaptureStreamParameterfvNV;
        /* 2488 */ PFNGLVIDEOCAPTURESTREAMPARAMETERIVNVPROC VideoCaptureStreamParameterivNV;
        /* 2489 */ PFNGLDEPTHRANGEARRAYFVNVPROC DepthRangeArrayfvNV;
        /* 2490 */ PFNGLDEPTHRANGEINDEXEDFNVPROC DepthRangeIndexedfNV;
        /* 2491 */ PFNGLDISABLEINVPROC DisableiNV;
        /* 2492 */ PFNGLENABLEINVPROC EnableiNV;
        /* 2493 */ PFNGLGETFLOATI_VNVPROC GetFloati_vNV;
        /* 2494 */ PFNGLISENABLEDINVPROC IsEnablediNV;
        /* 2495 */ PFNGLSCISSORARRAYVNVPROC ScissorArrayvNV;
        /* 2496 */ PFNGLSCISSORINDEXEDNVPROC ScissorIndexedNV;
        /* 2497 */ PFNGLSCISSORINDEXEDVNVPROC ScissorIndexedvNV;
        /* 2498 */ PFNGLVIEWPORTARRAYVNVPROC ViewportArrayvNV;
        /* 2499 */ PFNGLVIEWPORTINDEXEDFNVPROC ViewportIndexedfNV;
        /* 2500 */ PFNGLVIEWPORTINDEXEDFVNVPROC ViewportIndexedfvNV;
        /* 2501 */ PFNGLVIEWPORTSWIZZLENVPROC ViewportSwizzleNV;
        /* 2502 */ PFNGLEGLIMAGETARGETRENDERBUFFERSTORAGEOESPROC EGLImageTargetRenderbufferStorageOES;
        /* 2503 */ PFNGLEGLIMAGETARGETTEXTURE2DOESPROC EGLImageTargetTexture2DOES;
        /* 2504 */ PFNGLMULTITEXCOORD1BOESPROC MultiTexCoord1bOES;
        /* 2505 */ PFNGLMULTITEXCOORD1BVOESPROC MultiTexCoord1bvOES;
        /* 2506 */ PFNGLMULTITEXCOORD2BOESPROC MultiTexCoord2bOES;
        /* 2507 */ PFNGLMULTITEXCOORD2BVOESPROC MultiTexCoord2bvOES;
        /* 2508 */ PFNGLMULTITEXCOORD3BOESPROC MultiTexCoord3bOES;
        /* 2509 */ PFNGLMULTITEXCOORD3BVOESPROC MultiTexCoord3bvOES;
        /* 2510 */ PFNGLMULTITEXCOORD4BOESPROC MultiTexCoord4bOES;
        /* 2511 */ PFNGLMULTITEXCOORD4BVOESPROC MultiTexCoord4bvOES;
        /* 2512 */ PFNGLTEXCOORD1BOESPROC TexCoord1bOES;
        /* 2513 */ PFNGLTEXCOORD1BVOESPROC TexCoord1bvOES;
        /* 2514 */ PFNGLTEXCOORD2BOESPROC TexCoord2bOES;
        /* 2515 */ PFNGLTEXCOORD2BVOESPROC TexCoord2bvOES;
        /* 2516 */ PFNGLTEXCOORD3BOESPROC TexCoord3bOES;
        /* 2517 */ PFNGLTEXCOORD3BVOESPROC TexCoord3bvOES;
        /* 2518 */ PFNGLTEXCOORD4BOESPROC TexCoord4bOES;
        /* 2519 */ PFNGLTEXCOORD4BVOESPROC TexCoord4bvOES;
        /* 2520 */ PFNGLVERTEX2BOESPROC Vertex2bOES;
        /* 2521 */ PFNGLVERTEX2BVOESPROC Vertex2bvOES;
        /* 2522 */ PFNGLVERTEX3BOESPROC Vertex3bOES;
        /* 2523 */ PFNGLVERTEX3BVOESPROC Vertex3bvOES;
        /* 2524 */ PFNGLVERTEX4BOESPROC Vertex4bOES;
        /* 2525 */ PFNGLVERTEX4BVOESPROC Vertex4bvOES;
        /* 2526 */ PFNGLCOPYIMAGESUBDATAOESPROC CopyImageSubDataOES;
        /* 2527 */ PFNGLBLENDEQUATIONSEPARATEIOESPROC BlendEquationSeparateiOES;
        /* 2528 */ PFNGLBLENDEQUATIONIOESPROC BlendEquationiOES;
        /* 2529 */ PFNGLBLENDFUNCSEPARATEIOESPROC BlendFuncSeparateiOES;
        /* 2530 */ PFNGLBLENDFUNCIOESPROC BlendFunciOES;
        /* 2531 */ PFNGLCOLORMASKIOESPROC ColorMaskiOES;
        /* 2532 */ PFNGLDISABLEIOESPROC DisableiOES;
        /* 2533 */ PFNGLENABLEIOESPROC EnableiOES;
        /* 2534 */ PFNGLISENABLEDIOESPROC IsEnablediOES;
        /* 2535 */ PFNGLDRAWELEMENTSBASEVERTEXOESPROC DrawElementsBaseVertexOES;
        /* 2536 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXOESPROC DrawElementsInstancedBaseVertexOES;
        /* 2537 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXOESPROC DrawRangeElementsBaseVertexOES;
        /* 2538 */ PFNGLACCUMXOESPROC AccumxOES;
        /* 2539 */ PFNGLALPHAFUNCXOESPROC AlphaFuncxOES;
        /* 2540 */ PFNGLBITMAPXOESPROC BitmapxOES;
        /* 2541 */ PFNGLBLENDCOLORXOESPROC BlendColorxOES;
        /* 2542 */ PFNGLCLEARACCUMXOESPROC ClearAccumxOES;
        /* 2543 */ PFNGLCLEARCOLORXOESPROC ClearColorxOES;
        /* 2544 */ PFNGLCLEARDEPTHXOESPROC ClearDepthxOES;
        /* 2545 */ PFNGLCLIPPLANEXOESPROC ClipPlanexOES;
        /* 2546 */ PFNGLCOLOR3XOESPROC Color3xOES;
        /* 2547 */ PFNGLCOLOR3XVOESPROC Color3xvOES;
        /* 2548 */ PFNGLCOLOR4XOESPROC Color4xOES;
        /* 2549 */ PFNGLCOLOR4XVOESPROC Color4xvOES;
        /* 2550 */ PFNGLCONVOLUTIONPARAMETERXOESPROC ConvolutionParameterxOES;
        /* 2551 */ PFNGLCONVOLUTIONPARAMETERXVOESPROC ConvolutionParameterxvOES;
        /* 2552 */ PFNGLDEPTHRANGEXOESPROC DepthRangexOES;
        /* 2553 */ PFNGLEVALCOORD1XOESPROC EvalCoord1xOES;
        /* 2554 */ PFNGLEVALCOORD1XVOESPROC EvalCoord1xvOES;
        /* 2555 */ PFNGLEVALCOORD2XOESPROC EvalCoord2xOES;
        /* 2556 */ PFNGLEVALCOORD2XVOESPROC EvalCoord2xvOES;
        /* 2557 */ PFNGLFEEDBACKBUFFERXOESPROC FeedbackBufferxOES;
        /* 2558 */ PFNGLFOGXOESPROC FogxOES;
        /* 2559 */ PFNGLFOGXVOESPROC FogxvOES;
        /* 2560 */ PFNGLFRUSTUMXOESPROC FrustumxOES;
        /* 2561 */ PFNGLGETCLIPPLANEXOESPROC GetClipPlanexOES;
        /* 2562 */ PFNGLGETCONVOLUTIONPARAMETERXVOESPROC GetConvolutionParameterxvOES;
        /* 2563 */ PFNGLGETFIXEDVOESPROC GetFixedvOES;
        /* 2564 */ PFNGLGETHISTOGRAMPARAMETERXVOESPROC GetHistogramParameterxvOES;
        /* 2565 */ PFNGLGETLIGHTXOESPROC GetLightxOES;
        /* 2566 */ PFNGLGETMAPXVOESPROC GetMapxvOES;
        /* 2567 */ PFNGLGETMATERIALXOESPROC GetMaterialxOES;
        /* 2568 */ PFNGLGETPIXELMAPXVPROC GetPixelMapxv;
        /* 2569 */ PFNGLGETTEXENVXVOESPROC GetTexEnvxvOES;
        /* 2570 */ PFNGLGETTEXGENXVOESPROC GetTexGenxvOES;
        /* 2571 */ PFNGLGETTEXLEVELPARAMETERXVOESPROC GetTexLevelParameterxvOES;
        /* 2572 */ PFNGLGETTEXPARAMETERXVOESPROC GetTexParameterxvOES;
        /* 2573 */ PFNGLINDEXXOESPROC IndexxOES;
        /* 2574 */ PFNGLINDEXXVOESPROC IndexxvOES;
        /* 2575 */ PFNGLLIGHTMODELXOESPROC LightModelxOES;
        /* 2576 */ PFNGLLIGHTMODELXVOESPROC LightModelxvOES;
        /* 2577 */ PFNGLLIGHTXOESPROC LightxOES;
        /* 2578 */ PFNGLLIGHTXVOESPROC LightxvOES;
        /* 2579 */ PFNGLLINEWIDTHXOESPROC LineWidthxOES;
        /* 2580 */ PFNGLLOADMATRIXXOESPROC LoadMatrixxOES;
        /* 2581 */ PFNGLLOADTRANSPOSEMATRIXXOESPROC LoadTransposeMatrixxOES;
        /* 2582 */ PFNGLMAP1XOESPROC Map1xOES;
        /* 2583 */ PFNGLMAP2XOESPROC Map2xOES;
        /* 2584 */ PFNGLMAPGRID1XOESPROC MapGrid1xOES;
        /* 2585 */ PFNGLMAPGRID2XOESPROC MapGrid2xOES;
        /* 2586 */ PFNGLMATERIALXOESPROC MaterialxOES;
        /* 2587 */ PFNGLMATERIALXVOESPROC MaterialxvOES;
        /* 2588 */ PFNGLMULTMATRIXXOESPROC MultMatrixxOES;
        /* 2589 */ PFNGLMULTTRANSPOSEMATRIXXOESPROC MultTransposeMatrixxOES;
        /* 2590 */ PFNGLMULTITEXCOORD1XOESPROC MultiTexCoord1xOES;
        /* 2591 */ PFNGLMULTITEXCOORD1XVOESPROC MultiTexCoord1xvOES;
        /* 2592 */ PFNGLMULTITEXCOORD2XOESPROC MultiTexCoord2xOES;
        /* 2593 */ PFNGLMULTITEXCOORD2XVOESPROC MultiTexCoord2xvOES;
        /* 2594 */ PFNGLMULTITEXCOORD3XOESPROC MultiTexCoord3xOES;
        /* 2595 */ PFNGLMULTITEXCOORD3XVOESPROC MultiTexCoord3xvOES;
        /* 2596 */ PFNGLMULTITEXCOORD4XOESPROC MultiTexCoord4xOES;
        /* 2597 */ PFNGLMULTITEXCOORD4XVOESPROC MultiTexCoord4xvOES;
        /* 2598 */ PFNGLNORMAL3XOESPROC Normal3xOES;
        /* 2599 */ PFNGLNORMAL3XVOESPROC Normal3xvOES;
        /* 2600 */ PFNGLORTHOXOESPROC OrthoxOES;
        /* 2601 */ PFNGLPASSTHROUGHXOESPROC PassThroughxOES;
        /* 2602 */ PFNGLPIXELMAPXPROC PixelMapx;
        /* 2603 */ PFNGLPIXELSTOREXPROC PixelStorex;
        /* 2604 */ PFNGLPIXELTRANSFERXOESPROC PixelTransferxOES;
        /* 2605 */ PFNGLPIXELZOOMXOESPROC PixelZoomxOES;
        /* 2606 */ PFNGLPOINTPARAMETERXVOESPROC PointParameterxvOES;
        /* 2607 */ PFNGLPOINTSIZEXOESPROC PointSizexOES;
        /* 2608 */ PFNGLPOLYGONOFFSETXOESPROC PolygonOffsetxOES;
        /* 2609 */ PFNGLPRIORITIZETEXTURESXOESPROC PrioritizeTexturesxOES;
        /* 2610 */ PFNGLRASTERPOS2XOESPROC RasterPos2xOES;
        /* 2611 */ PFNGLRASTERPOS2XVOESPROC RasterPos2xvOES;
        /* 2612 */ PFNGLRASTERPOS3XOESPROC RasterPos3xOES;
        /* 2613 */ PFNGLRASTERPOS3XVOESPROC RasterPos3xvOES;
        /* 2614 */ PFNGLRASTERPOS4XOESPROC RasterPos4xOES;
        /* 2615 */ PFNGLRASTERPOS4XVOESPROC RasterPos4xvOES;
        /* 2616 */ PFNGLRECTXOESPROC RectxOES;
        /* 2617 */ PFNGLRECTXVOESPROC RectxvOES;
        /* 2618 */ PFNGLROTATEXOESPROC RotatexOES;
        /* 2619 */ PFNGLSCALEXOESPROC ScalexOES;
        /* 2620 */ PFNGLTEXCOORD1XOESPROC TexCoord1xOES;
        /* 2621 */ PFNGLTEXCOORD1XVOESPROC TexCoord1xvOES;
        /* 2622 */ PFNGLTEXCOORD2XOESPROC TexCoord2xOES;
        /* 2623 */ PFNGLTEXCOORD2XVOESPROC TexCoord2xvOES;
        /* 2624 */ PFNGLTEXCOORD3XOESPROC TexCoord3xOES;
        /* 2625 */ PFNGLTEXCOORD3XVOESPROC TexCoord3xvOES;
        /* 2626 */ PFNGLTEXCOORD4XOESPROC TexCoord4xOES;
        /* 2627 */ PFNGLTEXCOORD4XVOESPROC TexCoord4xvOES;
        /* 2628 */ PFNGLTEXENVXOESPROC TexEnvxOES;
        /* 2629 */ PFNGLTEXENVXVOESPROC TexEnvxvOES;
        /* 2630 */ PFNGLTEXGENXOESPROC TexGenxOES;
        /* 2631 */ PFNGLTEXGENXVOESPROC TexGenxvOES;
        /* 2632 */ PFNGLTEXPARAMETERXOESPROC TexParameterxOES;
        /* 2633 */ PFNGLTEXPARAMETERXVOESPROC TexParameterxvOES;
        /* 2634 */ PFNGLTRANSLATEXOESPROC TranslatexOES;
        /* 2635 */ PFNGLVERTEX2XOESPROC Vertex2xOES;
        /* 2636 */ PFNGLVERTEX2XVOESPROC Vertex2xvOES;
        /* 2637 */ PFNGLVERTEX3XOESPROC Vertex3xOES;
        /* 2638 */ PFNGLVERTEX3XVOESPROC Vertex3xvOES;
        /* 2639 */ PFNGLVERTEX4XOESPROC Vertex4xOES;
        /* 2640 */ PFNGLVERTEX4XVOESPROC Vertex4xvOES;
        /* 2641 */ PFNGLFRAMEBUFFERTEXTUREOESPROC FramebufferTextureOES;
        /* 2642 */ PFNGLGETPROGRAMBINARYOESPROC GetProgramBinaryOES;
        /* 2643 */ PFNGLPROGRAMBINARYOESPROC ProgramBinaryOES;
        /* 2644 */ PFNGLGETBUFFERPOINTERVOESPROC GetBufferPointervOES;
        /* 2645 */ PFNGLMAPBUFFEROESPROC MapBufferOES;
        /* 2646 */ PFNGLUNMAPBUFFEROESPROC UnmapBufferOES;
        /* 2647 */ PFNGLPRIMITIVEBOUNDINGBOXOESPROC PrimitiveBoundingBoxOES;
        /* 2648 */ PFNGLQUERYMATRIXXOESPROC QueryMatrixxOES;
        /* 2649 */ PFNGLMINSAMPLESHADINGOESPROC MinSampleShadingOES;
        /* 2650 */ PFNGLCLEARDEPTHFOESPROC ClearDepthfOES;
        /* 2651 */ PFNGLCLIPPLANEFOESPROC ClipPlanefOES;
        /* 2652 */ PFNGLDEPTHRANGEFOESPROC DepthRangefOES;
        /* 2653 */ PFNGLFRUSTUMFOESPROC FrustumfOES;
        /* 2654 */ PFNGLGETCLIPPLANEFOESPROC GetClipPlanefOES;
        /* 2655 */ PFNGLORTHOFOESPROC OrthofOES;
        /* 2656 */ PFNGLPATCHPARAMETERIOESPROC PatchParameteriOES;
        /* 2657 */ PFNGLCOMPRESSEDTEXIMAGE3DOESPROC CompressedTexImage3DOES;
        /* 2658 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DOESPROC CompressedTexSubImage3DOES;
        /* 2659 */ PFNGLCOPYTEXSUBIMAGE3DOESPROC CopyTexSubImage3DOES;
        /* 2660 */ PFNGLFRAMEBUFFERTEXTURE3DOESPROC FramebufferTexture3DOES;
        /* 2661 */ PFNGLTEXIMAGE3DOESPROC TexImage3DOES;
        /* 2662 */ PFNGLTEXSUBIMAGE3DOESPROC TexSubImage3DOES;
        /* 2663 */ PFNGLGETSAMPLERPARAMETERIIVOESPROC GetSamplerParameterIivOES;
        /* 2664 */ PFNGLGETSAMPLERPARAMETERIUIVOESPROC GetSamplerParameterIuivOES;
        /* 2665 */ PFNGLGETTEXPARAMETERIIVOESPROC GetTexParameterIivOES;
        /* 2666 */ PFNGLGETTEXPARAMETERIUIVOESPROC GetTexParameterIuivOES;
        /* 2667 */ PFNGLSAMPLERPARAMETERIIVOESPROC SamplerParameterIivOES;
        /* 2668 */ PFNGLSAMPLERPARAMETERIUIVOESPROC SamplerParameterIuivOES;
        /* 2669 */ PFNGLTEXPARAMETERIIVOESPROC TexParameterIivOES;
        /* 2670 */ PFNGLTEXPARAMETERIUIVOESPROC TexParameterIuivOES;
        /* 2671 */ PFNGLTEXBUFFEROESPROC TexBufferOES;
        /* 2672 */ PFNGLTEXBUFFERRANGEOESPROC TexBufferRangeOES;
        /* 2673 */ PFNGLTEXSTORAGE3DMULTISAMPLEOESPROC TexStorage3DMultisampleOES;
        /* 2674 */ PFNGLTEXTUREVIEWOESPROC TextureViewOES;
        /* 2675 */ PFNGLBINDVERTEXARRAYOESPROC BindVertexArrayOES;
        /* 2676 */ PFNGLDELETEVERTEXARRAYSOESPROC DeleteVertexArraysOES;
        /* 2677 */ PFNGLGENVERTEXARRAYSOESPROC GenVertexArraysOES;
        /* 2678 */ PFNGLISVERTEXARRAYOESPROC IsVertexArrayOES;
        /* 2679 */ PFNGLDEPTHRANGEARRAYFVOESPROC DepthRangeArrayfvOES;
        /* 2680 */ PFNGLDEPTHRANGEINDEXEDFOESPROC DepthRangeIndexedfOES;
        /* 2681 */ PFNGLGETFLOATI_VOESPROC GetFloati_vOES;
        /* 2682 */ PFNGLSCISSORARRAYVOESPROC ScissorArrayvOES;
        /* 2683 */ PFNGLSCISSORINDEXEDOESPROC ScissorIndexedOES;
        /* 2684 */ PFNGLSCISSORINDEXEDVOESPROC ScissorIndexedvOES;
        /* 2685 */ PFNGLVIEWPORTARRAYVOESPROC ViewportArrayvOES;
        /* 2686 */ PFNGLVIEWPORTINDEXEDFOESPROC ViewportIndexedfOES;
        /* 2687 */ PFNGLVIEWPORTINDEXEDFVOESPROC ViewportIndexedfvOES;
        /* 2688 */ PFNGLFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC FramebufferTextureMultiviewOVR;
        /* 2689 */ PFNGLNAMEDFRAMEBUFFERTEXTUREMULTIVIEWOVRPROC NamedFramebufferTextureMultiviewOVR;
        /* 2690 */ PFNGLFRAMEBUFFERTEXTUREMULTISAMPLEMULTIVIEWOVRPROC FramebufferTextureMultisampleMultiviewOVR;
        /* 2691 */ PFNGLHINTPGIPROC HintPGI;
        /* 2692 */ PFNGLALPHAFUNCQCOMPROC AlphaFuncQCOM;
        /* 2693 */ PFNGLDISABLEDRIVERCONTROLQCOMPROC DisableDriverControlQCOM;
        /* 2694 */ PFNGLENABLEDRIVERCONTROLQCOMPROC EnableDriverControlQCOM;
        /* 2695 */ PFNGLGETDRIVERCONTROLSTRINGQCOMPROC GetDriverControlStringQCOM;
        /* 2696 */ PFNGLGETDRIVERCONTROLSQCOMPROC GetDriverControlsQCOM;
        /* 2697 */ PFNGLEXTGETBUFFERPOINTERVQCOMPROC ExtGetBufferPointervQCOM;
        /* 2698 */ PFNGLEXTGETBUFFERSQCOMPROC ExtGetBuffersQCOM;
        /* 2699 */ PFNGLEXTGETFRAMEBUFFERSQCOMPROC ExtGetFramebuffersQCOM;
        /* 2700 */ PFNGLEXTGETRENDERBUFFERSQCOMPROC ExtGetRenderbuffersQCOM;
        /* 2701 */ PFNGLEXTGETTEXLEVELPARAMETERIVQCOMPROC ExtGetTexLevelParameterivQCOM;
        /* 2702 */ PFNGLEXTGETTEXSUBIMAGEQCOMPROC ExtGetTexSubImageQCOM;
        /* 2703 */ PFNGLEXTGETTEXTURESQCOMPROC ExtGetTexturesQCOM;
        /* 2704 */ PFNGLEXTTEXOBJECTSTATEOVERRIDEIQCOMPROC ExtTexObjectStateOverrideiQCOM;
        /* 2705 */ PFNGLEXTGETPROGRAMBINARYSOURCEQCOMPROC ExtGetProgramBinarySourceQCOM;
        /* 2706 */ PFNGLEXTGETPROGRAMSQCOMPROC ExtGetProgramsQCOM;
        /* 2707 */ PFNGLEXTGETSHADERSQCOMPROC ExtGetShadersQCOM;
        /* 2708 */ PFNGLEXTISPROGRAMBINARYQCOMPROC ExtIsProgramBinaryQCOM;
        /* 2709 */ PFNGLFRAMEBUFFERFOVEATIONCONFIGQCOMPROC FramebufferFoveationConfigQCOM;
        /* 2710 */ PFNGLFRAMEBUFFERFOVEATIONPARAMETERSQCOMPROC FramebufferFoveationParametersQCOM;
        /* 2711 */ PFNGLTEXESTIMATEMOTIONQCOMPROC TexEstimateMotionQCOM;
        /* 2712 */ PFNGLTEXESTIMATEMOTIONREGIONSQCOMPROC TexEstimateMotionRegionsQCOM;
        /* 2713 */ PFNGLEXTRAPOLATETEX2DQCOMPROC ExtrapolateTex2DQCOM;
        /* 2714 */ PFNGLTEXTUREFOVEATIONPARAMETERSQCOMPROC TextureFoveationParametersQCOM;
        /* 2715 */ PFNGLFRAMEBUFFERFETCHBARRIERQCOMPROC FramebufferFetchBarrierQCOM;
        /* 2716 */ PFNGLSHADINGRATEQCOMPROC ShadingRateQCOM;
        /* 2717 */ PFNGLENDTILINGQCOMPROC EndTilingQCOM;
        /* 2718 */ PFNGLSTARTTILINGQCOMPROC StartTilingQCOM;
        /* 2719 */ PFNGLDETAILTEXFUNCSGISPROC DetailTexFuncSGIS;
        /* 2720 */ PFNGLGETDETAILTEXFUNCSGISPROC GetDetailTexFuncSGIS;
        /* 2721 */ PFNGLFOGFUNCSGISPROC FogFuncSGIS;
        /* 2722 */ PFNGLGETFOGFUNCSGISPROC GetFogFuncSGIS;
        /* 2723 */ PFNGLSAMPLEMASKSGISPROC SampleMaskSGIS;
        /* 2724 */ PFNGLSAMPLEPATTERNSGISPROC SamplePatternSGIS;
        /* 2725 */ PFNGLGETPIXELTEXGENPARAMETERFVSGISPROC GetPixelTexGenParameterfvSGIS;
        /* 2726 */ PFNGLGETPIXELTEXGENPARAMETERIVSGISPROC GetPixelTexGenParameterivSGIS;
        /* 2727 */ PFNGLPIXELTEXGENPARAMETERFSGISPROC PixelTexGenParameterfSGIS;
        /* 2728 */ PFNGLPIXELTEXGENPARAMETERFVSGISPROC PixelTexGenParameterfvSGIS;
        /* 2729 */ PFNGLPIXELTEXGENPARAMETERISGISPROC PixelTexGenParameteriSGIS;
        /* 2730 */ PFNGLPIXELTEXGENPARAMETERIVSGISPROC PixelTexGenParameterivSGIS;
        /* 2731 */ PFNGLPOINTPARAMETERFSGISPROC PointParameterfSGIS;
        /* 2732 */ PFNGLPOINTPARAMETERFVSGISPROC PointParameterfvSGIS;
        /* 2733 */ PFNGLGETSHARPENTEXFUNCSGISPROC GetSharpenTexFuncSGIS;
        /* 2734 */ PFNGLSHARPENTEXFUNCSGISPROC SharpenTexFuncSGIS;
        /* 2735 */ PFNGLTEXIMAGE4DSGISPROC TexImage4DSGIS;
        /* 2736 */ PFNGLTEXSUBIMAGE4DSGISPROC TexSubImage4DSGIS;
        /* 2737 */ PFNGLTEXTURECOLORMASKSGISPROC TextureColorMaskSGIS;
        /* 2738 */ PFNGLGETTEXFILTERFUNCSGISPROC GetTexFilterFuncSGIS;
        /* 2739 */ PFNGLTEXFILTERFUNCSGISPROC TexFilterFuncSGIS;
        /* 2740 */ PFNGLASYNCMARKERSGIXPROC AsyncMarkerSGIX;
        /* 2741 */ PFNGLDELETEASYNCMARKERSSGIXPROC DeleteAsyncMarkersSGIX;
        /* 2742 */ PFNGLFINISHASYNCSGIXPROC FinishAsyncSGIX;
        /* 2743 */ PFNGLGENASYNCMARKERSSGIXPROC GenAsyncMarkersSGIX;
        /* 2744 */ PFNGLISASYNCMARKERSGIXPROC IsAsyncMarkerSGIX;
        /* 2745 */ PFNGLPOLLASYNCSGIXPROC PollAsyncSGIX;
        /* 2746 */ PFNGLFLUSHRASTERSGIXPROC FlushRasterSGIX;
        /* 2747 */ PFNGLFRAGMENTCOLORMATERIALSGIXPROC FragmentColorMaterialSGIX;
        /* 2748 */ PFNGLFRAGMENTLIGHTMODELFSGIXPROC FragmentLightModelfSGIX;
        /* 2749 */ PFNGLFRAGMENTLIGHTMODELFVSGIXPROC FragmentLightModelfvSGIX;
        /* 2750 */ PFNGLFRAGMENTLIGHTMODELISGIXPROC FragmentLightModeliSGIX;
        /* 2751 */ PFNGLFRAGMENTLIGHTMODELIVSGIXPROC FragmentLightModelivSGIX;
        /* 2752 */ PFNGLFRAGMENTLIGHTFSGIXPROC FragmentLightfSGIX;
        /* 2753 */ PFNGLFRAGMENTLIGHTFVSGIXPROC FragmentLightfvSGIX;
        /* 2754 */ PFNGLFRAGMENTLIGHTISGIXPROC FragmentLightiSGIX;
        /* 2755 */ PFNGLFRAGMENTLIGHTIVSGIXPROC FragmentLightivSGIX;
        /* 2756 */ PFNGLFRAGMENTMATERIALFSGIXPROC FragmentMaterialfSGIX;
        /* 2757 */ PFNGLFRAGMENTMATERIALFVSGIXPROC FragmentMaterialfvSGIX;
        /* 2758 */ PFNGLFRAGMENTMATERIALISGIXPROC FragmentMaterialiSGIX;
        /* 2759 */ PFNGLFRAGMENTMATERIALIVSGIXPROC FragmentMaterialivSGIX;
        /* 2760 */ PFNGLGETFRAGMENTLIGHTFVSGIXPROC GetFragmentLightfvSGIX;
        /* 2761 */ PFNGLGETFRAGMENTLIGHTIVSGIXPROC GetFragmentLightivSGIX;
        /* 2762 */ PFNGLGETFRAGMENTMATERIALFVSGIXPROC GetFragmentMaterialfvSGIX;
        /* 2763 */ PFNGLGETFRAGMENTMATERIALIVSGIXPROC GetFragmentMaterialivSGIX;
        /* 2764 */ PFNGLLIGHTENVISGIXPROC LightEnviSGIX;
        /* 2765 */ PFNGLFRAMEZOOMSGIXPROC FrameZoomSGIX;
        /* 2766 */ PFNGLIGLOOINTERFACESGIXPROC IglooInterfaceSGIX;
        /* 2767 */ PFNGLGETINSTRUMENTSSGIXPROC GetInstrumentsSGIX;
        /* 2768 */ PFNGLINSTRUMENTSBUFFERSGIXPROC InstrumentsBufferSGIX;
        /* 2769 */ PFNGLPOLLINSTRUMENTSSGIXPROC PollInstrumentsSGIX;
        /* 2770 */ PFNGLREADINSTRUMENTSSGIXPROC ReadInstrumentsSGIX;
        /* 2771 */ PFNGLSTARTINSTRUMENTSSGIXPROC StartInstrumentsSGIX;
        /* 2772 */ PFNGLSTOPINSTRUMENTSSGIXPROC StopInstrumentsSGIX;
        /* 2773 */ PFNGLGETLISTPARAMETERFVSGIXPROC GetListParameterfvSGIX;
        /* 2774 */ PFNGLGETLISTPARAMETERIVSGIXPROC GetListParameterivSGIX;
        /* 2775 */ PFNGLLISTPARAMETERFSGIXPROC ListParameterfSGIX;
        /* 2776 */ PFNGLLISTPARAMETERFVSGIXPROC ListParameterfvSGIX;
        /* 2777 */ PFNGLLISTPARAMETERISGIXPROC ListParameteriSGIX;
        /* 2778 */ PFNGLLISTPARAMETERIVSGIXPROC ListParameterivSGIX;
        /* 2779 */ PFNGLPIXELTEXGENSGIXPROC PixelTexGenSGIX;
        /* 2780 */ PFNGLDEFORMSGIXPROC DeformSGIX;
        /* 2781 */ PFNGLDEFORMATIONMAP3DSGIXPROC DeformationMap3dSGIX;
        /* 2782 */ PFNGLDEFORMATIONMAP3FSGIXPROC DeformationMap3fSGIX;
        /* 2783 */ PFNGLLOADIDENTITYDEFORMATIONMAPSGIXPROC LoadIdentityDeformationMapSGIX;
        /* 2784 */ PFNGLREFERENCEPLANESGIXPROC ReferencePlaneSGIX;
        /* 2785 */ PFNGLSPRITEPARAMETERFSGIXPROC SpriteParameterfSGIX;
        /* 2786 */ PFNGLSPRITEPARAMETERFVSGIXPROC SpriteParameterfvSGIX;
        /* 2787 */ PFNGLSPRITEPARAMETERISGIXPROC SpriteParameteriSGIX;
        /* 2788 */ PFNGLSPRITEPARAMETERIVSGIXPROC SpriteParameterivSGIX;
        /* 2789 */ PFNGLTAGSAMPLEBUFFERSGIXPROC TagSampleBufferSGIX;
        /* 2790 */ PFNGLCOLORTABLEPARAMETERFVSGIPROC ColorTableParameterfvSGI;
        /* 2791 */ PFNGLCOLORTABLEPARAMETERIVSGIPROC ColorTableParameterivSGI;
        /* 2792 */ PFNGLCOLORTABLESGIPROC ColorTableSGI;
        /* 2793 */ PFNGLCOPYCOLORTABLESGIPROC CopyColorTableSGI;
        /* 2794 */ PFNGLGETCOLORTABLEPARAMETERFVSGIPROC GetColorTableParameterfvSGI;
        /* 2795 */ PFNGLGETCOLORTABLEPARAMETERIVSGIPROC GetColorTableParameterivSGI;
        /* 2796 */ PFNGLGETCOLORTABLESGIPROC GetColorTableSGI;
        /* 2797 */ PFNGLFINISHTEXTURESUNXPROC FinishTextureSUNX;
        /* 2798 */ PFNGLGLOBALALPHAFACTORBSUNPROC GlobalAlphaFactorbSUN;
        /* 2799 */ PFNGLGLOBALALPHAFACTORDSUNPROC GlobalAlphaFactordSUN;
        /* 2800 */ PFNGLGLOBALALPHAFACTORFSUNPROC GlobalAlphaFactorfSUN;
        /* 2801 */ PFNGLGLOBALALPHAFACTORISUNPROC GlobalAlphaFactoriSUN;
        /* 2802 */ PFNGLGLOBALALPHAFACTORSSUNPROC GlobalAlphaFactorsSUN;
        /* 2803 */ PFNGLGLOBALALPHAFACTORUBSUNPROC GlobalAlphaFactorubSUN;
        /* 2804 */ PFNGLGLOBALALPHAFACTORUISUNPROC GlobalAlphaFactoruiSUN;
        /* 2805 */ PFNGLGLOBALALPHAFACTORUSSUNPROC GlobalAlphaFactorusSUN;
        /* 2806 */ PFNGLDRAWMESHARRAYSSUNPROC DrawMeshArraysSUN;
        /* 2807 */ PFNGLREPLACEMENTCODEPOINTERSUNPROC ReplacementCodePointerSUN;
        /* 2808 */ PFNGLREPLACEMENTCODEUBSUNPROC ReplacementCodeubSUN;
        /* 2809 */ PFNGLREPLACEMENTCODEUBVSUNPROC ReplacementCodeubvSUN;
        /* 2810 */ PFNGLREPLACEMENTCODEUISUNPROC ReplacementCodeuiSUN;
        /* 2811 */ PFNGLREPLACEMENTCODEUIVSUNPROC ReplacementCodeuivSUN;
        /* 2812 */ PFNGLREPLACEMENTCODEUSSUNPROC ReplacementCodeusSUN;
        /* 2813 */ PFNGLREPLACEMENTCODEUSVSUNPROC ReplacementCodeusvSUN;
        /* 2814 */ PFNGLCOLOR3FVERTEX3FSUNPROC Color3fVertex3fSUN;
        /* 2815 */ PFNGLCOLOR3FVERTEX3FVSUNPROC Color3fVertex3fvSUN;
        /* 2816 */ PFNGLCOLOR4FNORMAL3FVERTEX3FSUNPROC Color4fNormal3fVertex3fSUN;
        /* 2817 */ PFNGLCOLOR4FNORMAL3FVERTEX3FVSUNPROC Color4fNormal3fVertex3fvSUN;
        /* 2818 */ PFNGLCOLOR4UBVERTEX2FSUNPROC Color4ubVertex2fSUN;
        /* 2819 */ PFNGLCOLOR4UBVERTEX2FVSUNPROC Color4ubVertex2fvSUN;
        /* 2820 */ PFNGLCOLOR4UBVERTEX3FSUNPROC Color4ubVertex3fSUN;
        /* 2821 */ PFNGLCOLOR4UBVERTEX3FVSUNPROC Color4ubVertex3fvSUN;
        /* 2822 */ PFNGLNORMAL3FVERTEX3FSUNPROC Normal3fVertex3fSUN;
        /* 2823 */ PFNGLNORMAL3FVERTEX3FVSUNPROC Normal3fVertex3fvSUN;
        /* 2824 */ PFNGLREPLACEMENTCODEUICOLOR3FVERTEX3FSUNPROC ReplacementCodeuiColor3fVertex3fSUN;
        /* 2825 */ PFNGLREPLACEMENTCODEUICOLOR3FVERTEX3FVSUNPROC ReplacementCodeuiColor3fVertex3fvSUN;
        /* 2826 */ PFNGLREPLACEMENTCODEUICOLOR4FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiColor4fNormal3fVertex3fSUN;
        /* 2827 */ PFNGLREPLACEMENTCODEUICOLOR4FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiColor4fNormal3fVertex3fvSUN;
        /* 2828 */ PFNGLREPLACEMENTCODEUICOLOR4UBVERTEX3FSUNPROC ReplacementCodeuiColor4ubVertex3fSUN;
        /* 2829 */ PFNGLREPLACEMENTCODEUICOLOR4UBVERTEX3FVSUNPROC ReplacementCodeuiColor4ubVertex3fvSUN;
        /* 2830 */ PFNGLREPLACEMENTCODEUINORMAL3FVERTEX3FSUNPROC ReplacementCodeuiNormal3fVertex3fSUN;
        /* 2831 */ PFNGLREPLACEMENTCODEUINORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiNormal3fVertex3fvSUN;
        /* 2832 */ PFNGLREPLACEMENTCODEUITEXCOORD2FCOLOR4FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fColor4fNormal3fVertex3fSUN;
        /* 2833 */ PFNGLREPLACEMENTCODEUITEXCOORD2FCOLOR4FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fColor4fNormal3fVertex3fvSUN;
        /* 2834 */ PFNGLREPLACEMENTCODEUITEXCOORD2FNORMAL3FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fNormal3fVertex3fSUN;
        /* 2835 */ PFNGLREPLACEMENTCODEUITEXCOORD2FNORMAL3FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fNormal3fVertex3fvSUN;
        /* 2836 */ PFNGLREPLACEMENTCODEUITEXCOORD2FVERTEX3FSUNPROC ReplacementCodeuiTexCoord2fVertex3fSUN;
        /* 2837 */ PFNGLREPLACEMENTCODEUITEXCOORD2FVERTEX3FVSUNPROC ReplacementCodeuiTexCoord2fVertex3fvSUN;
        /* 2838 */ PFNGLREPLACEMENTCODEUIVERTEX3FSUNPROC ReplacementCodeuiVertex3fSUN;
        /* 2839 */ PFNGLREPLACEMENTCODEUIVERTEX3FVSUNPROC ReplacementCodeuiVertex3fvSUN;
        /* 2840 */ PFNGLTEXCOORD2FCOLOR3FVERTEX3FSUNPROC TexCoord2fColor3fVertex3fSUN;
        /* 2841 */ PFNGLTEXCOORD2FCOLOR3FVERTEX3FVSUNPROC TexCoord2fColor3fVertex3fvSUN;
        /* 2842 */ PFNGLTEXCOORD2FCOLOR4FNORMAL3FVERTEX3FSUNPROC TexCoord2fColor4fNormal3fVertex3fSUN;
        /* 2843 */ PFNGLTEXCOORD2FCOLOR4FNORMAL3FVERTEX3FVSUNPROC TexCoord2fColor4fNormal3fVertex3fvSUN;
        /* 2844 */ PFNGLTEXCOORD2FCOLOR4UBVERTEX3FSUNPROC TexCoord2fColor4ubVertex3fSUN;
        /* 2845 */ PFNGLTEXCOORD2FCOLOR4UBVERTEX3FVSUNPROC TexCoord2fColor4ubVertex3fvSUN;
        /* 2846 */ PFNGLTEXCOORD2FNORMAL3FVERTEX3FSUNPROC TexCoord2fNormal3fVertex3fSUN;
        /* 2847 */ PFNGLTEXCOORD2FNORMAL3FVERTEX3FVSUNPROC TexCoord2fNormal3fVertex3fvSUN;
        /* 2848 */ PFNGLTEXCOORD2FVERTEX3FSUNPROC TexCoord2fVertex3fSUN;
        /* 2849 */ PFNGLTEXCOORD2FVERTEX3FVSUNPROC TexCoord2fVertex3fvSUN;
        /* 2850 */ PFNGLTEXCOORD4FCOLOR4FNORMAL3FVERTEX4FSUNPROC TexCoord4fColor4fNormal3fVertex4fSUN;
        /* 2851 */ PFNGLTEXCOORD4FCOLOR4FNORMAL3FVERTEX4FVSUNPROC TexCoord4fColor4fNormal3fVertex4fvSUN;
        /* 2852 */ PFNGLTEXCOORD4FVERTEX4FSUNPROC TexCoord4fVertex4fSUN;
        /* 2853 */ PFNGLTEXCOORD4FVERTEX4FVSUNPROC TexCoord4fVertex4fvSUN;
        /* 2854 */ PFNGLBINDUNIFORMLOCATIONCHROMIUMPROC BindUniformLocationCHROMIUM;
        /* 2855 */ PFNGLCOVERAGEMODULATIONCHROMIUMPROC CoverageModulationCHROMIUM;
        /* 2856 */ PFNGLCOPYSUBTEXTURECHROMIUMPROC CopySubTextureCHROMIUM;
        /* 2857 */ PFNGLCOPYTEXTURECHROMIUMPROC CopyTextureCHROMIUM;
        /* 2858 */ PFNGLCOMPRESSEDCOPYTEXTURECHROMIUMPROC CompressedCopyTextureCHROMIUM;
        /* 2859 */ PFNGLREQUESTEXTENSIONANGLEPROC RequestExtensionANGLE;
        /* 2860 */ PFNGLACQUIRETEXTURESANGLEPROC AcquireTexturesANGLE;
        /* 2861 */ PFNGLRELEASETEXTURESANGLEPROC ReleaseTexturesANGLE;
        /* 2862 */ PFNGLGETACTIVEUNIFORMBLOCKIVROBUSTANGLEPROC GetActiveUniformBlockivRobustANGLE;
        /* 2863 */ PFNGLGETBOOLEANVROBUSTANGLEPROC GetBooleanvRobustANGLE;
        /* 2864 */ PFNGLGETBUFFERPARAMETERI64VROBUSTANGLEPROC GetBufferParameteri64vRobustANGLE;
        /* 2865 */ PFNGLGETBUFFERPARAMETERIVROBUSTANGLEPROC GetBufferParameterivRobustANGLE;
        /* 2866 */ PFNGLGETBUFFERPOINTERVROBUSTANGLEPROC GetBufferPointervRobustANGLE;
        /* 2867 */ PFNGLGETFLOATVROBUSTANGLEPROC GetFloatvRobustANGLE;
        /* 2868 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVROBUSTANGLEPROC GetFramebufferAttachmentParameterivRobustANGLE;
        /* 2869 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameterfvRobustANGLE;
        /* 2870 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameterivRobustANGLE;
        /* 2871 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERUIVROBUSTANGLEPROC GetFramebufferPixelLocalStorageParameteruivRobustANGLE;
        /* 2872 */ PFNGLGETINTEGER64I_VROBUSTANGLEPROC GetInteger64i_vRobustANGLE;
        /* 2873 */ PFNGLGETINTEGER64VROBUSTANGLEPROC GetInteger64vRobustANGLE;
        /* 2874 */ PFNGLGETINTEGERI_VROBUSTANGLEPROC GetIntegeri_vRobustANGLE;
        /* 2875 */ PFNGLGETINTEGERVROBUSTANGLEPROC GetIntegervRobustANGLE;
        /* 2876 */ PFNGLGETINTERNALFORMATIVROBUSTANGLEPROC GetInternalformativRobustANGLE;
        /* 2877 */ PFNGLGETMULTISAMPLEFVROBUSTANGLEPROC GetMultisamplefvRobustANGLE;
        /* 2878 */ PFNGLGETPROGRAMIVROBUSTANGLEPROC GetProgramivRobustANGLE;
        /* 2879 */ PFNGLGETQUERYOBJECTI64VROBUSTANGLEPROC GetQueryObjecti64vRobustANGLE;
        /* 2880 */ PFNGLGETQUERYOBJECTIVROBUSTANGLEPROC GetQueryObjectivRobustANGLE;
        /* 2881 */ PFNGLGETQUERYOBJECTUI64VROBUSTANGLEPROC GetQueryObjectui64vRobustANGLE;
        /* 2882 */ PFNGLGETQUERYOBJECTUIVROBUSTANGLEPROC GetQueryObjectuivRobustANGLE;
        /* 2883 */ PFNGLGETQUERYIVROBUSTANGLEPROC GetQueryivRobustANGLE;
        /* 2884 */ PFNGLGETRENDERBUFFERPARAMETERIVROBUSTANGLEPROC GetRenderbufferParameterivRobustANGLE;
        /* 2885 */ PFNGLGETSAMPLERPARAMETERFVROBUSTANGLEPROC GetSamplerParameterfvRobustANGLE;
        /* 2886 */ PFNGLGETSAMPLERPARAMETERIVROBUSTANGLEPROC GetSamplerParameterivRobustANGLE;
        /* 2887 */ PFNGLGETSHADERIVROBUSTANGLEPROC GetShaderivRobustANGLE;
        /* 2888 */ PFNGLGETTEXLEVELPARAMETERFVROBUSTANGLEPROC GetTexLevelParameterfvRobustANGLE;
        /* 2889 */ PFNGLGETTEXLEVELPARAMETERIVROBUSTANGLEPROC GetTexLevelParameterivRobustANGLE;
        /* 2890 */ PFNGLGETTEXPARAMETERFVROBUSTANGLEPROC GetTexParameterfvRobustANGLE;
        /* 2891 */ PFNGLGETTEXPARAMETERIVROBUSTANGLEPROC GetTexParameterivRobustANGLE;
        /* 2892 */ PFNGLGETUNIFORMFVROBUSTANGLEPROC GetUniformfvRobustANGLE;
        /* 2893 */ PFNGLGETUNIFORMIVROBUSTANGLEPROC GetUniformivRobustANGLE;
        /* 2894 */ PFNGLGETUNIFORMUIVROBUSTANGLEPROC GetUniformuivRobustANGLE;
        /* 2895 */ PFNGLGETVERTEXATTRIBIIVROBUSTANGLEPROC GetVertexAttribIivRobustANGLE;
        /* 2896 */ PFNGLGETVERTEXATTRIBIUIVROBUSTANGLEPROC GetVertexAttribIuivRobustANGLE;
        /* 2897 */ PFNGLGETVERTEXATTRIBPOINTERVROBUSTANGLEPROC GetVertexAttribPointervRobustANGLE;
        /* 2898 */ PFNGLGETVERTEXATTRIBFVROBUSTANGLEPROC GetVertexAttribfvRobustANGLE;
        /* 2899 */ PFNGLGETVERTEXATTRIBIVROBUSTANGLEPROC GetVertexAttribivRobustANGLE;
        /* 2900 */ PFNGLREADPIXELSROBUSTANGLEPROC ReadPixelsRobustANGLE;
        /* 2901 */ PFNGLSAMPLERPARAMETERFVROBUSTANGLEPROC SamplerParameterfvRobustANGLE;
        /* 2902 */ PFNGLSAMPLERPARAMETERIVROBUSTANGLEPROC SamplerParameterivRobustANGLE;
        /* 2903 */ PFNGLTEXIMAGE2DROBUSTANGLEPROC TexImage2DRobustANGLE;
        /* 2904 */ PFNGLTEXIMAGE3DROBUSTANGLEPROC TexImage3DRobustANGLE;
        /* 2905 */ PFNGLTEXPARAMETERFVROBUSTANGLEPROC TexParameterfvRobustANGLE;
        /* 2906 */ PFNGLTEXPARAMETERIVROBUSTANGLEPROC TexParameterivRobustANGLE;
        /* 2907 */ PFNGLTEXSUBIMAGE2DROBUSTANGLEPROC TexSubImage2DRobustANGLE;
        /* 2908 */ PFNGLTEXSUBIMAGE3DROBUSTANGLEPROC TexSubImage3DRobustANGLE;
        /* 2909 */ PFNGLCOPYSUBTEXTURE3DANGLEPROC CopySubTexture3DANGLE;
        /* 2910 */ PFNGLCOPYTEXTURE3DANGLEPROC CopyTexture3DANGLE;
        /* 2911 */ PFNGLGETMULTISAMPLEFVANGLEPROC GetMultisamplefvANGLE;
        /* 2912 */ PFNGLSAMPLEMASKIANGLEPROC SampleMaskiANGLE;
        /* 2913 */ PFNGLTEXSTORAGE2DMULTISAMPLEANGLEPROC TexStorage2DMultisampleANGLE;
        /* 2914 */ PFNGLMULTIDRAWARRAYSANGLEPROC MultiDrawArraysANGLE;
        /* 2915 */ PFNGLMULTIDRAWARRAYSINSTANCEDANGLEPROC MultiDrawArraysInstancedANGLE;
        /* 2916 */ PFNGLMULTIDRAWELEMENTSANGLEPROC MultiDrawElementsANGLE;
        /* 2917 */ PFNGLMULTIDRAWELEMENTSINSTANCEDANGLEPROC MultiDrawElementsInstancedANGLE;
        /* 2918 */ PFNGLDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC DrawArraysInstancedBaseInstanceANGLE;
        /* 2919 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC DrawElementsInstancedBaseVertexBaseInstanceANGLE;
        /* 2920 */ PFNGLMULTIDRAWARRAYSINSTANCEDBASEINSTANCEANGLEPROC MultiDrawArraysInstancedBaseInstanceANGLE;
        /* 2921 */ PFNGLMULTIDRAWELEMENTSINSTANCEDBASEVERTEXBASEINSTANCEANGLEPROC MultiDrawElementsInstancedBaseVertexBaseInstanceANGLE;
        /* 2922 */ PFNGLPOLYGONMODEANGLEPROC PolygonModeANGLE;
        /* 2923 */ PFNGLPROVOKINGVERTEXANGLEPROC ProvokingVertexANGLE;
        /* 2924 */ PFNGLLOSECONTEXTCHROMIUMPROC LoseContextCHROMIUM;
        /* 2925 */ PFNGLINVALIDATETEXTUREANGLEPROC InvalidateTextureANGLE;
        /* 2926 */ PFNGLTEXIMAGE2DEXTERNALANGLEPROC TexImage2DExternalANGLE;
        /* 2927 */ PFNGLGETCOMPRESSEDTEXIMAGEANGLEPROC GetCompressedTexImageANGLE;
        /* 2928 */ PFNGLGETRENDERBUFFERIMAGEANGLEPROC GetRenderbufferImageANGLE;
        /* 2929 */ PFNGLGETTEXIMAGEANGLEPROC GetTexImageANGLE;
        /* 2930 */ PFNGLGETTEXLEVELPARAMETERFVANGLEPROC GetTexLevelParameterfvANGLE;
        /* 2931 */ PFNGLGETTEXLEVELPARAMETERIVANGLEPROC GetTexLevelParameterivANGLE;
        /* 2932 */ PFNGLTEXSTORAGEMEMFLAGS2DANGLEPROC TexStorageMemFlags2DANGLE;
        /* 2933 */ PFNGLTEXSTORAGEMEMFLAGS2DMULTISAMPLEANGLEPROC TexStorageMemFlags2DMultisampleANGLE;
        /* 2934 */ PFNGLTEXSTORAGEMEMFLAGS3DANGLEPROC TexStorageMemFlags3DANGLE;
        /* 2935 */ PFNGLTEXSTORAGEMEMFLAGS3DMULTISAMPLEANGLEPROC TexStorageMemFlags3DMultisampleANGLE;
        /* 2936 */ PFNGLIMPORTMEMORYZIRCONHANDLEANGLEPROC ImportMemoryZirconHandleANGLE;
        /* 2937 */ PFNGLIMPORTSEMAPHOREZIRCONHANDLEANGLEPROC ImportSemaphoreZirconHandleANGLE;
        /* 2938 */ PFNGLBEGINPIXELLOCALSTORAGEANGLEPROC BeginPixelLocalStorageANGLE;
        /* 2939 */ PFNGLENDPIXELLOCALSTORAGEANGLEPROC EndPixelLocalStorageANGLE;
        /* 2940 */ PFNGLENDPIXELLOCALSTORAGEIMPLICITANGLEPROC EndPixelLocalStorageImplicitANGLE;
        /* 2941 */ PFNGLFRAMEBUFFERMEMORYLESSPIXELLOCALSTORAGEANGLEPROC FramebufferMemorylessPixelLocalStorageANGLE;
        /* 2942 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEFVANGLEPROC FramebufferPixelLocalClearValuefvANGLE;
        /* 2943 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEIVANGLEPROC FramebufferPixelLocalClearValueivANGLE;
        /* 2944 */ PFNGLFRAMEBUFFERPIXELLOCALCLEARVALUEUIVANGLEPROC FramebufferPixelLocalClearValueuivANGLE;
        /* 2945 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGEINTERRUPTANGLEPROC FramebufferPixelLocalStorageInterruptANGLE;
        /* 2946 */ PFNGLFRAMEBUFFERPIXELLOCALSTORAGERESTOREANGLEPROC FramebufferPixelLocalStorageRestoreANGLE;
        /* 2947 */ PFNGLFRAMEBUFFERTEXTUREPIXELLOCALSTORAGEANGLEPROC FramebufferTexturePixelLocalStorageANGLE;
        /* 2948 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERFVANGLEPROC GetFramebufferPixelLocalStorageParameterfvANGLE;
        /* 2949 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERIVANGLEPROC GetFramebufferPixelLocalStorageParameterivANGLE;
        /* 2950 */ PFNGLGETFRAMEBUFFERPIXELLOCALSTORAGEPARAMETERUIVANGLEPROC GetFramebufferPixelLocalStorageParameteruivANGLE;
        /* 2951 */ PFNGLPIXELLOCALSTORAGEBARRIERANGLEPROC PixelLocalStorageBarrierANGLE;
        /* 2952 */ PFNGLLOGICOPANGLEPROC LogicOpANGLE;
        /* 2953 */ PFNGLBLOBCACHECALLBACKSANGLEPROC BlobCacheCallbacksANGLE;
        /* 2954 */ PFNGLGETPOINTERVANGLEPROC GetPointervANGLE;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;
} GloamGLContext;

/* Global context instance — a value, not a pointer, so the compiler knows
 * its address is fixed and does not re-load it on every access.
 */
extern GloamGLContext gloam_gl_context;

/* ---- Feature presence macros --------------------------------------------
